{
  "lens": {
    "competitor": "craigslist",
    "book": "playbigger-category-design.txt",
    "book_chapters": "Part 1: The Category King Economy (Chapters 1-2) — Creation Wins, Category Is the New Strategy"
  },
  "opportunity_thesis": "Craigslist is the incumbent channel, but not the category king of this problem. The evidence shows users already feel the unframed pain (terrible recurring commutes, trust anxiety, and post-contact chaos), while Play Bigger says the company that frames the problem and builds the ecosystem wins the category. Split Lease's highest-value move is to stop competing inside classifieds UX and instead define and dominate a new category: managed, trust-backed, recurring room-sharing for hybrid workers.",
  "opportunities": [
    {
      "id": "opp-001",
      "title": "Commute Cost Category Frame",
      "based_on_disappointments": ["disappoint-009", "disappoint-001"],
      "split_lease_phases": ["discovery", "search", "evaluation"],
      "the_signature": "Make discovery start with the commute problem, not a room search. Split Lease becomes the first housing platform that quantifies hybrid-work commute pain up front (time + cash + energy), then reframes room-sharing as a recurring commute solution rather than a property hunt. The signature moment is users saying, 'I came for a room and discovered I had a solvable financial/lifestyle problem.'",
      "why_competitors_wont_copy": "Craigslist's core model is horizontal classifieds and cannot credibly pivot to a strong category POV without breaking its neutral, generic structure. Airbnb is optimized for short-stay travel economics, not recurring partial-week commuting patterns, so this framing would conflict with its current category identity and monetization logic.",
      "behavioral_framework_case": "Play Bigger Ch 2 states that the company that best frames the problem often defines and takes the category, and that winning companies market the problem, not just the solution. The Anchoring Effect implies that whoever sets the initial frame ('commute problem') controls how all alternatives are judged afterward.",
      "user_evidence": "Steve Zhang transcript: demand response was 'my commute is f*****g terrible and I would love to stay at your space... same commute for 10 years.' Tyler Wood transcript: 'I just clicked search for Chelsea' shows users forced into location-only search because no category frame exists for recurring commute relief.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "straightforward",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do not reduce this to ad copy; the problem frame must be the actual front door experience.",
        "Do not bury the frame behind account creation; problem education must happen before signup.",
        "Do not present this as generic affordability messaging; it must stay specific to recurring commute pain."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-004", "works-003"],
        "gap_assessment": "Partial overlap. Existing elements cover trust continuity and interaction speed after contact, but they do not define a pre-contact category-level problem frame. This opportunity is largely net-new at the category-design layer."
      }
    },
    {
      "id": "opp-002",
      "title": "Trust Ledger Across the Full Match Cycle",
      "based_on_disappointments": ["disappoint-004", "disappoint-008", "disappoint-003"],
      "split_lease_phases": ["listing_evaluation", "proposal_creation", "negotiation", "acceptance", "active_lease"],
      "the_signature": "Build an accumulating trust ledger that starts before first contact and compounds through the stay: verified identity and income signals, response reliability, payment reliability, and stay-period behavior signals. Instead of a single static badge or one-time review, users see a living trust narrative over time. The signature is replacing 'is this legit?' with measurable, portable trust continuity at each step.",
      "why_competitors_wont_copy": "Craigslist exits after listing/reply and lacks the transactional presence needed to generate trust-event data, so it cannot cheaply create a compounding ledger. Copying this would require deep product, policy, and operational changes that conflict with its low-intervention classifieds model.",
      "behavioral_framework_case": "Play Bigger Ch 2's Groupthink Bias and safety-in-numbers dynamic explain why trust visibility changes behavior. Ch 1's ecosystem lesson (Birdseye built the missing infrastructure) applies directly: trust in this category is not a feature, it is category infrastructure.",
      "user_evidence": "Tag call: 'I don't know if this guy is legit or what it is.' Customer call Tom: agents use a 'secret password' to prove callback legitimacy. Cristina call: agent manually explains verification stack (employment, income, references, credit, ID), proving users require this infrastructure and Craigslist does not provide it.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do not collapse trust into a binary 'verified' checkmark.",
        "Do not make verification a one-time gate; trust must update through interaction history.",
        "Do not over-index on punitive controls that raise friction without adding user-visible safety clarity."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-001", "works-004", "guest-feels-001", "guest-feels-002"],
        "gap_assessment": "Strong reinforcement on trust transitions and continuity, but incomplete on a cross-phase, compounding trust ledger model. Existing library supports pieces; this opportunity integrates them into a category-defining system."
      }
    },
    {
      "id": "opp-003",
      "title": "Structured Proposal and Response Protocol",
      "based_on_disappointments": ["disappoint-003", "disappoint-005", "disappoint-002"],
      "split_lease_phases": ["proposal_creation", "proposal_mgmt", "negotiation", "acceptance"],
      "the_signature": "Replace freeform email chaos with a structured proposal protocol: every inquiry arrives in comparable format (dates, weekly pattern, budget, identity proof level, move constraints), hosts respond with clear state transitions (accept, counter, decline, waitlist), and both sides retain persistent context. The signature is turning the current black box ('email into void') into a reliable negotiation instrument.",
      "why_competitors_wont_copy": "Craigslist's value proposition is minimal mediation; introducing structured negotiation would require identity-state, workflow-state, and inbox-state primitives absent from its architecture and brand stance. Competitors built for one-off listings also avoid this because structured protocol increases product and support complexity.",
      "behavioral_framework_case": "Play Bigger Ch 2 highlights category need for organizing principles and reduced cognitive overload. Structured protocol converts unbounded choice and ambiguity into governed decisions, which changes perceived category quality more than adding isolated UI improvements.",
      "user_evidence": "Robbie call: listing link and photos disappeared, breaking continuity mid-conversation. Nakoley call: 'went through Craigslist email, so I cannot recognize' identifies identity/context loss. Stephanie call: only relay email visible, no dependable direct communication thread.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "natural_fit"
      },
      "anti_patterns": [
        "Do not mimic generic chat; the core value is structured comparability and state clarity.",
        "Do not force long forms before intent is established; protocol should be progressive.",
        "Do not hide response expectations; explicit timing and status visibility are mandatory."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-003", "works-002", "communicates-002"],
        "gap_assessment": "Partial overlap on cognitive speed and reduced mental load, but no complete host-guest proposal protocol exists in library as a single system. This is a meaningful gap with reusable downstream design implications."
      }
    },
    {
      "id": "opp-004",
      "title": "Active-Stay Operating Layer",
      "based_on_disappointments": ["disappoint-007", "disappoint-006", "disappoint-005"],
      "split_lease_phases": ["move_in", "active_lease", "retention"],
      "the_signature": "Own the part Craigslist abandons: the actual stay. Deliver a shared operating layer for recurring stays (schedule changes, payment state, issue handling, trust updates, and end-of-stay memory) so each cycle gets easier, not reset to zero. The signature is visible continuity: users feel the platform remembers and manages the relationship over time.",
      "why_competitors_wont_copy": "Craigslist cannot capture active-stay data because communication leaves the platform immediately. Building this layer would force deep operational responsibility (payments, disputes, policy adjudication) that its lightweight classifieds model avoids by design.",
      "behavioral_framework_case": "Play Bigger Ch 1's flywheel argument is direct: leaders compound data and widen advantage. An active-stay layer generates the unique behavioral and reliability data that powers compounding matching quality, trust, and retention in this category.",
      "user_evidence": "Robbie call: urgency around immediate payment confirmation signals absence of infrastructure. Dana call: 'nightmares' with tenants highlights unsupported stays. Multiple calls show immediate migration to personal texting, proving no system-level memory or management once contact starts.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "ambitious",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do not ship this as disconnected utilities; it must function as one operating layer.",
        "Do not center only host controls; shared visibility for both sides is required.",
        "Do not treat retention as email reminders; retention comes from operational memory and reduced repeat effort."
      ],
      "existing_library_overlap": {
        "related_elements": ["guest-works-001", "guest-works-002", "guest-works-003", "guest-works-004", "works-002"],
        "gap_assessment": "Strong overlap around guest workflow and cognitive load patterns, but the host-guest integrated active-stay operating model remains only partially defined. High leverage for unifying existing pieces into a flywheel-capable layer."
      }
    }
  ],
  "opportunity_ranking": [
    {
      "id": "opp-001",
      "rank": 1,
      "reason": "It defines the category boundary. Without owning the commute problem frame, all downstream work reads as incremental classifieds improvement instead of new-category leadership."
    },
    {
      "id": "opp-002",
      "rank": 2,
      "reason": "Trust is the dominant adoption blocker validated directly in transcripts. Solving trust structurally unlocks conversion across every subsequent phase."
    },
    {
      "id": "opp-003",
      "rank": 3,
      "reason": "It removes the highest-friction operational break ('email into void') and creates predictable conversion mechanics that competitors structurally avoid."
    },
    {
      "id": "opp-004",
      "rank": 4,
      "reason": "It is the strongest long-term moat and flywheel, but it depends on winning framing and trust first; otherwise activation and adoption stay constrained."
    }
  ],
  "strategic_narrative": "These opportunities form a deliberate category-creation sequence, not a feature backlog. First, Split Lease reframes demand around a neglected problem (recurring commute burden) so users enter with a new mental model. Second, it replaces Craigslist's trust vacuum with a compounding trust system that makes participation feel institutionally safe rather than personally risky.\n\nWith framing and trust in place, Split Lease can standardize the transaction core through structured proposals and response states, removing ambiguity and lost context from the highest-friction moment. Finally, it captures the active-stay phase where value and data actually compound, creating the flywheel Craigslist cannot access.\n\nIf executed together, Split Lease stops being 'Craigslist plus nicer UX' and becomes the category king candidate for managed recurring room-sharing: the company that defined the problem, built the missing ecosystem, and accumulated the behavioral data advantage that makes the category self-reinforcing."
}
