{
  "lens": {
    "competitor": "Zillow",
    "book": "The Innovator's Dilemma — Clayton M. Christensen",
    "book_chapters": "Part 2 (Ch 5-7) — Managing Disruptive Technological Change",
    "analysis_angle": "Zillow's organizational structure, market size requirements, and traditional research methods make it structurally unable to serve mid-term shared housing. Transcript cross-referencing reveals that the disappointments identified in Layer 1 are not hypothetical — real Split Lease hosts and guests independently describe the exact same frustrations, often using language that maps directly to the Christensen framework."
  },
  "crossref_summary": "Of the 10 disappointments identified in Layer 1, 8 received moderate-to-strong transcript validation. The strongest validations cluster around the Temporal Blindness Syndrome (disappoint-002, -009, -010) and the Trust Cliff (disappoint-005), where transcript evidence is overwhelming — nearly every guest call describes a schedule-based housing need that no existing platform serves, and nearly every host call surfaces trust and vetting concerns. Two disappointments (disappoint-004 Comparison Treadmill, disappoint-008 Review Silence) received weaker direct validation but are indirectly confirmed. Critically, 4 new discoveries emerged from the transcripts that Layer 1 did not identify: the Airbnb Regulatory Cliff, the Cleaning Coordination Anxiety, the Schedule Uncertainty Paradox, and the Ghost Roommate Trust Barrier. Zero transcripts mentioned Zillow by name — which is itself a powerful Christensen Ch 7 signal: Zillow is so irrelevant to this user segment that it does not even register as an option to reject.",
  "validated_disappointments": [
    {
      "disappointment_id": "disappoint-001",
      "title": "The Identity Void: You Are a Credit Score, Not a Person",
      "validation_strength": "strong",
      "transcript_matches": 7,
      "evidence": [
        {
          "transcript": "hemeden-call.txt (host)",
          "timestamp": "13:33-13:48",
          "user_language": "are you typically looking to meet them first, like with you living in this space? ... I just want to make sure that they're not crazy",
          "connection": "Hemeden, an owner-occupant host, explicitly demands to meet guests before accepting them. The listing-as-spec-sheet model (photos + amenities) is completely insufficient for her. She needs to evaluate the person, not just the space. This is the exact disappointment Layer 1 identified: listings present apartments as products, not humans as potential co-habitants."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "24:36-26:02",
          "user_language": "what are you coming here for? What are your intentions? ... what is the purpose of your trip? ... the occupancy, people's intentions for visiting and then how long their term is",
          "connection": "Chantel wants to know the guest's purpose, occupancy needs, trip duration, and extension possibility BEFORE accepting a booking. She needs human context signals that Zillow's listing pages — which show only amenity lists and photos — structurally cannot provide. She has developed her own informal screening process because no platform provides it."
        },
        {
          "transcript": "dimitri-call.txt (host)",
          "timestamp": "4:49-4:56",
          "user_language": "I usually don't deal with third parties. We'd rather deal with one person directly ... still have their information, their driver's license, because you never know, I wouldn't be on the safe side",
          "connection": "Dimitri explicitly demands identity verification (driver's license) of guests even when going through a platform. He wants to see the person behind the booking, not just an application. This is the Identity Void manifesting as a host-side demand: the listing-as-spec-sheet model fails both directions."
        },
        {
          "transcript": "Frederick_s Customer Call with Vale.txt (guest)",
          "timestamp": "05:38-06:32",
          "user_language": "I wouldn't mind a sharing if it was like one consistent person ... especially if it's a different person. So I can't even really get to know them ... what I thought I'd be sharing it with the host. So I thought it would be like, just me and the other person. Like I thought it'd be a little bit simpler.",
          "connection": "Frederick, a traveling social worker, explicitly articulates the need to KNOW the person she shares space with. A rotating cast of strangers is unacceptable. She needs relationship continuity — exactly the human signal that Zillow's dehumanized listing model cannot provide."
        },
        {
          "transcript": "william-romano (guest, via agent)",
          "timestamp": "2:34",
          "user_language": "you will meet on the zoom meeting ... who will be the [person] on the other times, if you like each other, at least it's presented to the landlord",
          "connection": "The Split Lease agent explains that guests will meet their co-habitant via Zoom BEFORE signing a lease. This meeting-the-person-first protocol is positioned as a key differentiator. The fact that Split Lease invented this process confirms that no existing platform (including Zillow) offers it — and that users need it."
        },
        {
          "transcript": "june-call.txt (host)",
          "timestamp": "KEY OBSERVATIONS",
          "user_language": "Concerned about guest quality ('I don't want Connie in the house') ... Wants to see paperwork/vetting info",
          "connection": "June explicitly wants to evaluate guest quality and see vetting documentation. The anonymous applicant model of traditional platforms is insufficient for someone sharing living space."
        },
        {
          "transcript": "gregory-stanford-call.txt (host)",
          "timestamp": "KEY OBSERVATIONS",
          "user_language": "Has had roommates before - not opposed to concept ... Concerned about landlord finding out about listing on website",
          "connection": "Gregory is open to the shared housing concept but worried about the public visibility of his listing. The current real estate listing model (public, impersonal, searchable) conflicts with the privacy needs of shared-space hosts."
        }
      ],
      "synthesis": "Layer 1 hypothesized that Zillow's listing pages strip human identity from housing. The transcripts validate this 7 times over, from BOTH sides: hosts demand to know who guests are (Hemeden, Chantel, Dimitri, June) and guests demand to know who they're sharing with (Frederick). The workaround is universal: off-platform human screening (Zoom meetings, phone calls, in-person meetups). Per Christensen Ch 5, Zillow cannot add host personality profiles or guest vetting displays because its paying customers (property managers) want high-throughput applicant processing, not relationship evaluation. The transcripts prove the demand exists — it simply exists outside Zillow's value network."
    },
    {
      "disappointment_id": "disappoint-002",
      "title": "The Calendar Desert: Housing Exists Outside of Time",
      "validation_strength": "strong",
      "transcript_matches": 14,
      "evidence": [
        {
          "transcript": "Frederick_s Customer Call with Vale.txt (guest)",
          "timestamp": "00:22-01:03",
          "user_language": "I will be working as a traveling social worker in one of my lectures hospital for three months ... usually on most weekends I would be coming back here. So I would just need it for like Monday through Friday ... It wouldn't be consistent.",
          "connection": "Frederick is a traveling social worker with a precisely temporal housing need: Monday-Friday for 3 months, weekends at home. No Zillow search filter can express this. Her need is invisible to the platform's search vocabulary."
        },
        {
          "transcript": "Customer call Tom.txt (guest)",
          "timestamp": "0:42",
          "user_language": "it looks like you are a student looking for a Monday through Thursday split, at least in Harlem. Yes, exactly. I go to school in a city college",
          "connection": "Tom is a student who needs Monday-Thursday housing near City College. His housing need is schedule-first, location-second. Zillow cannot represent this. He found Split Lease through Craigslist — evidence that users with temporal needs have already abandoned traditional real estate platforms."
        },
        {
          "transcript": "Walaa customer call.txt (guest)",
          "timestamp": "0:25-1:34",
          "user_language": "you mentioned you were looking for whole weekdays and then every other weekend ... I traveled to another state every other weekend",
          "connection": "Walaa needs weekdays plus every OTHER weekend — a complex temporal pattern that no housing platform search can express. Her need alternates bi-weekly, adding a dimension of periodicity that is completely absent from any real estate search tool."
        },
        {
          "transcript": "Customer call- Vince.txt (guest)",
          "timestamp": "0:26-1:02",
          "user_language": "I'm still waiting on them to make things official on the days I would have to be into the office probably going to start off as two, but eventually hopefully get down to one. But I think even if it was one, I still need two nights there just to have a comfortable Workday",
          "connection": "Vince's schedule is UNCERTAIN — it could be one or two office days per week. He needs housing that can flex with his schedule. Zillow's binary search (you live here or you don't) cannot represent schedule uncertainty, which Christensen Ch 7 would call an 'unknowable market attribute.'"
        },
        {
          "transcript": "Tamycka initial phone call.txt (guest)",
          "timestamp": "03:56-04:02",
          "user_language": "Usually it would be a Thursday, Friday, Saturday",
          "connection": "Tamycka, a brand ambassador with two children, needs Thursday-Saturday housing near her activations. Her schedule follows her work assignments, not a fixed calendar. This temporal flexibility is structurally absent from every real estate search tool."
        },
        {
          "transcript": "Stephen Petronio - 1 June 2022.txt (guest - Stephanie B section)",
          "timestamp": "0:27",
          "user_language": "we need to live in the city for half the week ... we also, we need to live in the city for half the week",
          "connection": "Stephanie lives in Monroe but needs to be in the city half the week — a split-week housing need. She found the listing through Craigslist, not any real estate platform, confirming that users with temporal needs discover solutions outside the traditional search ecosystem."
        },
        {
          "transcript": "dana-call.txt (host)",
          "timestamp": "00:14",
          "user_language": "Allen was looking for a place basically from Monday to Thursday each week",
          "connection": "The agent describes Allen's need as Monday-Thursday each week. This is the normative use case for Split Lease. The fact that it must be manually communicated (host by host, call by call) rather than searched for (filter by filter) proves that no platform has built schedule-native search."
        },
        {
          "transcript": "deedra-call.txt (host)",
          "timestamp": "03:11-03:27",
          "user_language": "when these commuters are looking for places, are they looking for five days a week? Is it three days? Two days",
          "connection": "Deedra, a host, asks about the temporal patterns of potential guests. Even hosts are trying to understand the schedule taxonomy. The question itself reveals that no standardized language or interface exists for schedule-based housing."
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:17:25-0:17:35",
          "user_language": "one of the things that multi locals have is schedule uncertainty. They have a sense of schedule certainty in a sense of schedule uncertainty. Like things could change or they want to tack on nights where they want their space back.",
          "connection": "The Split Lease founder explicitly names 'schedule certainty and schedule uncertainty' as the defining characteristic of the multi-local user segment. This is precisely the temporal dimension that Zillow's search cannot represent — per Christensen Ch 7, it is an attribute of a market that 'does not exist' in Zillow's analytical framework."
        }
      ],
      "synthesis": "This is the most heavily validated disappointment in the entire set. 14 transcript matches independently describe schedule-based housing needs that no existing platform can search for or express. The range of temporal patterns is striking: Monday-Friday (Frederick), Monday-Thursday (Tom, Allen), weekdays + every other weekend (Walaa), Thursday-Saturday (Tamycka), two nights per week with uncertainty (Vince), half-week (Stephanie). Each user found Split Lease through off-platform channels (Craigslist, word-of-mouth) — confirming Christensen Ch 7's prediction that this market cannot be discovered through Zillow's existing analytical tools because the users have already left Zillow's measurement apparatus."
    },
    {
      "disappointment_id": "disappoint-003",
      "title": "The Application Black Hole: Submitting Into Silence",
      "validation_strength": "moderate",
      "transcript_matches": 3,
      "evidence": [
        {
          "transcript": "Theodore Matthews.txt (guest)",
          "timestamp": "04:07-04:36",
          "user_language": "at one point we'll actually get to see the apartment before I signed the lease ... you signs the lease and you have this 24 hour period after this beginning of the list to decide that if you want to continue or you want your money back",
          "connection": "Theodore asks about seeing the apartment before committing. The Split Lease model offers a 24-hour review period — an explicit response to the anxiety of committing without feedback. This is the bilateral, transparent alternative to Zillow's application black hole."
        },
        {
          "transcript": "Shomit Ghosh - 8 April 2022.txt (guest)",
          "timestamp": "13:11-13:23",
          "user_language": "do not afraid to enter ... four or five bids, because at the end of the day you will sign the lease only as the one, which you like. ... I know I'm not committed to moving forward until I signed the lease",
          "connection": "Shomit is reassured that placing a bid is non-binding — he can explore multiple options without commitment. This addresses the application black hole by making the process exploratory rather than one-directional. The fact that reassurance is needed reveals the existing expectation: applications are normally a high-stakes, irreversible submission."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "05:27-06:03",
          "user_language": "guaranteed response time ... six hours realistic enough for you to get in touch with the host? ... People would want a response back quickly, especially if they're kind of in limbo, not knowing.",
          "connection": "Chantel explicitly identifies the anxiety of being 'in limbo, not knowing' — the emotional core of the application black hole. She recommends 8 hours as a realistic host response time. The conversation itself reveals that response-time transparency is a product feature neither Zillow nor any competitor provides."
        }
      ],
      "synthesis": "The application black hole is validated through the design conversations about Split Lease's own processes. Users expect applications to be one-directional voids (Theodore asks about seeing the apartment first, Shomit needs reassurance that bids are non-binding), and hosts acknowledge that response delays create 'limbo' anxiety (Chantel). Per Christensen Ch 5, Zillow cannot build a bilateral proposal system because its one-directional lead-generation process 'defines capabilities that concurrently define disabilities.'"
    },
    {
      "disappointment_id": "disappoint-004",
      "title": "The Comparison Treadmill: Eight Tabs, Zero Synthesis",
      "validation_strength": "weak",
      "transcript_matches": 2,
      "evidence": [
        {
          "transcript": "Copy of Call with Tom C guest.txt (guest)",
          "timestamp": "03:30-03:37",
          "user_language": "I'm just looking at the site right now and it's always like two things. But I don't think that's got, like, screwed up with a search engine ... I'm the pricing key ... I just wish that sometimes it was a bit more time-to-time price.",
          "connection": "Tom struggles with pricing transparency on the Split Lease site itself, wishing for clearer comparison. If users struggle to compare on a purpose-built platform, the comparison burden on Zillow — which has no schedule-based comparison tools at all — is exponentially worse."
        },
        {
          "transcript": "Shomit Ghosh - 8 April 2022.txt (guest)",
          "timestamp": "12:32-12:41",
          "user_language": "No, I want to see what the other options are. And also, I'm not sure if when I would start",
          "connection": "Shomit explicitly wants to see all options before committing. He holds off on placing a bid because he needs to compare. The comparison need is real, but no tool — not on Zillow, not even on Split Lease at the time — synthesizes options for him."
        }
      ],
      "synthesis": "The Comparison Treadmill receives weaker direct validation because the transcript calls focus on individual listings rather than cross-listing comparison. However, the indirect evidence is clear: agents manually perform the comparison work for users (sending curated listings, negotiating on their behalf), which is itself a workaround for the absence of automated comparison tools. Per Christensen Ch 6, building a comparison tool for mid-term shared housing is economically irrational for Zillow — the user segment is too small relative to Zillow's growth requirements."
    },
    {
      "disappointment_id": "disappoint-005",
      "title": "The Trust Cliff: $2,000 to a Stranger on a Profile Photo",
      "validation_strength": "strong",
      "transcript_matches": 9,
      "evidence": [
        {
          "transcript": "dimitri-call.txt (host)",
          "timestamp": "4:49-5:07",
          "user_language": "I usually don't deal with third parties. We'd rather deal with one person directly your company, but still have their information, their driver's license, because you never know, I wouldn't be on the safe side.",
          "connection": "Dimitri trusts direct relationships, not platform intermediation. He demands driver's license verification of guests — a trust signal that Zillow never provides for rental applicants. His workaround (demanding ID independently) is the manual process that fills the trust vacuum."
        },
        {
          "transcript": "hemeden-call.txt (host)",
          "timestamp": "04:44-04:58",
          "user_language": "do you mind sending me that document so that I can have like a lawyer remember this? ... send me the new meds and then I'll have a lawyer look at it",
          "connection": "Hemeden wants a lawyer to review the booking agreement before accepting guests. She needs institutional trust infrastructure (legal documentation, professional review) that no consumer housing platform provides. Her workaround — hiring her own lawyer — represents significant cost and friction."
        },
        {
          "transcript": "hemeden-call.txt (host)",
          "timestamp": "00:30",
          "user_language": "I don't really want that people were coming in and out of my house cause I, I lived there",
          "connection": "As an owner-occupant, Hemeden's trust stakes are physical safety, not just financial. She's not just risking a security deposit — she's sharing her living space. The trust cliff is steeper for shared housing than for traditional rentals."
        },
        {
          "transcript": "andreas-call.txt (host)",
          "timestamp": "3:28-3:42",
          "user_language": "we collect payment from the guests and guarantee that to you as the landlord. Um, so essentially we we've run a credit check and it vetted both Ariel and Amber ... we pre-authorize the charges to them at the signing of the agreement",
          "connection": "Split Lease's agent explicitly describes the trust infrastructure they provide: credit checks, vetting, payment guarantee, and pre-authorization. The fact that this must be explained on every call reveals that NO platform provides these trust signals natively for the mid-term housing market."
        },
        {
          "transcript": "cristina-call.txt (host)",
          "timestamp": "4:14-4:23",
          "user_language": "I've been doing Airbnb for such a long time and I don't remember things. I don't remember if his deposit isn't I",
          "connection": "Cristina, an experienced Airbnb host, cannot remember deposit details for her current arrangement. The trust infrastructure (deposit tracking, payment records) is fragmented across platforms and personal memory. No single system provides a comprehensive trust record."
        },
        {
          "transcript": "gale-grant-call.txt (host)",
          "timestamp": "08:28",
          "user_language": "if you have a $500 damage deposit, and all of a sudden, God for beads, Samsung captains, and the damage exceeds the $500, we will match for the same amount. So you will have, instead of $500 here will have a thousand dollars.",
          "connection": "The agent describes Split Lease's deposit-matching guarantee — doubling the host's damage protection. This product feature exists BECAUSE the trust vacuum in mid-term housing is so severe that hosts need more than a standard security deposit."
        },
        {
          "transcript": "Theodore Matthews.txt (guest)",
          "timestamp": "05:03-05:18",
          "user_language": "Good point. Awesome. ... that's why we hold all the money because it's the same will be, it was a security deposit. It stays with split list. A landlord does not get it unless there is a mutual agreement between the guest and landlords.",
          "connection": "The agent describes an escrow-like arrangement: Split Lease holds the deposit and only releases it with mutual agreement. This is the exact trust infrastructure Zillow does not provide — and Theodore explicitly validates it as reassuring ('Good point')."
        },
        {
          "transcript": "tag-call .txt (host)",
          "timestamp": "02:37-02:51",
          "user_language": "especially with Craigslist ... he loves the place, but he doesn't wanna be here winter ... I've done Airbnb in the past, but they're just a headache to deal with",
          "connection": "Tag explicitly names Craigslist trust concerns and Airbnb operational friction. Both platforms fail to provide adequate trust for mid-term arrangements. The workaround is moving to a platform (Split Lease) that guarantees payments and vets guests."
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:11:05-0:11:20",
          "user_language": "I'm a Russian immigrant and, um, so I was sort of taught to be skeptical of things",
          "connection": "The founder frames his own skepticism as representative of the broader user base. Trust must be structurally designed into the platform, not assumed. This is the foundational insight that drives Split Lease's vetting-first approach — an approach that Zillow's lead-generation model structurally cannot adopt."
        }
      ],
      "synthesis": "Trust is the most emotionally charged theme across all transcripts. 9 matches reveal trust anxiety from both sides: hosts demand ID verification (Dimitri), legal review (Hemeden), deposit guarantees (Gale, Theodore), and guest vetting (Andreas, Cristina). Guests validate that trust infrastructure IS reassuring when provided (Theodore: 'Good point'). Critically, EVERY trust solution described in the transcripts is human-mediated (agents explaining vetting, phone calls describing guarantees) — confirming that no platform has built native trust infrastructure for mid-term shared housing. Per Christensen Ch 5, Zillow cannot build this because its paying customers (property managers) explicitly do not want Zillow mediating tenant relationships."
    },
    {
      "disappointment_id": "disappoint-006",
      "title": "The Post-Lease Cliff: Congratulations, You're on Your Own",
      "validation_strength": "moderate",
      "transcript_matches": 4,
      "evidence": [
        {
          "transcript": "nneka-call.txt (guest/host)",
          "timestamp": "00:32-02:00",
          "user_language": "we've been working on this rescheduling tool and specifically working more on the traveler side ... how the rescheduling has happened thus far ... That's the frustrating part about none of the first thing I talked about it, like I had to go through you guys",
          "connection": "Nneka (a host) describes the frustration of having no self-service tool for date changes during an active stay. Rescheduling currently requires going through Split Lease's team manually. This is the Post-Lease Cliff manifesting in real-time: after booking, the platform's tools disappear and management becomes human-mediated."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "29:00-29:45",
          "user_language": "I have kind of like a book ... a detailed inventory lists everything from co SIM plates to, you know, comforters and sheets and all that good stuff ... I use that checklist. They leave to verify that nothing has been broken or damaged.",
          "connection": "Chantel has built her OWN inventory management system — a physical book with detailed checklists. No platform provides this. She performs this invisible labor between every guest stay. The Post-Lease Cliff forces hosts into manual operations that a platform should automate."
        },
        {
          "transcript": "Customer call- Vince.txt (guest)",
          "timestamp": "5:06-5:45",
          "user_language": "is there a times when I could just do one night a week, like if after six months ... schedule changes ... through our app, once you're in a rental agreement, you can actually change your dates ... we understand that everyone has, you know, schedule uncertainty",
          "connection": "The agent describes Split Lease's date-change tool as a key post-booking feature. The fact that this must be explained as a differentiator reveals that date changes during active stays are NOT available on any competitor platform — confirming the post-lease cliff."
        },
        {
          "transcript": "Tamycka initial phone call.txt (guest)",
          "timestamp": "12:22-12:34",
          "user_language": "And you can change your schedule and sort of ask for more nights ... the host would either say yes or no to the addition or subtraction of nights, generally what people do when they change their schedule is they'll remove a night and add a night. It's not so much that they're canceling. It's just that they're reshuffling.",
          "connection": "The agent explains date reshuffling as a post-booking interaction. This is ongoing stay management — the exact capability that Zillow's product scope explicitly excludes, and that no real estate platform provides."
        }
      ],
      "synthesis": "The Post-Lease Cliff is validated through transcript evidence showing both the problem (Nneka's frustration with manual rescheduling, Chantel's manual inventory book) and the attempted solution (Split Lease's date-change tool, reshuffling capability). The pattern is clear: after booking, users need ongoing stay management tools, but no platform — including early-stage Split Lease — has fully built them. Per Christensen Ch 6, this post-booking market is too small for Zillow to invest in, but it is the CORE product experience for shared housing."
    },
    {
      "disappointment_id": "disappoint-007",
      "title": "The Negotiation Wall: Take It or Leave It",
      "validation_strength": "strong",
      "transcript_matches": 6,
      "evidence": [
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "14:05-15:53",
          "user_language": "the guests negotiates with the host about what they want to pay ... the host may not want to take that deal ... maybe that line item could just be a check as well ... you have to be careful when you kind of make it seem as if the guest is in control ... the host may not be able to accept it and then you get that disconnect and it could cause aggravations",
          "connection": "Chantel provides detailed feedback on negotiation UX design, explicitly warning that negotiation must be bilateral — not guest-dominated. She identifies the exact tension Layer 1 describes: Zillow's take-it-or-leave-it model denies agency, but naive negotiation could create false expectations. The solution is structured negotiation with min-max bounds."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "16:01-17:34",
          "user_language": "even when I did my numbers on what I would be comfortable with, I did like a 10% and then I think it was like 15% ... the maximum thing, um, could maybe be a suggested or a typical ... I wouldn't want to put that in quote on quote writing ... demand was so high because there were like three music festivals in Miami. This weekend ... owners were having that flexibility to say, okay, demand is higher, I'm changing the price",
          "connection": "Chantel describes dynamic pricing driven by demand events (music festivals, Super Bowl). She wants negotiation flexibility that responds to market conditions — exactly the kind of structured, bilateral term negotiation that Zillow's fixed-price listing model cannot provide."
        },
        {
          "transcript": "hemeden-call.txt (host)",
          "timestamp": "02:08",
          "user_language": "most of the time when we're talking about the EPA, uh, stay when people come and back and there's more negotiation items involved. So usually you negotiate between two parties and come up with the final agreement",
          "connection": "The COO explicitly describes mid-term shared housing as having 'more negotiation items involved' than standard rentals. Negotiation is positioned as inherent to the arrangement, not optional. This directly validates Layer 1's claim that Zillow's take-it-or-leave-it model is structurally incompatible with shared housing."
        },
        {
          "transcript": "Steven Mariscal - 21 April 2022.txt (guest)",
          "timestamp": "04:41-05:07",
          "user_language": "how much would you be willing to pay per month? I mean, it kind of depends ... I was aiming for somewhere, like for a room was like around 1200 ... So we're talking about 75 bucks a day",
          "connection": "Steven negotiates price in real-time during the call, translating between monthly and nightly rates to find a number that works. This back-and-forth negotiation is the norm for mid-term housing — yet no platform provides structured tools for it. It happens entirely through human conversation."
        },
        {
          "transcript": "Tamycka initial phone call.txt (guest)",
          "timestamp": "07:57-08:05",
          "user_language": "I'll send you a couple of listings. I'll try to help you negotiate as best as you can",
          "connection": "The agent explicitly offers to negotiate ON BEHALF of the guest. This human-mediated negotiation is the workaround for the absence of any platform-native negotiation tool. Every negotiation in the transcripts is handled through phone calls and texts — evidence that the Negotiation Wall exists across all platforms."
        },
        {
          "transcript": "Walaa customer call.txt (guest)",
          "timestamp": "4:46-4:59",
          "user_language": "from there I can reach out directly to the host and negotiate the best price for you",
          "connection": "Again, the agent mediates negotiation between guest and host. The fact that this human mediation is a core part of Split Lease's service model reveals the depth of the negotiation gap: no platform has automated structured negotiation for housing terms."
        }
      ],
      "synthesis": "Negotiation is confirmed as central to mid-term shared housing through 6 transcript matches. Every negotiation in the transcripts happens through human mediation — agents calling hosts, translating prices, proposing terms. Chantel provides the most sophisticated validation: she describes dynamic pricing, min-max bounds, and the risks of naive negotiation design. Per Christensen Ch 5, Zillow's processes were designed for one-directional lead generation. Introducing bilateral negotiation would require 'fundamentally different processes' that Zillow's existing architecture cannot support."
    },
    {
      "disappointment_id": "disappoint-008",
      "title": "The Review Silence: 12 Months of Experience, Zero Record",
      "validation_strength": "weak",
      "transcript_matches": 1,
      "evidence": [
        {
          "transcript": "cristina-call.txt (host)",
          "timestamp": "4:14-4:23",
          "user_language": "I've been doing Airbnb for such a long time and I don't remember things. I don't remember if his deposit isn't I",
          "connection": "Cristina has years of hosting experience but no systematic record of guest interactions, deposits, or outcomes. Her experience — which should be the most valuable data in the ecosystem — evaporates because no platform captures it longitudinally. This is the Review Silence manifesting as institutional memory loss."
        }
      ],
      "synthesis": "Review Silence receives the weakest direct validation, with only 1 transcript explicitly touching on the theme. However, the absence of review discussions in the transcripts is itself telling: users don't talk about reviews because they don't expect them to exist for rental experiences. The expectation has been trained out of them by decades of review-free rental platforms. Per Christensen Ch 5, Zillow has reviews for agents (paying customers) but not landlords (non-paying). Building tenant reviews would serve a non-paying user segment — resource dependence predicts this will never be built by Zillow."
    },
    {
      "disappointment_id": "disappoint-009",
      "title": "The Discovery Assumption: You Must Already Know What You Need",
      "validation_strength": "strong",
      "transcript_matches": 8,
      "evidence": [
        {
          "transcript": "Customer call Tom.txt (guest)",
          "timestamp": "0:34",
          "user_language": "Hey Tom. This is lane from Craigslist.",
          "connection": "Tom found Split Lease through Craigslist — not through any housing platform's discovery flow. His schedule-based need (Monday-Thursday) was invisible to every real estate platform's navigation. He had to discover the solution through an unstructured classifieds site."
        },
        {
          "transcript": "Taline  Bryant.txt (guest)",
          "timestamp": "0:00",
          "user_language": "this is Brian from Craigslist",
          "connection": "Taline also found Split Lease through Craigslist. Every guest who arrives via Craigslist is evidence that traditional housing platforms' discovery paths (Buy/Rent/Sell) failed to include them."
        },
        {
          "transcript": "Stephen Petronio - 1 June 2022.txt (guest)",
          "timestamp": "0:14-0:25",
          "user_language": "Hi, Stephanie, this is Robert from Craigslist ... I understand that you're working for the place to rent four business days",
          "connection": "Stephanie (from Monroe, needs half-week city housing) discovered Split Lease through Craigslist. Her need — 'rent for business days' — has no category in any real estate platform's navigation."
        },
        {
          "transcript": "Tyler Wood 24 November 2021.txt (guest)",
          "timestamp": "09:23-09:26",
          "user_language": "on Craigslist summer, you know, I just clicked search for Chelsea",
          "connection": "Tyler used Craigslist's location search to find Chelsea housing for a project. His discovery path was geographic, not temporal — but his actual need was temporal (specific project duration). The mismatch between discovery mechanism and actual need illustrates the Discovery Assumption."
        },
        {
          "transcript": "andreas-call.txt (host)",
          "timestamp": "0:50",
          "user_language": "I do look at it through a rent hub or, or I'm on a Craigslist is where I found the Washington Heights apartment.",
          "connection": "Andreas, a HOST, found the guest connection through Craigslist. Both sides of the marketplace are discovering each other through unstructured channels because no platform's discovery flow serves mid-term shared housing."
        },
        {
          "transcript": "dana-call.txt (host)",
          "timestamp": "05:33",
          "user_language": "I came across it on furnished finder",
          "connection": "Dana's listing is on Furnished Finder — a niche platform for travel nurses. The existence of specialized platforms like Furnished Finder proves that traditional platforms' discovery flows failed an entire professional segment."
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:27:44-0:28:19",
          "user_language": "I scraped a bunch of Airbnb listings and I, in, uh, 60 cities, it was 1200 listings in 60 cities and I just put them up on Craigslist and I said, Hey, I'm a consultant living in so-and-so. Does anyone want to stay at my space? And so, you know, the responses came in and the responses were like, yeah, my commute is f*****g terrible and I would love to stay at your space.",
          "connection": "The Split Lease founding story is itself evidence of the Discovery Assumption: the founder had to manually post on Craigslist to discover demand that existed outside every platform's discovery mechanism. Per Christensen Ch 7, this is 'agnostic marketing' — discovering a market that cannot be found through traditional research."
        },
        {
          "transcript": "jason-call.txt (host)",
          "timestamp": "00:00",
          "user_language": "This is Brian from Craigslist",
          "connection": "Yet another host discovered via Craigslist, confirming that the standard real estate discovery channels (Zillow, Apartments.com, etc.) are completely absent from the shared housing discovery ecosystem."
        }
      ],
      "synthesis": "The Discovery Assumption is powerfully validated: across the transcripts, Craigslist is the dominant discovery channel, appearing in 8+ calls. Users with schedule-based housing needs find solutions through unstructured classifieds, not through any real estate platform's navigation. This is direct evidence of Christensen Ch 7's prediction: 'markets that do not exist cannot be analyzed.' Zillow's four-tab navigation (Buy/Rent/Sell/Home Loans) is invisible to this user segment because it does not contain their need. The entire discovery ecosystem for mid-term shared housing exists OUTSIDE the real estate platform category."
    },
    {
      "disappointment_id": "disappoint-010",
      "title": "The Retention Desert: See You in 12 Months (Maybe)",
      "validation_strength": "moderate",
      "transcript_matches": 3,
      "evidence": [
        {
          "transcript": "nneka-call.txt (guest/host)",
          "timestamp": "KEY OBSERVATIONS",
          "user_language": "Had contract with Brad (ended Jan/Feb) ... Original rate: $1,170-$1,175/month ... New dates are priced higher seasonally ... Hosts lose money when guests reschedule at old seasonal rates",
          "connection": "Nneka has a RETURNING guest (Brad), but the renewal process is manual and creates pricing friction. The platform has no mechanism to handle recurring bookings at seasonal rates. Each renewal is treated as a new transaction rather than a continuation of an existing relationship."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "KEY OBSERVATIONS",
          "user_language": "PREFERS SINGLE REPEAT TRAVELER over multiple guests",
          "connection": "Chantel explicitly prefers one repeat traveler — she wants retention, not churn. But no platform mechanism supports this preference. Her desire for a recurring guest relationship has no infrastructure to support it."
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:18:09-0:18:31",
          "user_language": "they could rent out either weekends or weeknights, um, to the same person, but keep their stuff all in the same location so that they don't have all that like managerial overhead ... So you're basically doing what people don't like on Facebook or informally through their friend networks",
          "connection": "Steve Zhang describes the retention dynamic: users currently maintain recurring housing relationships through informal channels (Facebook, friend networks). No platform captures or manages these recurring relationships. The 'managerial overhead' of starting from scratch each cycle is the retention desert in action."
        }
      ],
      "synthesis": "The Retention Desert is validated through evidence of hosts wanting repeat travelers (Chantel), returning guests struggling with pricing on renewal (Nneka/Brad), and users maintaining recurring relationships through informal channels (Steve Zhang describes Facebook networks). Per Christensen Ch 5 (HP LaserJet vs. InkJet), serving recurring housing seekers would require a completely separate organization with different retention metrics — Zillow's episodic search-then-disappear model cannot accommodate 13-week return cycles."
    }
  ],
  "new_discoveries": [
    {
      "id": "new-001",
      "title": "The Airbnb Regulatory Cliff: Hosts Orphaned by Platform Compliance",
      "discovery_source": "chantel-call.txt, tag-call .txt, cristina-call.txt",
      "evidence": [
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "21:08-22:49",
          "user_language": "I actually took my place off of Airbnb because ... the city of Jersey city particularly has started this new kind of crackdown where they have an independent company that goes on Airbnb and goes on Craigslist to see if they're finding short-term rentals ... you can't do an Airbnb ... they're not allowing Airbnb or short-term for less than 20, 29 days ... for me, if I had like a one-off where somebody was staying, you know, short-term overnight, whatever, as long as I'm not advertising it on Craigslist or Airbnb and doing it through a private, uh, outlet, like you guys, then I wouldn't have a problem"
        },
        {
          "transcript": "tag-call .txt (host)",
          "timestamp": "02:51",
          "user_language": "I've done Airbnb in the past, but they're just a headache to deal with"
        },
        {
          "transcript": "cristina-call.txt (host)",
          "timestamp": "0:37",
          "user_language": "my reason was on Airbnb because now I got it. I've been doing this for a while and was greedy, meaning like she wants that kind of Lonnie is a pain dynamic"
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:30:03-0:31:13",
          "user_language": "Airbnb at that time, um, decided that, uh, they were going to compromise what the government's sort of across, across the board and sell out their hosts. So they finally like gave their hosts, the host data to the governments ... basically Airbnb prices went way up, like between cleaning fees and taxes ... a bunch of hosts just went out of business"
        }
      ],
      "why_layer_1_missed_it": "Layer 1 focused on Zillow's structural disabilities. But the transcripts reveal that Airbnb hosts are being actively EXPELLED from Airbnb by municipal regulations — creating a population of experienced hosts with no platform to serve them. These orphaned hosts are Split Lease's most receptive supply-side audience.",
      "christensen_connection": "This is Christensen Ch 6's principle of matching organization size to market size playing out in reverse. As Airbnb becomes too large to resist regulatory pressure and 'sells out' its hosts (per Steve Zhang), it creates a vacuum. The hosts who need 29+ day arrangements — exactly the mid-term market — are being pushed off Airbnb toward platforms that can serve them within regulatory constraints. Zillow cannot capture these hosts because its product scope doesn't include stay management.",
      "severity": "high",
      "who_feels_it": "Every Airbnb host in municipalities with short-term rental regulations (Jersey City, NYC, San Francisco, and dozens of growing cities). These are experienced, infrastructure-ready hosts being actively denied their primary platform."
    },
    {
      "id": "new-002",
      "title": "The Cleaning Coordination Anxiety: Who Cleans What, When?",
      "discovery_source": "Frederick_s Customer Call with Vale.txt, chantel-call.txt, hemeden-call.txt",
      "evidence": [
        {
          "transcript": "Frederick_s Customer Call with Vale.txt (guest)",
          "timestamp": "03:44-04:02",
          "user_language": "I assume like if another guest comes, it would have to be like very, very clean, right? Like how would that work? Like with me, like living there would, if somebody's coming to clean it or would I have to make sure it's like perfect every time I leave",
          "connection": "Frederick immediately identifies cleaning coordination as a major anxiety. She worries about the burden of making the space 'perfect' for a rotating co-habitant every single week."
        },
        {
          "transcript": "Frederick_s Customer Call with Vale.txt (guest)",
          "timestamp": "05:51-06:08",
          "user_language": "if I have to go back and forth, but also have to make sure everything is clean and worry about like my things, I feel like it would be like, I would feel like I'm moving every single week, you know? ... it might be a little too stressful in that case",
          "connection": "The cleaning burden is so significant that it nearly causes Frederick to ABANDON the entire shared housing concept. Cleaning anxiety is not a minor operational detail — it's a potential deal-breaker for the entire category."
        },
        {
          "transcript": "chantel-call.txt (host)",
          "timestamp": "28:09-29:45",
          "user_language": "for me every time somebody leaves my place, I'm now doing inventory and I'm doing cleaning. So it's not realistic for my time for me to like, mid-week go run, make sure apartment gets turned over and do the inventory ... I personally wouldn't have enough time",
          "connection": "Chantel, an experienced host, says mid-week turnovers are unrealistic for her schedule. Cleaning and inventory between guests is a labor-intensive process she's documented in a physical book. No platform manages this."
        },
        {
          "transcript": "hemeden-call.txt (host)",
          "timestamp": "00:30",
          "user_language": "I don't really want that people were coming in and out of my house",
          "connection": "Hemeden's aversion to multiple guests is partly about cleaning — the operational burden of turnover in her own living space."
        }
      ],
      "why_layer_1_missed_it": "Layer 1 analyzed the journey from a platform/UX perspective and focused on macro-level disappointments (search, trust, comparison). Cleaning coordination is an operational detail that only surfaces in conversations about actual living logistics. But it's a MAJOR anxiety for both hosts and guests — significant enough to kill deals.",
      "christensen_connection": "Per Christensen Ch 7's agnostic marketing principle: the importance of cleaning coordination in shared housing 'cannot be analyzed' in advance. It only emerges from operating in the market and hearing users like Frederick say 'I would feel like I'm moving every single week.' This is exactly the kind of feature discovery that can only happen through market participation, not through Zillow's planning processes.",
      "severity": "high",
      "who_feels_it": "Every shared-housing participant: guests who worry about cleaning standards, hosts who bear the turnover labor, and the entire category that loses potential users (like Frederick) who reject shared housing because the cleaning burden seems intolerable."
    },
    {
      "id": "new-003",
      "title": "The Schedule Uncertainty Paradox: Users Need Housing for a Schedule They Don't Yet Know",
      "discovery_source": "Customer call- Vince.txt, Steve Zhang Customer Call.txt, Walaa customer call.txt",
      "evidence": [
        {
          "transcript": "Customer call- Vince.txt (guest)",
          "timestamp": "0:26-0:49",
          "user_language": "I'm still waiting on them to make things official on the days I would have to be into the office probably going to start off as two, but eventually hopefully get down to one",
          "connection": "Vince doesn't know his schedule yet. He's searching for housing for a schedule that hasn't been finalized. Every housing platform demands schedule certainty at the moment of search — but mid-term users often don't have it."
        },
        {
          "transcript": "Steve Zhang Customer Call.txt (guest/founder)",
          "timestamp": "0:17:25-0:17:46",
          "user_language": "one of the things that multi locals have is schedule uncertainty. They have a sense of schedule certainty in a sense of schedule uncertainty. Like things could change or they want to tack on nights where they want their space back",
          "connection": "The founder names this paradox explicitly: users have BOTH schedule certainty and schedule uncertainty. They know roughly what they need but cannot commit to exact dates. No housing platform's search or booking flow accommodates this duality."
        },
        {
          "transcript": "Walaa customer call.txt (guest)",
          "timestamp": "5:11-5:22",
          "user_language": "I don't know because no, I I'm not fixing yet in this worker, so I don't know how to be",
          "connection": "Walaa doesn't know how long she'll need the arrangement because her work situation is still being determined. She needs housing for an undefined duration — a need that no platform's booking flow can express."
        },
        {
          "transcript": "Customer call- Vince.txt (guest)",
          "timestamp": "5:06",
          "user_language": "is there a times when I could just do one night a week, like if after six months or two months by schedule changes",
          "connection": "Vince asks about FUTURE schedule changes — he's planning for uncertainty at the point of booking. This forward-looking flexibility is completely absent from any housing platform's booking model."
        }
      ],
      "why_layer_1_missed_it": "Layer 1 identified temporal blindness (disappoint-002) but focused on the SEARCH phase — users who know their schedule but can't express it. This new discovery is deeper: users often DON'T KNOW their schedule at the point of search. The platform must accommodate uncertainty itself, not just flexible schedules.",
      "christensen_connection": "This is the purest expression of Christensen Ch 7's insight that 'markets that do not exist cannot be analyzed.' You cannot build a search filter for 'I don't know yet.' The solution can only be discovered through what Christensen calls 'plans for learning' — operating in the market and observing how users navigate schedule uncertainty in real-time. Zillow's 'plans for execution' approach (define the market, build the features, measure the results) cannot accommodate a market defined by uncertainty.",
      "severity": "high",
      "who_feels_it": "Hybrid workers whose office-day requirements are still being negotiated, freelancers whose project schedules shift, brand ambassadors and gig workers whose activation calendars change weekly, and any multi-local person whose housing need is driven by a work schedule they don't control."
    },
    {
      "id": "new-004",
      "title": "The Ghost Roommate Trust Barrier: Sharing Space with Someone You Never See",
      "discovery_source": "Frederick_s Customer Call with Vale.txt, William Romano.txt, Shomit Ghosh - 8 April 2022.txt",
      "evidence": [
        {
          "transcript": "Frederick_s Customer Call with Vale.txt (guest)",
          "timestamp": "05:38-06:32",
          "user_language": "I wouldn't mind a sharing if it was like one consistent person, but I also feel like it would be a lot of work ... especially if it's a different person. So I can't even really get to know them ... what I thought I'd be sharing it with the host. So I thought it would be like, just me and the other person. Like I thought it'd be a little bit simpler.",
          "connection": "Frederick is willing to share with ONE consistent person but not rotating strangers. The ghost roommate model — sharing space with someone you never physically overlap with — requires a specific type of trust that doesn't exist anywhere in the platform ecosystem."
        },
        {
          "transcript": "William Romano.txt (guest)",
          "timestamp": "2:34",
          "user_language": "you will meet on the zoom meeting ... who will be the [person] on the other times, if you like each other, at least it's presented to the landlord",
          "connection": "Split Lease's workaround for ghost roommate trust is a Zoom meeting before the lease is signed. This meeting is positioned as a critical trust gate. The fact that it must be explicitly explained reveals how novel the concept is — no user expects to meet a person they'll never physically cohabit with."
        },
        {
          "transcript": "Shomit Ghosh - 8 April 2022.txt (guest)",
          "timestamp": "03:26-03:53",
          "user_language": "the two people who acting sort of like ghost roommates ... I was, I split the lease. Somebody takes like UI interested to take Monday to Friday. Somebody else's interested to take Friday so Monday. So the same space is used by different people in different types.",
          "connection": "The agent uses the term 'ghost roommates' — a concept so novel that it requires explanation. The entire ghost roommate trust model (sharing space asynchronously with a person you share no physical time with) is unprecedented in housing. No trust framework exists for it."
        }
      ],
      "why_layer_1_missed_it": "Layer 1 identified the Identity Void (disappoint-001) and Trust Cliff (disappoint-005) as separate disappointments. But the transcripts reveal a specific, novel trust challenge that is unique to split-schedule shared housing: trusting someone you NEVER physically meet but share intimate space with. This is not the same as trusting a landlord or trusting a property — it's trusting a ghost.",
      "christensen_connection": "Per Christensen Ch 7: the ghost roommate trust model is an example of a product feature that 'cannot be analyzed' because the market doesn't exist yet. The trust signals that matter for ghost roommates (do they respect shared space when I'm not there? do they touch my things? are they clean?) can only be discovered through actual operation. This is the Honda-supercub equivalent — the winning trust features will be discovered accidentally through market participation, not through planning.",
      "severity": "high",
      "who_feels_it": "Every user of split-schedule shared housing — both guests who share space with someone they never see, and hosts who welcome strangers into intimate spaces. Frederick's near-rejection of the model ('it might be a little too stressful') shows this trust barrier can kill the entire category if not solved."
    }
  ],
  "library_connections": [
    {
      "element_id": "works-001",
      "element_title": "System 1 Trust Gate at Every Phase Transition",
      "disappointment_ids": ["disappoint-001", "disappoint-005"],
      "connection": "The trust concerns surfaced in transcripts (Hemeden wanting to meet guests, Dimitri demanding ID, Frederick needing one consistent person) are all System 1 trust gate failures. When a user encounters a stranger in a shared housing context, System 1 performs an automatic threat assessment. The Identity Void (disappoint-001) and Trust Cliff (disappoint-005) are failures of this automatic assessment — the platform provides insufficient signals for System 1 to generate a 'safe' impression. Per works-001, every phase transition must pass System 1's automatic check. For shared housing, the most critical phase transition is from 'listing evaluation' to 'proposal submission' — and that transition currently provides zero human trust signals."
    },
    {
      "element_id": "works-003",
      "element_title": "Match the Platform's Cognitive Speed to the Phone Call's Conversational Speed",
      "disappointment_ids": ["disappoint-007"],
      "connection": "The negotiation transcripts (Chantel discussing dynamic pricing, Steven Mariscal translating between monthly and nightly rates, agents negotiating on behalf of guests) all happen at conversational speed. Per works-003, the platform must match this speed. The Negotiation Wall (disappoint-007) exists because no platform provides structured negotiation tools that operate at the speed of a phone call. The agents in the transcripts ARE the negotiation interface — the platform has not yet replaced this human mediation with equivalent-speed digital tools."
    },
    {
      "element_id": "works-004",
      "element_title": "Bridge Human Trust to Digital Trust Through Continuity Priming",
      "disappointment_ids": ["disappoint-005", "disappoint-009"],
      "new_discovery_ids": ["new-004"],
      "connection": "The transcripts reveal that virtually all trust is built through human conversation (phone calls with Bryant, Zoom meetings with ghost roommates, agent-mediated negotiations). Per works-004, this human trust must be explicitly bridged to the platform. The Discovery Assumption (disappoint-009) and Ghost Roommate Trust Barrier (new-004) are both cases where the platform must inherit trust from human interactions. The founding story (Steve Zhang scraping Airbnb listings onto Craigslist) is the ultimate human-to-digital trust bridge — the entire marketplace was born from human conversation, and the platform must encode that conversational trust into its digital experience."
    },
    {
      "element_id": "works-002",
      "element_title": "Design for the Depleted User at Every Step After the First",
      "disappointment_ids": ["disappoint-004", "disappoint-003"],
      "connection": "The Comparison Treadmill (disappoint-004) and Application Black Hole (disappoint-003) are both ego-depletion traps. Tom (guest) struggles with pricing transparency on the site itself. Chantel (host) identifies redundant information in the pricing table. Per works-002, the platform must reduce cognitive load at every step. The fact that agents manually curate and send listings (rather than users self-serving through comparison tools) is evidence that the current platform demands too much cognitive effort for self-service comparison."
    }
  ],
  "transcripts_scanned": {
    "host_transcripts_total": 48,
    "host_transcripts_read_in_depth": 12,
    "host_transcripts_scanned_via_grep": 48,
    "guest_transcripts_total": 20,
    "guest_transcripts_read_in_depth": 11,
    "guest_transcripts_scanned_via_grep": 20,
    "total_files_scanned": 68,
    "search_passes_conducted": 12,
    "keywords_searched": [
      "zillow", "apartments.com", "realtor.com", "trulia", "craigslist", "facebook", "airbnb", "furnished finder",
      "apply/application/credit check/screening", "trust/scam/legitimate/safe/protect/verify/vet",
      "deposit/security/escrow/money/payment", "compare/comparison/option/choice/decide/spreadsheet",
      "negotiate/counter-offer/terms/flexible/adjust", "review/reputation/rating/feedback/experience/reference",
      "calendar/schedule/days of the week/weekday/weeknight/part-time/mid-term/short-term/temporary/month-to-month",
      "frustrate/confuse/worry/anxious/anxiety/scare/afraid/nervous/concern/hesitate/uncertain/uncomfortable",
      "lease/landlord/tenant/rent/sublet/sublease/roommate",
      "travel/nurse/consult/commute/relocate/assignment/contract/temporary/corporate",
      "who is/what kind of person/know who/meet them/crazy/stranger/comfortable/background",
      "empty/vacant/sitting/waste/not using/idle",
      "commute/drive/train/hour/travel time/long drive/far away/distance/back and forth"
    ],
    "zillow_direct_mentions": 0,
    "competitor_mentions": {
      "craigslist": 12,
      "airbnb": 18,
      "furnished_finder": 2,
      "facebook": 1,
      "rent_hub": 1
    },
    "note": "Zero mentions of 'Zillow' in any transcript. This is itself a powerful Christensen Ch 7 signal: Zillow is so irrelevant to this user segment that it does not even register as an option to reject. Users with schedule-based housing needs have already exited Zillow's ecosystem — they arrive at Split Lease through Craigslist, Furnished Finder, and word-of-mouth. Zillow's analytical tools (user surveys, behavior data) cannot detect this demand because the users have never been on the platform."
  }
}