{
  "lens": {
    "host_call": "kelly-call.txt",
    "book_extract": "playbigger-category-design.txt",
    "lens_summary": "Kelly's outright rejection of the platform in favor of direct-to-individual work reveals that Split Lease has not yet defined a category in the host's mind -- she sees it as a generic middleman, not as a different solution to a different problem, and Play Bigger's category design framework explains exactly why hosts like Kelly default to the incumbent category (nursing sites, direct contact) when no new category has been anchored."
  },
  "phases": {
    "discovery": {
      "what_this_lens_reveals": "Kelly was reached by Bryant as a potential host, but the outreach failed to frame a new category of problem. She already has a mental category for what she does -- 'renting to individuals directly via nursing sites' -- and Bryant's pitch registered as a competitor within that existing category, not as a new category entirely. Play Bigger teaches that 'winning companies today market the problem, not just the solution' (Ch 2). Bryant marketed the solution (a guest named Landon who needs a room) without first marketing the problem (that direct-to-individual hosting is unreliable, unprotected, and unscalable). Without a category-defining problem statement, Kelly's System 1 filed Split Lease as 'another middleman' and immediately applied her existing preference: work directly with people.",
      "user_state": {
        "emotional_state": "Guarded but polite. She interrupts the call ('Hold on just one second') and then delivers her rejection diplomatically. She is not hostile but she is not curious either -- she has already decided before explaining why.",
        "knowledge_level": "Low about Split Lease specifically, moderate about the space generally. She uses nursing/travel nurse platforms (likely Furnished Finder) and understands the guest type (travel nurses, short-term workers). She knows enough about the existing category to have strong preferences within it.",
        "commitment_level": "Zero. She explicitly declined: 'I'd prefer to just kind of work with individuals directly.' The door is left open only for referrals from associates, not for her own participation.",
        "data_available": "Kelly has a phone number (248 area code, Michigan), is located in Troy/Metro Detroit, has at least one property (possibly more via associates), and has experience with nursing/travel nurse sites."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "No category has been established -- Kelly sees Split Lease as a generic intermediary competing within the existing 'find renters online' category",
          "Her anchor is direct-to-individual work, which she explicitly stated she prefers",
          "Play Bigger's Choice Supportive Bias: she has already committed to her current approach and will attribute positive qualities to it regardless of Split Lease's objective advantages",
          "The outreach did not define a new problem -- it offered a solution (Landon) to a problem she believes she already solves herself (finding good tenants)"
        ],
        "evidence": "kelly-call.txt, 02:09: 'I'd prefer to just kind of work with individuals directly... I wanted someone who I can get a little bit more information as far as their nursing and just being more confident in who they were.' She explicitly states her preference and her reason: trust through direct vetting. Play Bigger Ch 2: 'Once you've committed to a product or service in a new category, you're likely to give positive qualities to an option you've chosen just because you've chosen it.'"
      },
      "key_quotes": [
        {
          "source": "kelly-call.txt, 02:09",
          "quote": "I'd prefer to just kind of work with individuals directly... I wanted someone who I can get a little bit more information as far as their nursing and just being more confident in who they were.",
          "relevance": "This is the category rejection moment. Kelly is not rejecting Split Lease's product -- she is rejecting the entire category of intermediated hosting. She wants the existing category: direct host-to-guest relationships with personal vetting."
        },
        {
          "source": "playbigger-category-design.txt, Ch 1 (Category Kings Defined)",
          "quote": "The most exciting companies sell us different. They introduce the world to a new category of product or service. They replace our current point of view on the world with a new point of view.",
          "relevance": "Split Lease's outreach to Kelly did not sell 'different.' It sold 'better access to a guest' -- which is a competitive claim within Kelly's existing category, not a new category. She dismissed it because within her category, she already has her preferred method."
        },
        {
          "source": "playbigger-category-design.txt, Ch 2",
          "quote": "Winning companies today market the problem, not just the solution.",
          "relevance": "Bryant marketed the solution (Landon as a guest). He did not market the problem (that direct hosting leaves hosts unprotected, unvetted, and dependent on a single platform's listing visibility). Kelly never heard a problem she recognized as unsolved."
        }
      ]
    },
    "evaluation": {
      "what_this_lens_reveals": "Kelly never entered evaluation because no category was established in discovery. Play Bigger's category lifecycle model shows that evaluation only occurs when the potential customer recognizes a problem and begins comparing solutions. Kelly does not recognize a problem -- she believes her current approach (direct work, nursing sites) solves her needs. The call reveals that Bryant attempted to bypass category establishment entirely and jump straight to a transaction ('Landon is looking for a place, here is his info'). This is the equivalent of what Play Bigger calls selling a product into an existing category without defining a new one -- and the result is predictable: the host compares the offering against her incumbent approach and chooses the incumbent.",
      "user_state": {
        "emotional_state": "Not applicable -- Kelly did not enter this phase. Her emotional state remained in discovery-rejection mode throughout the call.",
        "knowledge_level": "She has zero knowledge of Split Lease's value proposition, guarantees, vetting process, or payment model because none were communicated before she rejected.",
        "commitment_level": "Zero. She actively declined before any evaluation could occur.",
        "data_available": "None beyond what was present at discovery. No listing data, no pricing data, no platform interaction data."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "The host never entered this phase -- dropout occurred at discovery",
          "Play Bigger's Anchoring Effect: Kelly's first impression of Split Lease was 'another middleman,' and this anchor will color all future encounters unless a category-defining intervention resets it",
          "No point of view (POV) was communicated that would give Kelly a reason to evaluate a fundamentally different approach"
        ],
        "evidence": "kelly-call.txt, 02:09-03:02: Kelly states her preference and Bryant acknowledges it ('Okay') without challenging the frame or offering a category-level argument. Play Bigger Ch 2: 'An early bit of information [has] a powerful impact on any other offer that comes after. In category dynamics, an early company that solves the problem will win a powerful place in customers' minds. It becomes an anchor.'"
      },
      "key_quotes": [
        {
          "source": "kelly-call.txt, 03:42-03:51",
          "quote": "He made it clear that he was pretty flexible in terms of like duration and start date. Ideally, he was looking for like three months starting in early February.",
          "relevance": "Bryant continues to pitch the guest's attributes (flexibility, duration, start date) after Kelly has already rejected. This is product-level selling ('here is what Landon offers') in a conversation that needed category-level framing ('here is why the way you currently find tenants leaves you exposed')."
        },
        {
          "source": "playbigger-category-design.txt, Ch 2",
          "quote": "A great team in a lousy category or a me-too position in an existing category is a losing cause. But if a middling team stumbles on a great category, the category will make heroes of the team.",
          "relevance": "Split Lease's agent (Bryant) is competent and personable -- Kelly responds warmly. But competence cannot overcome being positioned in the wrong category. If Split Lease is perceived as just another way to find tenants, no amount of agent skill will convert Kelly."
        }
      ]
    },
    "onboarding": {
      "what_this_lens_reveals": "This phase was never reached. Kelly rejected at discovery, so no onboarding interaction occurred. However, the lens reveals a structural vulnerability: even if Kelly had been receptive, there was no onboarding category moment planned. Play Bigger describes how category kings like Uber 'made all of us aware that we had a taxi problem -- and that the problem had a new solution' (Ch 1). Split Lease's onboarding would need to create this awareness moment -- the realization that direct hosting is a problem, not just a preference -- before asking Kelly to sign up, verify identity, or create a listing.",
      "user_state": {
        "emotional_state": "Not applicable -- phase not reached.",
        "knowledge_level": "Zero platform knowledge. Kelly has never seen the Split Lease interface.",
        "commitment_level": "Zero. No sign-up, no identity verification, no agent connection.",
        "data_available": "None."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Phase never reached due to discovery-stage rejection",
          "Even hypothetically, onboarding a host who has not had a category-defining moment would produce a low-commitment user who views the platform as optional overhead"
        ],
        "evidence": "kelly-call.txt full transcript: No mention of platform features, sign-up process, or next steps toward onboarding. The call ends with a vague referral promise ('if anything changes or I have an associate that has a property'), not an onboarding plan."
      },
      "key_quotes": [
        {
          "source": "kelly-call.txt, 04:12",
          "quote": "All right. So you know what, I have your number, if anything changes or I have an associate that has a property or unit that would work, I will definitely give you.",
          "relevance": "This is Kelly's exit offer. She positions herself as a potential referral source, not a potential user. The platform has been categorized as 'something other people might use' rather than 'something I need.' This is exactly the non-adoption pattern Play Bigger describes when no new category has been established."
        }
      ]
    },
    "listing_creation": {
      "what_this_lens_reveals": "This phase was never reached, but the lens reveals why Kelly would resist it even if she progressed. Kelly's core objection is about control and information: 'I wanted someone who I can get a little bit more information as far as their nursing and just being more confident in who they were.' The listing creation process, as described in the journey map, is host-centric (space details, amenities, pricing) but does not address the host's need to vet and control who sees the listing. Play Bigger's magic triangle (product design + company design + category design) suggests that the listing creation product must be designed not just as a 'post your space' tool but as a 'control who enters your space' tool -- which is the category-defining problem for hosts like Kelly.",
      "user_state": {
        "emotional_state": "Not applicable -- phase not reached.",
        "knowledge_level": "Kelly does not know the listing wizard exists.",
        "commitment_level": "Zero.",
        "data_available": "None."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Phase never reached",
          "Kelly's stated preference for direct vetting suggests she would resist a listing process that broadcasts her space to unknown guests without her pre-approval",
          "The current listing wizard (6 steps: space, features, lease style, pricing, rules, photos) does not include a 'guest vetting preferences' step that would address Kelly's core concern"
        ],
        "evidence": "kelly-call.txt, 02:09: 'I wanted someone who I can get a little bit more information as far as their nursing and just being more confident in who they were.' This is a vetting/control need, not a listing need. The listing wizard addresses the space description problem but not the tenant control problem."
      },
      "key_quotes": [
        {
          "source": "playbigger-category-design.txt, Ch 2 (Magic Triangle)",
          "quote": "Product design is the purposeful building of a product and experience that solves the problem the market needs solved. The goal is what is traditionally called a great product/market fit -- in other words, a great product/category fit.",
          "relevance": "The listing creation product is designed for hosts who have already accepted the category (platform-mediated hosting). It has no product/category fit for hosts like Kelly who are in a different category (direct-to-individual hosting). The product must be redesigned to define and serve the new category, not just serve existing converts."
        }
      ]
    },
    "pricing": {
      "what_this_lens_reveals": "This phase was never reached, but the lens reveals a missed category-defining opportunity. Kelly's call never discussed Split Lease's pricing model, payment guarantees, or fee structure. Play Bigger argues that category kings make 'the public aware that we had a problem -- and that the problem had a new solution' (Ch 1, Uber example). For hosts like Kelly who work directly with individuals, the unsolved problems include: no payment guarantee, no recourse for non-payment, no automated collection, and personal liability for vetting. The pricing phase is where these problems could be surfaced as category-defining: 'You currently collect rent directly and have no guarantee. We guarantee payment regardless of guest behavior.' This is not a feature -- it is a category-level reframe.",
      "user_state": {
        "emotional_state": "Not applicable -- phase not reached.",
        "knowledge_level": "Kelly has zero knowledge of Split Lease's pricing model, guaranteed income structure, or fee breakdown.",
        "commitment_level": "Zero.",
        "data_available": "None."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Phase never reached",
          "Kelly was not exposed to the payment guarantee or fee structure, which are potentially the strongest category-defining differentiators",
          "Without category framing, pricing would be perceived as 'middleman takes a cut' rather than 'guaranteed income replaces collection risk'"
        ],
        "evidence": "kelly-call.txt full transcript: No mention of pricing, fees, guarantees, or payment structure. Bryant did not reach this topic before Kelly declined."
      },
      "key_quotes": [
        {
          "source": "playbigger-category-design.txt, Ch 1",
          "quote": "As he built his company, Birdseye realized he had to design and build the category itself, because before Birdseye, there was no ecosystem that would get frozen food from a factory to consumers, and no demand for frozen food because consumers didn't even know they might want it.",
          "relevance": "Split Lease must build the category of 'guaranteed-income hosting' before Kelly will see pricing as anything other than a fee for an unwanted service. She does not know she has a payment risk problem because she has never framed direct hosting in those terms."
        }
      ]
    },
    "proposal_mgmt": {
      "what_this_lens_reveals": "This phase was never reached. However, the call itself was structurally a proposal -- Bryant proposed Landon as a guest, with terms (Monday-Friday, 3 months, early February, flexible). Kelly rejected this proposal, but notably she rejected the channel, not the guest. She said she prefers to 'work with individuals directly,' implying that if Landon had contacted her directly through a nursing site, she might have accepted. This reveals that proposal management is not just about terms -- it is about the category of the proposal channel. Play Bigger's insight applies: 'the first brand into the brain gets twice the long-term market share.' Kelly's brain already has 'Furnished Finder / nursing sites' as the anchored proposal channel. Split Lease must define a new category of proposal -- one that includes vetting, guarantees, and counterterms -- to displace that anchor.",
      "user_state": {
        "emotional_state": "Not applicable -- phase not reached.",
        "knowledge_level": "Kelly does not know that Split Lease offers structured proposals with counter-offer capability.",
        "commitment_level": "Zero.",
        "data_available": "None."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Phase never reached",
          "The concept of structured proposals (with counter-terms, duration negotiation, and payment guarantees) was never communicated to Kelly",
          "Her mental model of 'proposal' is informal direct contact, not a structured negotiation tool"
        ],
        "evidence": "kelly-call.txt, 02:09 and 04:12: Kelly rejected the intermediated proposal format and offered only a vague future referral. She never learned about Split Lease's proposal structure."
      },
      "key_quotes": [
        {
          "source": "kelly-call.txt, 00:35",
          "quote": "He is looking for, um, basically part of the week, each week. So he goes into the city for work... basically have a place to stay from Monday to Friday.",
          "relevance": "Bryant presents Landon's proposal terms (days, duration, timing) conversationally. This is a proposal without the category framing -- it sounds like any broker pitch, not like a structured platform-mediated negotiation that gives Kelly control over terms, vetting, and guarantees."
        }
      ]
    },
    "active_lease": {
      "what_this_lens_reveals": "This phase was never reached. The lens has limited direct evidence for active lease dynamics from this call. However, Play Bigger's flywheel concept (Ch 2) is relevant: category kings build a 'flywheel of benefits' where 'the leader increasingly has the best data... data becomes an unfair advantage.' For Split Lease, the active lease phase is where the flywheel should spin: each completed stay generates review data, payment history, and host reliability signals. This data, accumulated across the network, is what could eventually make Split Lease's category defensible. Kelly's rejection means zero data contribution, which weakens the flywheel. Every lost host is not just a lost listing -- it is lost network data that would have strengthened the category for all participants.",
      "user_state": {
        "emotional_state": "Not applicable -- phase not reached.",
        "knowledge_level": "Kelly has no knowledge of the Leases page, Stays Manager, Date Change Tool, or review system.",
        "commitment_level": "Zero.",
        "data_available": "None."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Phase never reached",
          "Without active lease participation, no data flywheel contribution occurs",
          "Kelly's preference for direct relationships means she would likely handle all lease management (dates, payments, communication) through personal channels, generating zero platform data"
        ],
        "evidence": "kelly-call.txt, 02:09: Her preference for direct work means she would manage active leases personally, outside any platform. Play Bigger Ch 1: 'As the leader amasses data, the data becomes an unfair advantage -- a gap that the followers can't hope to close.'"
      },
      "key_quotes": [
        {
          "source": "playbigger-category-design.txt, Ch 1 (Flywheel)",
          "quote": "As the leader amasses data, the data becomes an unfair advantage -- a gap that the followers can't hope to close. Also, the best employees want to work for the category king. The best partners want to sign deals with the category king.",
          "relevance": "Every host like Kelly who stays in the direct-to-individual category deprives Split Lease of the data, reviews, and network effects that build category dominance. The flywheel cannot spin without hosts generating transaction data through the platform."
        }
      ]
    },
    "retention": {
      "what_this_lens_reveals": "Kelly was never acquired, so retention is not directly applicable. However, her parting statement ('I have your number, if anything changes or I have an associate that has a property or unit that would work, I will definitely give you') represents a latent retention signal. She did not say 'never call me again.' She said 'not now, but maybe later or through someone else.' Play Bigger's 6-10 law suggests that categories take years to establish. Kelly may be a pre-category host -- someone who will adopt once the category is established in her market, once she sees other hosts in Troy/Metro Detroit using it, once the Groupthink Bias kicks in. Retention strategy for hosts like Kelly is actually a re-engagement strategy: keep the category visible in her world so that when her current approach fails (a bad tenant, a missed payment, a platform change at Furnished Finder), Split Lease is the anchored alternative.",
      "user_state": {
        "emotional_state": "Warm but disengaged. She is not hostile -- she is simply not convinced. The relationship with Bryant is positive, which is a retention asset.",
        "knowledge_level": "Minimal. She knows Split Lease exists and that Bryant is a person there. She does not know what the platform does or how it differs from what she already uses.",
        "commitment_level": "Zero active commitment, but non-zero latent openness. She volunteered her associates as potential leads, which indicates she does not view Split Lease negatively.",
        "data_available": "Phone number, location (Troy, MI), property type (likely multiple properties via associates), current platform usage (nursing/travel nurse sites)."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "No active relationship exists to retain",
          "Without category establishment, re-engagement attempts will face the same objection: 'I prefer to work directly with individuals'",
          "Play Bigger's Choice Supportive Bias means Kelly will continue to rationalize her current approach as superior until a category-defining event forces reassessment"
        ],
        "evidence": "kelly-call.txt, 04:12-04:25: Kelly's exit is polite but non-committal. She has not been given a reason to change her mental category. Play Bigger Ch 2: 'Once you've committed to a product or service in a new category, you're likely to give positive qualities to an option you've chosen just because you've chosen it.'"
      },
      "key_quotes": [
        {
          "source": "kelly-call.txt, 04:12",
          "quote": "If anything changes or I have an associate that has a property or unit that would work, I will definitely give you.",
          "relevance": "This is the retention thread. Kelly positions herself as a referral source, not a user. Re-engagement must convert this referral intent into personal adoption by establishing the category in her mind before the next contact."
        },
        {
          "source": "playbigger-category-design.txt, Ch 2 (Groupthink Bias)",
          "quote": "Groupthink Bias describes a tendency to believe things because other people do. Brain studies have shown that when we hold an opinion that differs from others' in a group, our brains produce an error signal, warning us that we are probably wrong.",
          "relevance": "Kelly will be more likely to adopt if she sees other hosts in her market (Troy/Metro Detroit) using Split Lease. The retention strategy should include local social proof: when hosts in her area join and succeed, Kelly's Groupthink Bias will work in Split Lease's favor."
        }
      ]
    }
  },
  "cross_phase_patterns": [
    {
      "pattern": "Category Absence as Universal Dropout Cause: Kelly's rejection is not a phase-specific failure -- it is a category-level failure that prevents entry into ANY phase. Play Bigger teaches that without a defined category, the customer defaults to the existing category and evaluates the offering as a me-too competitor within it. Kelly evaluated Split Lease as 'another middleman in the find-tenants-online category' and rejected it in favor of her incumbent approach (direct work via nursing sites). This pattern would repeat at every phase: even if she had entered evaluation, she would have evaluated against her existing category benchmarks and found Split Lease wanting.",
      "phases_affected": ["discovery", "evaluation", "onboarding", "listing_creation", "pricing", "proposal_mgmt", "active_lease", "retention"],
      "evidence": "kelly-call.txt, 02:09: 'I'd prefer to just kind of work with individuals directly.' Play Bigger Ch 1: 'The most exciting companies sell us different. They introduce the world to a new category of product or service.' Split Lease was not presented as different -- it was presented as an alternative channel for the same thing Kelly already does."
    },
    {
      "pattern": "Problem Marketing Deficit: Bryant marketed the solution (Landon as a flexible, vetted guest) without marketing the problem (that direct hosting exposes Kelly to payment risk, no recourse, vetting burden, and single-platform dependency). Play Bigger's core thesis is 'market the problem, not just the solution.' Every phase of the host journey would benefit from leading with the problem: discovery should establish the problem, evaluation should quantify it, onboarding should promise to solve it, listing creation should make the solution tangible. Kelly never heard the problem articulated.",
      "phases_affected": ["discovery", "evaluation", "onboarding", "pricing"],
      "evidence": "kelly-call.txt, 00:35-01:14: Bryant describes Landon's needs (days, duration, flexibility) but never describes the risks Kelly faces with her current approach. Play Bigger Ch 2: 'A company that best frames a problem is the company that often comes to define and take the category.'"
    },
    {
      "pattern": "Trust-Channel Mismatch: Kelly's core value is trust through direct personal vetting ('being more confident in who they were'). She has built her hosting practice around personal relationships and direct communication. Split Lease's intermediated model -- where Bryant acts as matchmaker between guest and host -- violates this trust architecture. This is not a feature gap; it is a category mismatch. The pattern affects every phase that involves host-guest interaction: proposal management, active lease communication, and reviews all route through the platform rather than through the direct relationship Kelly values.",
      "phases_affected": ["discovery", "evaluation", "proposal_mgmt", "active_lease", "retention"],
      "evidence": "kelly-call.txt, 02:09: 'I wanted someone who I can get a little bit more information as far as their nursing and just being more confident in who they were.' This is a trust architecture statement. She trusts direct vetting, not intermediated vetting. Play Bigger Ch 1: 'They replace our current point of view on the world with a new point of view.' Split Lease must replace Kelly's point of view that 'direct = trustworthy' with 'platform-verified = more trustworthy than direct.'"
    },
    {
      "pattern": "Latent Network Value: Kelly has associates with properties ('I have an associate that has a property or unit that would work') and operates in a specific geographic market (Troy/Metro Detroit). She represents not just one potential listing but a local host network. Play Bigger's flywheel concept shows that category kings accumulate advantages -- data, partners, network effects -- that widen the gap with competitors. Losing Kelly means losing access to her local network. Conversely, winning Kelly through category establishment could unlock multiple hosts through a single conversion. This network effect applies across all phases: one converted host in a local market can provide social proof that lowers dropout risk for subsequent hosts in the same market.",
      "phases_affected": ["discovery", "onboarding", "active_lease", "retention"],
      "evidence": "kelly-call.txt, 04:12: 'I have an associate that has a property or unit that would work.' kelly-call.txt, 04:29-04:49: Both Kelly and Bryant are in the Michigan/Troy area, establishing geographic affinity. Play Bigger Ch 1: 'The economic power of a category king just builds and builds.' Kelly's local network is a micro-flywheel opportunity."
    },
    {
      "pattern": "Anchoring Against the Incumbent: Kelly's anchor is Furnished Finder / nursing sites combined with direct personal contact. Play Bigger's Anchoring Effect research shows that 'the first offer put on the table in a negotiation has a powerful impact on any other offer that comes after.' Kelly's first experience of tenant-finding was direct and personal. Every subsequent offering -- including Split Lease -- is judged against that anchor. To displace this anchor, Split Lease must not compete within the same category (finding tenants) but define a new category (guaranteed income with vetted occupancy). The anchor cannot be loosened by being 'better at finding tenants' -- it can only be displaced by being 'different from finding tenants.'",
      "phases_affected": ["discovery", "evaluation", "pricing", "retention"],
      "evidence": "kelly-call.txt, 02:09: 'This was one [from] the nursing site... but I just prefer to work with the person directly.' Play Bigger Ch 2: 'In category dynamics, an early company that solves the problem will win a powerful place in customers' minds. It becomes an anchor. Other companies coming afterward get judged against that early company.'"
    }
  ],
  "sources_consulted": [
    "kelly-call.txt — Host call transcript: Kelly, ~5 min call with agent Bryant, host type Direct-Work Preference Host, outcome: DECLINED",
    "playbigger-category-design.txt — Play Bigger by Al Ramadan, Dave Peterson, Christopher Lochhead, Kevin Maney: Part 1 The Category King Economy, Ch 1 (Creation Wins), Ch 2 (Category Is the New Strategy)",
    "split-lease-journey-map.md — Full host and guest journey map covering 5 phases: listing creation, proposal, counter, acceptance, post-acceptance (documents, leases, stays, reviews, house manual)",
    "library/elements.json — Element library schema (first 200 lines): process patterns including System 1 Trust Gate, Depleted User Design, Cognitive Speed Matching, Human-to-Digital Trust Bridging"
  ]
}