{
  "lens": {
    "competitor": "Craigslist",
    "book": "playbigger-category-design.txt",
    "book_chapters": "Part 1: The Category King Economy — Chapters 1-2 (Creation Wins, Category Is the New Strategy)",
    "lens_summary": "Play Bigger reveals that Craigslist is the accidental category king of informal housing — it defined the problem frame ('I need a room, fast and cheap') without ever purposefully designing the category, leaving the entire magic triangle (product design + company design + category design) undeveloped and ripe for a purposeful category creator to redefine."
  },
  "competitor_overview": {
    "category": "general classifieds marketplace (housing subcategory: rooms/shared)",
    "primary_strength": "Liquidity and reach — Craigslist has the largest volume of informal room-sharing listings in most US metro areas because it was first to digitize classifieds at scale. The network effect is self-reinforcing: hosts post because guests search there, guests search because hosts post there. Do NOT compete on raw listing volume.",
    "business_model": "Minimal monetization — Craigslist charges for apartment broker listings in select markets and job postings, but rooms/shared listings are free. This means there is zero economic incentive to improve the room-sharing experience. The product is a by-product of the classifieds platform, not a designed category.",
    "user_base": "Extremely broad: budget-conscious renters, students, traveling nurses, digital nomads, people between leases, sublettors, and hosts with spare rooms. Users tolerate Craigslist because alternatives either don't exist or require more commitment (Airbnb = nightly pricing, Facebook Marketplace = social graph exposure). The typical Split Lease user persona — hybrid workers needing weeknight housing near an office — is an underserved segment that defaults to Craigslist because no category exists for their specific problem.",
    "brand_perception": "Functional but sketchy. Users associate Craigslist with getting things done but also with risk: scams, fake listings, unsafe meetups, ghosting. There is no brand warmth, no trust signal, no community feeling. It is the phone book of the internet — useful, but nobody loves it."
  },
  "phases": {
    "discovery": {
      "what_they_do": "Users discover Craigslist room listings primarily through Google search ('rooms for rent [city]'), direct navigation to craigslist.org, or word-of-mouth ('just check Craigslist'). There is no app store presence, no social media strategy, no content marketing, no SEO-optimized landing pages for room-sharing specifically. Discovery is entirely pull-based — the user must already know they have a housing need and must already know Craigslist exists.",
      "quality_level": "adequate",
      "framework_analysis": "Play Bigger's core thesis is that winning companies 'market the problem, not just the solution.' Craigslist does neither. It doesn't help users understand that they have a solvable problem (e.g., 'you commute 3 days a week and could save $800/month by sharing a room near your office instead of commuting'). It doesn't frame the category at all. Users arrive with a pre-formed, vague problem ('I need a place to crash') and Craigslist provides a bulletin board. There is no problem-framing, no category education, no point of view. This is exactly the Jawbone failure pattern: the product exists but the category was never designed.",
      "what_nobody_in_category_does": "Nobody in the informal room-sharing category defines the PROBLEM for the user. No one says: 'Hybrid workers waste $X/year commuting when they could split a lease near their office for a fraction of the cost.' The entire category waits for users to self-diagnose. A category designer would market the problem — and the company that frames the problem would define the category.",
      "evidence": [
        {
          "source": "Play Bigger Ch 2 — 'winning companies today market the problem, not just the solution'",
          "type": "book",
          "observation": "Craigslist has never marketed any problem. It has never published a point of view on housing, commuting, or room-sharing. It is a pure utility with zero category design.",
          "framework_interpretation": "Play Bigger argues the company that best frames the problem comes to define and take the category. Craigslist's complete absence of problem-framing means the category is unowned — it's a classifieds subcategory, not a designed category. This is the single biggest structural opportunity."
        },
        {
          "source": "Craigslist UX — rooms/shared section",
          "type": "competitor_ux",
          "observation": "The rooms/shared section is indistinguishable from any other Craigslist section (jobs, for sale, services). Same blue hyperlinks, same chronological list, same lack of imagery or context. There is no category-specific experience.",
          "framework_interpretation": "Play Bigger's magic triangle requires product design + company design + category design in sync. Craigslist's room-sharing product is a generic classifieds template, not a purpose-built housing experience. The product does not signal that this is a distinct category."
        }
      ]
    },
    "search": {
      "what_they_do": "Users navigate to the 'rooms / shared' subcategory under 'housing' on their city's Craigslist. They see a reverse-chronological list of text-based listings. Filtering options are primitive: price range, bedrooms, dogs/cats allowed, private room/shared room. Users can search by keyword. Results are blue hyperlink titles with price and a few metadata tags. No photos in search results. No map view integrated with results. No saved searches with notifications. No relevance ranking — everything is chronological, meaning the freshest post wins regardless of quality.",
      "quality_level": "weak",
      "framework_analysis": "Play Bigger describes how categories succeed when they solve a problem the user 'didn't know they had — or didn't pay attention to because we never thought there was another way.' Craigslist search is so primitive that users don't realize search COULD be better for room-sharing. They've never experienced location-based matching, compatibility filtering, or commute-time search. The Anchoring Effect (Ch 2) means Craigslist's terrible search has anchored the entire category's expectations for what room-finding search looks like.",
      "what_nobody_in_category_does": "Nobody provides commute-aware search for room-sharing. No platform asks 'where is your office?' and shows rooms within 20 minutes of commute. Nobody matches on lifestyle compatibility (work schedule, quiet hours, cleanliness standards). The search paradigm is geographic + price, never purpose + fit. For the hybrid worker persona, the problem isn't 'find a room in Brooklyn' — it's 'find a room that makes my 3-day office week livable.' Nobody searches that way because nobody has designed the category to think that way.",
      "evidence": [
        {
          "source": "Craigslist rooms/shared search interface",
          "type": "competitor_ux",
          "observation": "Search results are plain text links sorted by recency. No photos in results. No map. No relevance algorithm. Filters limited to price, bedrooms, pet policy. No way to filter by lease duration, furnished/unfurnished, or days-of-week availability.",
          "framework_interpretation": "The Anchoring Effect from Ch 2: 'the first offer put on the table in a negotiation has a powerful impact on any other offer that comes after.' Craigslist's primitive search has anchored the entire category. Any new entrant that builds commute-aware, compatibility-driven search would redefine the anchor."
        },
        {
          "source": "Play Bigger Ch 1 — Jawbone cautionary tale",
          "type": "book",
          "observation": "Jawbone invented products but never developed the category, so competitors easily matched features. Craigslist's search is so underdeveloped that even basic improvements (photos in results, map view) would seem revolutionary in this specific subcategory.",
          "framework_interpretation": "The lesson: product innovation without category design is insufficient. But the inverse is also true — in an undesigned category, even modest product improvements combined with category design can create a king."
        }
      ]
    },
    "listing_evaluation": {
      "what_they_do": "Users click into individual listings. They see a block of unformatted text written by the poster, 0-12 photos (often poorly lit, inconsistent quality), a price, and a general location (neighborhood or cross-streets, rarely exact address). There is no structured data (amenities checklist, house rules, availability calendar). There is no host profile, no reviews, no verification badges. The user must parse a wall of text to extract: price, location, availability dates, house rules, roommate expectations. Every listing is formatted differently because there is no template.",
      "quality_level": "weak",
      "framework_analysis": "Play Bigger Ch 2 cites Kahneman's cognitive biases: when overwhelmed by choices, people seek shortcuts. Craigslist listing evaluation provides zero shortcuts — no structured data, no trust signals, no comparison tools. Every listing requires full System 2 processing. The Choice Supportive Bias means users who DO find a decent listing through this painful process will believe it's great (because they invested so much effort finding it), but most users never get that far — they abandon. The category is losing users not because rooms are bad but because evaluation is exhausting.",
      "what_nobody_in_category_does": "Nobody provides structured comparison between room-sharing options. Nobody shows a 'compatibility score' or a 'fit index.' Nobody pre-answers the questions every renter has (Is it safe? Is the host reliable? Will I be comfortable there?) through verified data rather than self-reported text. In the informal room-sharing category, trust is entirely DIY — the user must construct their own trust assessment from zero structured information.",
      "evidence": [
        {
          "source": "Craigslist listing page structure",
          "type": "competitor_ux",
          "observation": "Listings are freeform text blocks. No structured amenities, no house rules checklist, no availability calendar, no host profile. Photos are optional and unmoderated. Location shown as map pin on approximate area, not exact address.",
          "framework_interpretation": "Play Bigger Ch 2 cites the Paradox of Choice: 'Increased choice among goods and services may contribute little or nothing to the kind of freedom that counts.' Craigslist provides maximum choice with minimum structure, creating decision paralysis rather than decision confidence."
        },
        {
          "source": "Play Bigger Ch 2 — cognitive biases and category organizing",
          "type": "book",
          "observation": "Categories succeed because they are 'an organizing principle' that reduces cognitive load. Craigslist's rooms/shared section is unorganized — no category structure, no quality hierarchy, no curation.",
          "framework_interpretation": "The brain needs categories to make decisions. Craigslist provides a firehose of unstructured options. A purpose-designed category would provide the organizing principles (verified, scored, structured) that the brain craves."
        }
      ]
    },
    "booking_proposal": {
      "what_they_do": "There is no booking or proposal system. The user clicks 'reply' on the listing, which opens their email client with the poster's anonymized Craigslist relay email address. The user writes a freeform email introducing themselves and expressing interest. There is no template, no structure, no required fields. The host receives the email in their personal inbox mixed with spam and other Craigslist replies. Response rates are notoriously low — many hosts are overwhelmed by volume or have already found someone. There is no way for the guest to know if their message was read, if the listing is still available, or when to expect a response.",
      "quality_level": "absent",
      "framework_analysis": "Play Bigger's magic triangle requires product design that matches the category's problem. The 'booking' problem in room-sharing is: 'I want this room, how do I secure it?' Craigslist's answer is: 'Send an email into a void and hope for the best.' This is not a product — it's the absence of a product. The 6-10 Law suggests categories take 6-10 years to solidify; Craigslist has had 25+ years and never built a booking mechanism for rooms because it was never designing a room-sharing category. It was maintaining a classifieds platform.",
      "what_nobody_in_category_does": "Nobody in the informal room-sharing space provides a structured proposal mechanism where the guest specifies: dates, budget, personal details, and references — and the host receives a formatted, comparable proposal they can accept/counter/decline within the platform. Airbnb does this for short-term stays, but nobody does it for the 1-6 month informal room-share. The entire negotiation happens in email/text, unstructured, untracked, unprotected.",
      "evidence": [
        {
          "source": "Craigslist reply mechanism",
          "type": "competitor_ux",
          "observation": "Clicking 'reply' opens an email to an anonymized relay address. No in-platform messaging, no read receipts, no structure, no proposal format. The host sees raw emails with no standardized information.",
          "framework_interpretation": "Play Bigger: 'These companies don't only invent something to sell us... They introduce the world to a new category of product or service.' Craigslist hasn't introduced any product for the room-sharing transaction itself. The transaction layer is completely absent."
        },
        {
          "source": "Play Bigger Ch 1 — category kings 'develop' the category, not just create it",
          "type": "book",
          "observation": "Birdseye didn't just invent frozen food — he developed freezer cars, freezer cases, and convinced DuPont to invent cellophane. He built the ecosystem. Craigslist built the listing but never built the transaction ecosystem: no proposals, no contracts, no payments, no protections.",
          "framework_interpretation": "Craigslist is Birdseye if Birdseye had stopped after freezing the first fish. The product exists but the category infrastructure was never developed."
        }
      ]
    },
    "communication": {
      "what_they_do": "All communication happens off-platform via email, then quickly migrates to personal phone numbers and text messages. Craigslist provides an anonymized email relay as a thin privacy layer, but once parties exchange real contact info (which happens almost immediately), Craigslist has zero visibility or influence over the interaction. There are no message templates, no scheduling tools, no in-app chat, no video call integration for virtual tours.",
      "quality_level": "absent",
      "framework_analysis": "Play Bigger describes the flywheel effect (Ch 1): as a category king amasses data and transactions, it gains an unfair advantage. Craigslist's immediate off-platform migration means it collects zero interaction data, builds zero relationship intelligence, and has zero ability to improve matches over time. Every transaction is a dead-end for the platform — the value leaks entirely to email and text. This is the opposite of a flywheel; it's a value sieve.",
      "what_nobody_in_category_does": "Nobody provides structured host-guest communication for room-sharing that includes: verified identity, conversation history, scheduling integration, and safety features. The communication in this category is indistinguishable from talking to a stranger on the internet in 1999. Nobody has applied any product design to this phase.",
      "evidence": [
        {
          "source": "Craigslist email relay system",
          "type": "competitor_ux",
          "observation": "The anonymized email relay is Craigslist's only communication feature. It provides basic privacy but zero functionality: no threading, no search, no file sharing, no scheduling, no identity verification.",
          "framework_interpretation": "Play Bigger Ch 1: 'the best data' is a flywheel advantage of category kings. Craigslist loses all data at the communication phase — it cannot learn from interactions, cannot improve matching, cannot detect fraud patterns."
        },
        {
          "source": "Play Bigger Ch 2 — category as organizing principle",
          "type": "book",
          "observation": "When users can't organize their choices within the platform, they take the decision-making off-platform. Craigslist's lack of communication tools forces the entire evaluation and negotiation process into unstructured email/text.",
          "framework_interpretation": "The category needs an organizing principle for communication, not just for discovery. Currently the category organizes discovery (barely) and abandons the user for everything after."
        }
      ]
    },
    "active_stay": {
      "what_they_do": "Craigslist has absolutely no involvement in the active stay. Once a room-share arrangement is made (entirely off-platform), the platform's role is over. There is no payment processing, no lease management, no date change tools, no dispute resolution, no check-in/check-out flow, no house manual, no communication channel. The host and guest are on their own. Payments are typically cash, Venmo, or Zelle with no platform intermediation.",
      "quality_level": "absent",
      "framework_analysis": "Play Bigger's 6-10 Law says categories take 6-10 years to solidify, and the king emerges when vendor count drops and value rises. Craigslist has existed for 25+ years without ever entering the active-stay phase. This is not a failure to iterate — it's evidence that Craigslist was never designing a room-sharing category. It was designing (accidentally) a classifieds category. The room-sharing use case is a by-product, not a product. This means the entire active-stay phase is greenfield for a category designer.",
      "what_nobody_in_category_does": "Nobody provides ongoing stay management for informal room-shares: payment tracking, date flexibility, stay-by-stay reviews, house manuals, cleaning verification, or dispute resolution. Airbnb does some of this for short-term stays but with a nightly-hotel model that doesn't fit the recurring weekly pattern of hybrid workers. The active-stay phase for room-sharing is an entirely undesigned category.",
      "evidence": [
        {
          "source": "Craigslist platform scope",
          "type": "competitor_ux",
          "observation": "Craigslist's product ends at the listing. There is no post-listing, no post-contact, no post-move-in functionality whatsoever. The platform has the same involvement in your room-share as a telephone pole has in the flyer stapled to it.",
          "framework_interpretation": "Play Bigger Ch 1: Birdseye 'realized he had to design and build the category itself, because before Birdseye, there was no ecosystem.' Craigslist is the pre-Birdseye frozen fish — the product exists but the ecosystem doesn't."
        },
        {
          "source": "Play Bigger Ch 1 — flywheel of benefits",
          "type": "book",
          "observation": "Category kings build flywheels: more transactions = better data = better product = more transactions. Craigslist's complete absence from the active-stay phase means zero flywheel potential for room-sharing.",
          "framework_interpretation": "A purpose-built room-sharing category that spans discovery through active-stay would build a data flywheel that is structurally impossible on Craigslist. This is an asymmetric advantage that cannot be competed with by adding features to classifieds."
        }
      ]
    },
    "post_stay": {
      "what_they_do": "Nothing. There is no review system, no feedback mechanism, no stay-completion acknowledgment, no security deposit return process. When a room-share ends, both parties go back to their lives. If the host wants a new guest, they post a new listing. There is no reputation accumulation, no track record, no incentive for good behavior during the stay.",
      "quality_level": "absent",
      "framework_analysis": "Play Bigger Ch 2 discusses the Groupthink Bias: 'when people are threatened they seek safety in numbers.' In room-sharing, trust is the existential problem — you're sharing your home with a stranger. Reviews and reputation are how categories create 'safety in numbers.' Craigslist's total absence of reviews means every new room-share starts from zero trust, every time. This is the structural reason why Craigslist feels 'sketchy' — it's not the design (though that's bad too), it's the complete absence of accumulated trust signals.",
      "what_nobody_in_category_does": "Nobody accumulates reputation data for informal room-sharing participants. Airbnb has reviews but for short-term stays (1-3 nights), not for the qualitatively different experience of living with someone for weeks or months. Nobody has designed a review system that captures what actually matters in a room-share: reliability, cleanliness habits, noise levels, communication quality, rule adherence over time. The post-stay phase is not just absent — it's conceptually undefined for this category.",
      "evidence": [
        {
          "source": "Craigslist platform features",
          "type": "competitor_ux",
          "observation": "Zero review functionality for rooms/shared. No user profiles. No transaction history. No reputation score. A host who has successfully hosted 50 guests looks identical to a first-timer or a scammer.",
          "framework_interpretation": "Play Bigger Ch 2: Choice Supportive Bias means 'once you've committed to a product, you're likely to feel certain it is the best.' Without reviews, there's no mechanism for commitment — every transaction is an independent, unconnected event. No loyalty, no lock-in, no flywheel."
        }
      ]
    },
    "retention": {
      "what_they_do": "Nothing deliberate. Users return to Craigslist out of habit and lack of alternatives, not because the platform re-engages them. There are no saved preferences, no recommended listings, no email campaigns, no loyalty mechanics. The only retention mechanism is brand awareness: when you need a room, you think of Craigslist because you've always thought of Craigslist. This is the Anchoring Effect operating at the category level — Craigslist anchored 'room search' in our brains 20 years ago and inertia keeps it there.",
      "quality_level": "weak",
      "framework_analysis": "Play Bigger Ch 2: 'Once people have chosen a king, they will always tend to believe the king is better, even if it's not. This reality explains why companies with superior technology can still lose category wars.' This is Craigslist's moat — not product quality, but cognitive anchoring. Users believe Craigslist is where you find rooms because they've always believed it. Breaking this requires not a better product but a different category. You don't beat the king by being better; you beat it by being different. You redefine the problem.",
      "what_nobody_in_category_does": "Nobody converts one-time room searches into ongoing housing relationships. Nobody says: 'You searched for a weeknight room in Manhattan — here's your ongoing dashboard of options that updates as your schedule changes.' The category treats every search as a one-off transaction rather than an ongoing need. For hybrid workers, room-sharing is a recurring, evolving need — but nobody has designed for that.",
      "evidence": [
        {
          "source": "Play Bigger Ch 2 — Anchoring Effect and category kings",
          "type": "book",
          "observation": "Craigslist's only retention advantage is cognitive anchoring — it was first to define 'online room search' and that association persists despite 25 years of zero product improvement.",
          "framework_interpretation": "Play Bigger: 'it's almost always futile to try to unseat a category king that's not screwing up.' But Craigslist is NOT a category king of room-sharing — it's a category king of classifieds that happens to have a rooms section. Split Lease doesn't need to unseat Craigslist as classifieds king. It needs to create a NEW category that pulls room-sharing users out of classifieds entirely."
        },
        {
          "source": "Play Bigger Ch 1 — 'different wins, not better'",
          "type": "book",
          "observation": "Elvis didn't disrupt jazz by making better jazz. He created rock and roll. 'Rock was different, not better, than jazz.' Facebook wasn't the first social network. Netflix started as DVDs-by-mail, different from Blockbuster.",
          "framework_interpretation": "A better Craigslist (more photos, better search) would still be classifieds. The opportunity is to create a DIFFERENT category — managed room-sharing for hybrid workers — that makes Craigslist's approach seem as outdated as hailing a cab seemed after Uber."
        }
      ]
    }
  },
  "split_lease_phase_mapping": {
    "discovery": "Host: discovery + evaluation. Guest: discovery",
    "search": "Guest: search + listing_evaluation",
    "listing_evaluation": "Guest: listing_evaluation + proposal_creation",
    "booking_proposal": "Host: proposal_mgmt. Guest: proposal_creation + negotiation",
    "communication": "Host: proposal_mgmt + active_lease. Guest: negotiation + acceptance + active_lease",
    "active_stay": "Host: active_lease. Guest: move_in + active_lease",
    "post_stay": "Host: retention. Guest: active_lease (end-of-stay reviews within the lease)",
    "retention": "Host: retention. Guest: active_lease (ongoing engagement through recurring stays)"
  },
  "category_blind_spots": [
    {
      "blind_spot": "The entire informal room-sharing category has no category designer — nobody has defined the PROBLEM that room-sharing solves for hybrid workers",
      "why_nobody_tries": "Craigslist doesn't need to (it's a classifieds platform, rooms are a by-product). Airbnb won't (its category is travel/short-term stays, not recurring room-sharing). Facebook Marketplace won't (it's a general marketplace). Nobody has an economic incentive to define this specific problem because nobody has built a business model around it yet.",
      "framework_insight": "Play Bigger Ch 2: 'A company that best frames a problem is the company that often comes to define and take the category.' The hybrid worker room-sharing problem has NEVER been framed. The first company to say 'commuting hybrid workers waste $X/year when they could split a lease for $Y/month' will own the problem frame and define the category.",
      "signature_potential": "high"
    },
    {
      "blind_spot": "No trust infrastructure exists for medium-term room-sharing (1 week to 6 months) — the gap between Airbnb's overnight reviews and traditional lease credit checks",
      "why_nobody_tries": "Building trust infrastructure requires staying in the transaction lifecycle (identity verification, payment processing, reviews, dispute resolution). Craigslist exits at listing. Airbnb's trust model is designed for 1-3 night stays with post-checkout reviews, not 13+ weekly stays within a single lease. Traditional rental trust (credit checks, references) is too heavy for informal arrangements.",
      "framework_insight": "Play Bigger Ch 1: Birdseye 'realized he had to design and build the category itself, because before Birdseye, there was no ecosystem.' The trust ecosystem for medium-term room-sharing doesn't exist. Building it (stay-by-stay micro-reviews, verified profiles, payment guarantees) would be the equivalent of Birdseye designing freezer cars — creating the category infrastructure, not just the product.",
      "signature_potential": "high"
    },
    {
      "blind_spot": "Nobody has built a room-sharing platform that spans the full lifecycle from discovery through active-stay management",
      "why_nobody_tries": "Full-lifecycle platforms are expensive and complex to build. Craigslist optimizes for listing volume (low cost). Airbnb optimizes for booking transactions (high margin per booking). A full-lifecycle platform for informal room-sharing has lower per-transaction value than Airbnb and higher product complexity than Craigslist. The economics don't work for companies designed around other categories.",
      "framework_insight": "Play Bigger Ch 1: The flywheel — 'As the leader amasses data, the data becomes an unfair advantage — a gap that the followers can't hope to close.' A full-lifecycle room-sharing platform would accumulate data across discovery, matching, negotiation, active stays, payments, and reviews. This flywheel is structurally impossible for Craigslist (exits at listing) or Airbnb (wrong category model). The data advantage compounds with every stay cycle.",
      "signature_potential": "high"
    },
    {
      "blind_spot": "The category has no recurring engagement model — every housing search is treated as a one-time transaction, even for users whose need is inherently recurring",
      "why_nobody_tries": "Classifieds platforms are designed for one-off transactions (find thing, contact seller, done). Room-sharing was squeezed into the classifieds model because that's the only digital category that existed for it. Nobody has questioned whether the transactional model is right for a use case that's fundamentally relational and recurring.",
      "framework_insight": "Play Bigger Ch 2: 'Sometimes, booming new categories don't disrupt anything at all.' A managed room-sharing category doesn't need to kill Craigslist. It needs to pull out the subset of users whose needs are recurring (hybrid workers, traveling professionals) and give them a purpose-built category. Craigslist continues to serve one-off transactions. The new category serves ongoing relationships.",
      "signature_potential": "high"
    },
    {
      "blind_spot": "Nobody applies the magic triangle (product + company + category design) to room-sharing — there are products but no designed category",
      "why_nobody_tries": "Room-sharing is seen as a subcategory of housing, not a category in its own right. The mental model is: housing > rentals > room-share. Nobody has argued that room-sharing for hybrid workers is a distinct category with distinct needs, distinct economics, and a distinct problem frame.",
      "framework_insight": "Play Bigger Ch 2: 'We depict the strategy as a triangle, with each side of equal importance: product design, company design, and category design.' Split Lease has the opportunity to execute all three: a purpose-built product (Stays Manager, proposals, date-change tools), a purpose-built company (category point of view on hybrid work and housing), and a purpose-built category ('managed room-sharing' or 'split-lease housing'). This is the magic triangle applied to a space where nobody has applied any side of it.",
      "signature_potential": "high"
    }
  ],
  "sources_consulted": [
    "playbigger-category-design.txt (Part 1: Chapters 1-2)",
    "split-lease-journey-map.md",
    "library/elements.json (first 200 lines — schema and first 3 elements)",
    "Training knowledge of Craigslist rooms/shared UX (2024-2025)"
  ]
}
