{
  "lens": {
    "competitor": "HotPads",
    "book": "100things-attention-memory-decisions.txt",
    "book_chapters": "All sections: How People See (Things 1-12), How People Read (Things 13-18), How People Remember (Things 19-26), How People Think (Things 27-39), How People Focus Attention (Things 40-49), What Motivates People (Things 50-62), People Are Social Animals (Things 63-71), How People Feel (Things 72-84), People Make Mistakes (Things 85-89), How People Decide (Things 90-100)"
  },
  "opportunity_thesis": "HotPads -- and the entire rental listing category -- treats housing search as a database query when it is actually a social trust decision made by cognitively limited, emotionally stressed humans. Weinschenk's 100 Things framework reveals that the brain's most powerful systems for evaluation (face recognition via the FFA), persuasion (narrative processing), memory (4-item working memory with recognition superiority), and decision-making (unconscious, socially influenced) are all completely bypassed by listing platforms. Split Lease's opportunity is not to build a better search engine -- that is HotPads' territory. The opportunity is to build the first rental platform that speaks the brain's native language: faces instead of empty rooms, stories instead of spec sheets, recognition instead of recall, progress instead of void, and presence instead of abandonment. The gap is not technical; it is cognitive. And because cognitive design is invisible to metrics-driven competitors, it is structurally defensible.",
  "opportunities": [
    {
      "id": "opp-001",
      "title": "The Face-First Trust Engine",
      "based_on_disappointments": ["disappoint-001", "disappoint-007", "disappoint-004"],
      "split_lease_phases": ["listing_evaluation", "listing_creation", "search", "proposal_creation"],
      "the_signature": "Split Lease becomes the first rental platform where listings lead with a human face and a lived-experience story, not an empty room and a specification grid. The host's photo, a one-paragraph bio, a response-time badge, and resident micro-testimonials appear above the fold before any property photos. The brain's fusiform face area (FFA) fires within 170 milliseconds of seeing a face -- before the user has consciously processed a single listing detail. This means the trust assessment begins instantly, on the brain's fastest channel, in a context where no competitor has ever activated it. Guests would say: 'I already felt like I knew the host before I clicked Contact.'",
      "why_competitors_wont_copy": "HotPads monetizes landlord leads, which means minimizing friction for landlords who list. Requiring host photos, bios, and enabling resident reviews would reduce listing volume, which directly reduces revenue. Zillow Group's MLS data pipeline aggregates millions of listings from property management systems that have no concept of host identity -- retrofitting identity into that pipeline would require fundamental architecture changes. More importantly, HotPads' brand is the map, not the relationship. Adding faces and stories would require a brand pivot that Zillow Group's portfolio strategy does not support.",
      "behavioral_framework_case": "This is the strongest behavioral science case in the entire run. Thing #4 (FFA for faces): the brain has dedicated hardware that processes faces faster than any other visual stimulus, directly connected to the amygdala for emotional evaluation. Thing #47 (faces capture attention automatically): faces are one of only six stimulus categories that bypass selective attention filters. Thing #33 (stories > data): narrative-format information is processed more deeply, remembered more accurately, and recalled more easily than specification-format information. Thing #74 (anecdotes > data): a single lived-experience micro-review is more persuasive than the entire specification grid. Thing #79 (look and feel = first trust indicator): the visual impression of a listing page communicates trustworthiness before any content is read. Combined, these five principles argue that a face-and-story-first listing page would engage the brain's trust, attention, memory, and persuasion systems simultaneously -- systems that every competitor leaves dormant.",
      "user_evidence": "7 transcript quotes directly validate this. Cristina: 'I'll be getting like his LinkedIn and those things.' Susan: 'Do you do background check?' Frederick: 'I can't even really get to know them.' Shomit: Robert describes Zoom matching 'so you guys can chat and make sure that you're comfortable with each other.' Anthony: Bryant sends LinkedIn profiles. The word 'comfortable' appears repeatedly as the threshold condition for commitment -- it is user language for what Weinschenk calls the FFA-mediated trust assessment.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do NOT turn this into a generic 'verified profile' badge. The signature is the face -- the actual photograph and the actual story -- not a checkmark icon.",
        "Do NOT make host photos optional and then display a grey avatar placeholder. If the face is the trust signal, absent faces must be handled with grace (e.g., 'This host hasn't added a photo yet -- here's what verified guests say about them').",
        "Do NOT position this as a feature. 'We have host profiles!' is a feature. 'Every listing starts with a human face' is a design philosophy.",
        "Do NOT let the narrative description degenerate into marketing copy. Stories must feel authentic and specific ('Tuesday mornings, sunlight fills the east-facing bedroom'), not promotional ('Beautiful sun-drenched apartment in vibrant neighborhood!')."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-004", "communicates-003", "guest-looks-001", "rb-ui-001"],
        "gap_assessment": "The library has strong trust infrastructure elements (works-004 bridges human-to-digital trust; communicates-003 establishes trust credential stacking). However, no existing element specifically addresses the face-first listing page or narrative listing descriptions. The library addresses trust transfer from agents but not trust generation from host identity on listing pages. This opportunity extends the trust architecture into the search and evaluation phases where the library is thinnest."
      }
    },
    {
      "id": "opp-002",
      "title": "The Living Platform: Active-Stay Presence That Builds Habits",
      "based_on_disappointments": ["disappoint-010", "disappoint-008", "disappoint-011"],
      "split_lease_phases": ["active_lease", "move_in", "retention"],
      "the_signature": "Split Lease becomes the only rental platform that remains useful AFTER move-in. The Stays Manager, date change tools, recurring micro-reviews, and house manual create a weekly touchpoint cycle during the active lease that no listing platform even contemplates. Each weekly check-in is a small, rewarding interaction (Thing #60: habits require small steps over time) that accumulates into platform loyalty. After 13 weeks of weekly engagement, the guest's relationship with Split Lease has shifted from 'the app I used to find this place' to 'the app I use to manage my living situation.' When the next search begins, the guest does not start from zero on a competitor -- they start from an established habit on Split Lease.",
      "why_competitors_wont_copy": "HotPads' business model is lead generation. Their revenue event happens at inquiry, not at move-in. Building active-stay features would require a fundamentally different product (lease management), different partnerships (landlord tools, payment processing), and different monetization (subscription or transaction fees). Zillow Group has deliberately segmented their portfolio: HotPads for search, Zillow for home buying, and no product for active tenancy management. The organizational structure makes active-stay features an orphan -- no team owns it, no budget funds it, no KPI measures it.",
      "behavioral_framework_case": "Thing #60 (habits = small steps over time): a single search session cannot create a habit; weekly active-stay interactions can. Thing #77 (people are happier when busy): productive engagement during the active stay (date management, maintenance requests, micro-reviews) creates the busy-but-not-overwhelmed state that Weinschenk links to satisfaction. Thing #52 (dopamine and information seeking): the active stay contains many information-seeking moments (is my next stay confirmed? what is the cleaning schedule? has the host responded?) that activate the same dopamine loops that make search addictive. Thing #55 (progress, mastery, control): the Stays Manager gives guests visible progress through their lease, increasing mastery of the platform, and control over their schedule -- all three motivation drivers. Thing #84 (familiar when scared): the weekly return to a familiar dashboard provides emotional anchoring during what Frederick called feeling like 'I'm moving every single week.'",
      "user_evidence": "Nneka transcript: Brad texts Nneka directly for reschedules because the platform has no active-stay tool -- 'I can't make it, can I do another day?' The entire rescheduling process is off-platform. Frederick: 'I would feel like I'm moving every single week' and 'would I have to make sure it's like perfect every time I leave' -- expressing the emotional burden of active-stay logistics without platform support. Vince call: the agent emphasizes the date-change feature as a key differentiator: 'through our app, you can actually change your dates.'",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do NOT turn the Stays Manager into a complex property management dashboard. The signature is simplicity and warmth, not feature density. Each weekly check-in should take under 30 seconds.",
        "Do NOT require the guest to do work to maintain the habit. The platform should pull them back with useful notifications (Thing #53: unpredictability keeps people searching), not push them with obligations.",
        "Do NOT conflate active-stay engagement with marketing. The weekly touchpoint is about the guest's living experience, not about upselling or cross-selling.",
        "Do NOT copy Airbnb's review model. Single post-checkout reviews cannot form habits for 3+ month leases (the Stays Manager convergence insight). The model must be one-tap weekly micro-reviews that accumulate over time."
      ],
      "existing_library_overlap": {
        "related_elements": ["guest-works-003", "guest-works-004", "guest-behaves-004", "guest-feels-001", "guest-communicates-005", "guest-works-001"],
        "gap_assessment": "The library is RICH here. The Stays Manager system is the most converged element in the entire library -- 6+ independent processes have identified it as foundational. guest-works-003 (Stays Manager as System 1 Dashboard), guest-works-004 (Eliminate Off-Platform Communication), guest-behaves-004 (Date Change as Three-Tap Flow), guest-communicates-005 (Proposal Progress Pipeline). This opportunity does NOT create new elements but rather validates and extends the library's strongest convergence point from a new lens (Weinschenk's cognitive psychology). The new contribution is the habit-formation framing (Thing #60) and the dopamine-loop analysis (Thing #52), which provide neurological grounding for what previous runs identified from user call analysis."
      }
    },
    {
      "id": "opp-003",
      "title": "The Cognitive Scaffolding Layer: Memory-Aware Search",
      "based_on_disappointments": ["disappoint-002", "disappoint-005", "disappoint-006"],
      "split_lease_phases": ["search", "listing_evaluation", "discovery"],
      "the_signature": "Split Lease search remembers what you did, surfaces what changed, and scaffolds the comparison your brain cannot hold. Returning users see: 'You viewed 8 listings last week, favorited 3. 2 new listings match your criteria since Tuesday. Here are your top 3 for comparison.' Previously viewed listings are marked with a subtle 'Viewed' indicator. The comparison tray holds up to 4 listings side-by-side (Thing #20: 4-item working memory limit). Search results visually differentiate listings by match quality -- higher-confidence matches get larger cards with richer previews, breaking the 'attention wasteland' of uniform results (Thing #45: salient cues). The platform converts recall tasks into recognition tasks (Thing #22) at every opportunity.",
      "why_competitors_wont_copy": "HotPads' metrics incentivize engagement (time on site, searches per session), not decision quality. Helping users decide efficiently would reduce time-on-site, which is the metric advertisers and landlords pay for. The business model is structurally opposed to cognitive scaffolding: the more confused the user, the more they scroll, the more ads they see. Additionally, Zillow Group's data pipeline is optimized for listing volume (tens of millions of records), not for personalized session memory across relatively small listing sets. Building cross-session memory requires a fundamentally different data architecture.",
      "behavioral_framework_case": "Thing #20 (4-item working memory limit): showing 30+ listings simultaneously exceeds cognitive capacity by 7-10x. The comparison tray constrains options to the brain's actual capacity. Thing #22 (recognition > recall): marking previously viewed listings converts an effortful recall task ('which ones did I like?') into an effortless recognition task ('I remember seeing this one'). Thing #40 and #45 (selective attention and salient cues): visual differentiation by match quality gives the attention system a priority target, enabling deep evaluation rather than shallow scanning. Thing #57 (people are inherently lazy): users will not build their own comparison spreadsheets; they will satisfice with shallow scanning. The platform must do the scaffolding work the brain cannot.",
      "user_evidence": "Tom C: 'That's a lot of, like the issues that it seems like this lot of options' -- expressing cognitive overload directly. Shomit: 'I want to see what the other options are' -- expressing the comparison need the platform must serve. The Split Lease agent manually curates and shares listings because 'the search engine right now is broken' -- the human agent IS the cognitive scaffold that no platform provides. Cristina: 'I don't remember things' -- the bluntest possible validation of the memory problem.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "natural_fit"
      },
      "anti_patterns": [
        "Do NOT reduce this to a 'recently viewed' section. The signature is active scaffolding -- the platform surfaces insights about the user's search journey, not just a chronological list of views.",
        "Do NOT overwhelm the comparison view with data. Each comparison card should show only the 3-4 attributes that differ between listings. Common attributes are collapsed.",
        "Do NOT make the session memory feel surveillance-like. The tone should be helpful ('Here's where you left off') not tracking ('We noticed you spent 4 minutes on this listing').",
        "Do NOT apply this to Split Lease's current small listing inventory in a way that feels like the platform is over-engineering a 3-listing search. Scale the scaffolding to the actual inventory size."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-002", "guest-communicates-006", "guest-looks-001"],
        "gap_assessment": "The library has the depleted-user principle (works-002) and some search-phase elements (guest-communicates-006: Schedule-First Listing Cards, guest-looks-001: Stays Manager Hero Card). However, no existing element addresses cross-session memory, comparison scaffolding, or attention-guided search results. The search phase is one of the thinnest areas in the library, because design-stack runs analyze calls (which happen after search) while reverse-benchmark runs analyze competitor search experiences. This opportunity fills a genuine coverage gap."
      }
    },
    {
      "id": "opp-004",
      "title": "The Progress Visibility Engine: From Void to Journey",
      "based_on_disappointments": ["disappoint-003", "disappoint-009"],
      "split_lease_phases": ["proposal_creation", "negotiation", "acceptance", "proposal_mgmt"],
      "the_signature": "Split Lease transforms the post-inquiry experience from a black box into a visible journey with clear milestones. After submitting a proposal, the guest sees a live status pipeline: 'Proposal Sent' (with timestamp), 'Viewed by Host' (with notification), 'Host is Responding' (with expected timeline), 'Counter-Offer Received' or 'Accepted.' Each stage provides the three motivation drivers Weinschenk identifies in Thing #55: progress (visible forward movement), mastery (each stage teaches the guest more about the process), and control (the guest can withdraw, modify, or escalate at any point). The communication happens in-platform with structured conversation templates that set social norms (Thing #66) and reduce the awkwardness of messaging a stranger about living in their space.",
      "why_competitors_wont_copy": "HotPads' contact form IS the product for landlords. Structuring the inquiry process would require landlords to respond within the platform, which adds friction they have never accepted. Landlords currently receive HotPads leads as emails and respond (or don't) on their own schedule. Requiring in-platform response would reduce landlord adoption, which directly reduces listing volume. The lead-generation model monetizes the inquiry; structuring what happens after the inquiry requires relationship infrastructure that no listing platform has built.",
      "behavioral_framework_case": "Thing #55 (progress, mastery, control): the contact form destroys all three motivation drivers at peak user investment. The progress pipeline restores them. Thing #50 (goal gradient): users are most motivated when closest to their goal. The proposal submission IS the closest-to-goal moment in search, and the platform must sustain that motivation rather than deflating it with silence. Thing #98 (uncertain people follow others): by showing typical response times and process stages, the pipeline provides the social model that reduces decision uncertainty. Thing #36 (time is relative): waiting feels longer without progress feedback. A 24-hour wait with status updates feels shorter than a 12-hour wait with silence. Thing #66 (online interactions follow social rules): in-platform messaging allows the platform to set response expectations, conversation structure, and reciprocity norms.",
      "user_evidence": "Chantel: 'I was looking at the bid package and I saw the six hours during business hours. I just feel like it's six hours realistic enough?' -- directly questioning response time reliability. Frederick: 'she has an answering me back. So, uh, Yeah, that that's boring' -- expressing the emotional deflation of the void. Vince: 'they're not communicating well right now' -- communication gaps create anxiety across contexts.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "straightforward",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do NOT over-engineer the pipeline with too many stages. 4-5 clear stages are enough. More stages create a different kind of anxiety ('why is it stuck at stage 3?').",
        "Do NOT show fake progress. If the host hasn't viewed the proposal, don't show 'Under Review' to make the guest feel better. Honesty is the trust signal.",
        "Do NOT make in-platform messaging feel like a chat app. The tone is structured and purposeful, not casual. Templates and suggested questions guide the conversation.",
        "Do NOT penalize hosts who respond slowly by demoting their listings. Instead, surface response-time data so guests can set expectations accordingly."
      ],
      "existing_library_overlap": {
        "related_elements": ["guest-works-001", "guest-communicates-005", "guest-looks-007", "guest-behaves-004"],
        "gap_assessment": "The library is moderately strong here. guest-works-001 (Proposal Pipeline as Anxiety-Resolving Status Stream) and guest-communicates-005 (Proposal Progress Pipeline) directly address this area. guest-looks-007 (Proposal Pipeline as Action-Assigned Progress Bar) provides the visual specification. This opportunity validates and extends these existing elements with the Weinschenk framework, adding the neuroscience of progress motivation (Thing #55 goal gradient) and social norm design (Thing #66). The new contribution is the communication ejection analysis and the behavioral argument for in-platform messaging."
      }
    },
    {
      "id": "opp-005",
      "title": "The Human Agent Encoded: Platform That Moves at Conversational Speed",
      "based_on_disappointments": ["disappoint-009", "disappoint-003"],
      "split_lease_phases": ["negotiation", "acceptance", "active_lease", "proposal_mgmt"],
      "the_signature": "Split Lease encodes the functions that human agents (Bryant, Robert, Vale) currently perform into platform features that are as fast as a text message. Every transcript shows users defaulting to the human agent because the agent is faster than the platform: Anthony texts photos instead of uploading, Cristina asks Bryant to 'do the work for me,' Brad texts Nneka directly to reschedule. The signature is not replacing the agent but making the platform match the agent's speed (Thing #57: people are inherently lazy and take the easiest path). One-tap actions replace multi-step forms. Conversational UI patterns replace specification grids. The agent remains accessible but the platform becomes the faster option for common actions.",
      "why_competitors_wont_copy": "HotPads has no human agent layer to encode. Their platform IS the only touchpoint. Split Lease's unique advantage is that it has years of recorded human-agent interactions (the transcript archive) that reveal exactly which functions the platform must serve and at what speed. Competitors would need to first build human-agent relationships, then analyze them, then encode them -- a multi-year process. Additionally, 'conversational speed' platform design requires intensive UX research that metrics-driven competitors do not prioritize.",
      "behavioral_framework_case": "Thing #57 (people are inherently lazy): users default to the easiest path. When texting Bryant is easier than using the platform, Bryant wins. When the platform is easier than texting, the platform wins. Thing #58 (shortcuts only if easy): the platform must provide shortcuts (one-tap date changes, quick-reply templates) that are genuinely easier than the text message alternative. Thing #42 (well-practiced skills don't require conscious attention): texting is a well-practiced skill. The platform must achieve comparable automaticity through consistent, learnable interaction patterns. Thing #66 (online interactions follow social rules): in-platform communication can enforce social norms (response expectations, reciprocity) that text messages cannot.",
      "user_evidence": "Discovery-001 from L2: 'The Human Agent as Missing Platform Layer' -- the strongest new discovery. Anthony: 'this is a cell phone. I could probably texting pictures.' Cristina: 'if you can't do the work for me.' David: Bryant asks 'could you just text me now, at least your full name.' The agent compensates for a broken search by manually sharing listings. The human agent is the platform's informal UX and the platform must catch up.",
      "opportunity_score": {
        "signature_potential": "medium",
        "category_gap": "most_competitors",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "ambitious",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "Do NOT remove the human fallback. The signature is that the platform becomes FASTER than the agent for common tasks, not that the agent disappears.",
        "Do NOT try to replicate conversational AI. The speed comes from well-designed one-tap interactions, not from chatbots.",
        "Do NOT underestimate how fast texting is. A text message takes 5-10 seconds. If the platform's equivalent takes 30 seconds, texting wins every time.",
        "Do NOT encode the agent's judgment, only the agent's speed. The agent's value is judgment in complex situations; the platform's value is speed in routine situations."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-003", "guest-works-004", "guest-behaves-004", "guest-communicates-005"],
        "gap_assessment": "Strong library overlap. works-003 (Match Platform Speed to Phone Call Speed) directly addresses this from the host side. guest-works-004 (Eliminate Off-Platform Communication) addresses it from the guest side. guest-behaves-004 (Date Change as Three-Tap Flow) is a specific instantiation. This opportunity synthesizes existing library elements through the Weinschenk lens, adding the neurological basis for speed preferences (Thing #57 laziness, Thing #58 shortcut economics). The primary new contribution is the framing of the human agent as the speed benchmark the platform must beat."
      }
    }
  ],
  "opportunity_ranking": [
    {
      "id": "opp-001",
      "rank": 1,
      "reason": "Highest signature potential with strongest behavioral science backing. The FFA (Thing #4) is dedicated neural hardware that no competitor activates. 7 transcript quotes validate the need. The entire category ignores faces, stories, and social proof in listing evaluation. This is the purest 'beer sommelier' opportunity: excel where nobody tries."
    },
    {
      "id": "opp-002",
      "rank": 2,
      "reason": "Strongest structural differentiator -- the Stays Manager convergence is the most validated signal in the entire library (6+ independent processes). This run adds the habit-formation neurological framing (Thing #60) and dopamine-loop analysis (Thing #52) that previous runs lacked. Highest long-term strategic value because habit formation during the active stay creates switching costs that no competitor can replicate from the search side."
    },
    {
      "id": "opp-004",
      "rank": 3,
      "reason": "Highest feasibility with strong impact. Split Lease already has proposal mechanics; the opportunity is to make the process visible and communicative rather than opaque. The behavioral science case (Thing #55 progress/mastery/control, Thing #50 goal gradient) is compelling, and 3 transcripts directly validate the void experience. Also validates and extends the library's existing proposal pipeline elements."
    },
    {
      "id": "opp-003",
      "rank": 4,
      "reason": "Fills the library's thinnest coverage area (search phase) with strong cognitive science backing. However, Split Lease's current small listing inventory means this opportunity is more relevant as the platform scales. The signature potential is high at scale but moderate at current size."
    },
    {
      "id": "opp-005",
      "rank": 5,
      "reason": "Deeply validated by transcripts but has the highest overlap with existing library elements. The primary new contribution is the framing, not the solution. Ranked lower because the speed benchmark (match texting speed) is a quality-of-execution challenge rather than a new capability."
    }
  ],
  "strategic_narrative": "The HotPads analysis through Weinschenk's cognitive psychology framework reveals a category that has been designed for machines, not for brains. Listing platforms optimize for data retrieval -- search, filter, display -- while ignoring the neurological systems that actually drive housing decisions: face recognition (Thing #4), narrative processing (Thing #33), social proof seeking (Thing #98), working memory limits (Thing #20), and habit formation through repeated small interactions (Thing #60). The entire category treats the brain as an infinite-capacity, emotionally neutral information processor. Weinschenk's framework demonstrates that this assumption is catastrophically wrong.\n\nSplit Lease's strategic opportunity is to build the first rental platform designed for how the brain actually works. The five opportunities form a coherent lifecycle: the Face-First Trust Engine (opp-001) transforms listing evaluation from a data task into a social assessment. The Cognitive Scaffolding Layer (opp-003) respects working memory limits during search. The Progress Visibility Engine (opp-004) sustains motivation through the proposal void. The Human Agent Encoded (opp-005) ensures platform interactions are fast enough to compete with the texting habit. And the Living Platform (opp-002) creates weekly habits during the active stay that make the platform part of the guest's living rhythm, not just their search history.\n\nThe most important insight from this run is that these opportunities are not independent features -- they are a single design philosophy: speak the brain's native language. The competitor who treats listings as database records and users as rational agents will always lose to the competitor who treats listings as social introductions and users as cognitively limited, emotionally motivated, socially influenced humans. HotPads cannot adopt this philosophy because their lead-generation business model rewards search volume, not decision quality. Split Lease can adopt it because its business model (lifecycle management of flexible leases) rewards relationship depth, habit formation, and trust. The cognitive design philosophy is not just a UX strategy -- it is a business model advantage that becomes more defensible with every weekly Stays Manager check-in and every face-first listing evaluation."
}
