{
  "lens": {
    "guest_call": "user-stories-initial-analysis.md",
    "book_extract": "kahneman-part5-two-selves.txt"
  },
  "reinforcements": [
    {
      "new_element_id": "works-001",
      "existing_element_id": "ds-ui-007",
      "similarity": "Both prescribe a deliberate move-in onboarding experience. The existing element (Move-In House Manual with Verification Checklist) provides a structured checklist for the guest's first hours in the space. The new element (Design Move-In as a Deliberate Positive Peak) reframes the move-in checklist as a peak-engineering opportunity: the welcome card, host message, and neighborhood essentials must precede any operational content because the peak-end rule means the first attended-to information defines the space in memory.",
      "combined_evidence": "The existing element solves the operational problem (guest needs house manual information). The new element solves the mnemonic problem (the remembering self needs a positive peak at arrival). Combined: the House Manual content should be restructured so that welcome and warmth precede rules and procedures. The checklist (existing) provides the operational skeleton; the peak-first hierarchy (new) provides the emotional ordering. These are complementary: operational completeness within an emotionally optimized sequence.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-003",
      "existing_element_id": "ds-ui-0900-003",
      "similarity": "Both prescribe rich listing cards for search. The existing element (from a prior guest run) addresses listing card design with schedule-fit signals. The new element (Manufacture Peak Moments During Search Through Rich Listing Cards) adds the Two Selves mechanism: each enrichment layer on the card is a peak probability multiplier, because the remembering self stores only one prototypical card impression from the entire search session.",
      "combined_evidence": "The existing element identifies WHAT information belongs on the card (schedule fit, photos, availability). The new element explains WHY richer cards matter for retention: the search session will be prototyped by one card impression (Kahneman Ch 35), and richer cards produce richer prototypes that drive return visits. Combined: schedule-fit data (existing) plus neighborhood identity, photo carousel, and availability alignment (new) create the maximal-peak-probability listing card.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "works-004",
      "existing_element_id": "ds-ui-0900-002",
      "similarity": "Both address the messaging-to-proposal pathway. The existing element (Scaffolded First Contact Card, from a prior guest run) designs the initial message as a structured interaction with host context. The new element (Use Messaging to Create a Human Interaction Peak Before Commitment) adds the Two Selves justification: messaging creates a memorable human peak that the remembering self stores as evidence of connection, and this narrative peak is what shortens the path to proposal -- not just the information exchanged.",
      "combined_evidence": "The existing element provides the scaffolding (host profile, suggested questions, response time). The new element provides the retention mechanism: the guest who messages has a richer booking narrative ('I reached out, they responded warmly') than the guest who silently evaluates. Combined: the scaffolded first contact (existing) is the mechanism that manufactures the human interaction peak (new). The scaffold should be designed not just for information exchange but for peak generation -- host warmth signals, personal language, and response velocity matter because they determine the peak's emotional intensity.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-005",
      "existing_element_id": "ds-ui-2200-001",
      "similarity": "Both address the focusing illusion in listing evaluation. The existing element (Gain-Frame Listing Price Card) reframes price display to emphasize value gained. The new element (Counter the Focusing Illusion with Experiencing-Self Information) extends this to all listing information: livability data (commute, noise, daily essentials) must be surfaced alongside photos to counteract the focusing illusion that inflates aesthetic first impressions over daily-life predictors of well-being.",
      "combined_evidence": "The existing element applies the focusing illusion to price framing. The new element generalizes the principle: whatever information is visually prominent on the listing page becomes the evaluation lens. Combined: price should be gain-framed (existing) AND positioned after photos and livability data (new), so the guest's evaluation incorporates experiential reality before financial calculation. The gain-frame (existing) plus experiencing-self data layer (new) together produce a more accurate affective forecast.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "communicates-006",
      "existing_element_id": "ds-ui-2200-003",
      "similarity": "Both address the counter-proposal information architecture. The existing element (Preserved-First Counter-Offer Display) leads with unchanged terms before showing changes. The new element (Attention-Directing Information Architecture for the Proposal Moment) adds the human message as the primary element that precedes even the preserved terms, and introduces a common-ground summary and narrative duration framing.",
      "combined_evidence": "The existing element establishes the preserved-first principle (show what stayed the same before what changed). The new element adds a layer above: the host's personal message must precede even the preserved terms, because the focusing illusion means whatever the guest attends to FIRST defines the negotiation's emotional register. Combined: host message first (new) > preserved terms (existing) > changed terms (both). The emotional sequence is: human warmth > agreement > adjustment.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "behaves-001",
      "existing_element_id": "ds-ui-007",
      "similarity": "Both address the first interaction after check-in. The existing element (Move-In House Manual) surfaces operational content upon arrival. The new element (Welcome Card Progressive Reveal) prescribes a full-screen takeover that commands the guest's entire attention, delivering the welcome peak before any operational content. The existing element treats move-in as information delivery; the new element treats it as experience design.",
      "combined_evidence": "The existing element ensures the guest has the information they need (access codes, rules, guidelines). The new element ensures the guest's first interaction is emotionally positive (hero photo, host message, neighborhood essentials). Combined: the full-screen welcome takeover (new) should include a clearly accessible link to the House Manual (existing) in its fourth frame, after the welcome warmth has been delivered. The House Manual content lives within the welcome experience but does not lead it.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "behaves-006",
      "existing_element_id": "ds-ui-2200-003",
      "similarity": "Both address counter-proposal interaction design. The existing element (Preserved-First Counter-Offer Display) shows unchanged terms first. The new element (Counter-Proposal Interaction with Common-Ground Anchoring) adds staggered rendering (host message at 200ms, common ground at 400ms, changes at 600ms) and collaborative action labels ('Accept Sarah's suggestion' instead of 'Accept counter-proposal').",
      "combined_evidence": "The existing element established the content hierarchy (preserved first). The new element adds the interaction timing and emotional framing. Combined: the preserved-first content hierarchy (existing) is delivered through a staggered rendering sequence (new) where human warmth arrives first, followed by agreement, followed by adjustment. The interaction labels use collaborative language throughout.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "looks-002",
      "existing_element_id": "ds-ui-0900-003",
      "similarity": "Both address listing card visual design for search. The existing element specifies card layout with schedule-fit as the primary signal. The new element (Rich Listing Card Visual System) adds a layered visual surface with photo carousel, neighborhood identity layer, availability signal, and progressive hover enhancement -- all designed to maximize peak probability per impression.",
      "combined_evidence": "The existing element determines the content priority (schedule fit first). The new element provides the visual system for delivering multi-layer content without clutter. Combined: schedule-fit data (existing) should be integrated into the new element's secondary zone alongside neighborhood identity, with the photo carousel as the primary zone and availability/actions as the tertiary zone revealed on hover.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "looks-006",
      "existing_element_id": "ds-ui-2200-003",
      "similarity": "Both address counter-proposal visual treatment. The existing element (Preserved-First Counter-Offer Display) presents unchanged terms with visual emphasis. The new element (Counter-Proposal Visual Framing: Highlight Common Ground, De-Emphasize Loss) adds a specific visual language: accent-light background for common ground, neutral ink for both columns of the comparison, no red or strikethrough, and the host's message in Instrument Serif as the emotional anchor.",
      "combined_evidence": "The existing element established the content principle (preserved first). The new element provides the production-ready visual specification. Combined: the preserved-first principle (existing) is expressed through the accent-light common-ground section (new) that appears before the neutral changes section. The visual language avoids loss framing entirely.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "feels-004",
      "existing_element_id": "ds-ui-0900-002",
      "similarity": "Both address the emotional design of the messaging moment. The existing element (Scaffolded First Contact Card) reduces messaging anxiety through structure. The new element (Human Connection: Making Messaging Feel Like the Beginning of a Relationship) adds the Two Selves emotional framing: messaging must feel like the beginning of a real correspondence, not a contact form, because the remembering self stores relationship stories more vividly than transaction stories.",
      "combined_evidence": "The existing element provides the structural scaffold (host profile, suggested questions). The new element provides the emotional specification (personal, conversational, encouraging). Combined: the scaffold (existing) should be designed with the emotional register (new) in mind -- host name everywhere, large profile photo, conversational hints rather than form labels, response displayed as dialogue rather than ticket response.",
      "recommendation": "merge"
    }
  ],
  "contradictions": [
    {
      "new_element_id": "communicates-001",
      "existing_element_id": "ds-ui-007",
      "conflict": "The existing element (Move-In House Manual with Verification Checklist) presents house rules and check-in procedures as the primary move-in content, with a verification checklist the guest should complete. The new element (Peak-First Information Hierarchy for Move-In Onboarding) explicitly states that rules and procedures must be below the fold, behind the welcome message, neighborhood essentials, and space highlights. Leading with a verification checklist contradicts the peak-first hierarchy.",
      "evidence_comparison": "The existing element draws from operational completeness: the guest needs rules and access information immediately. The new element draws from Kahneman Ch 38 (focusing illusion): whatever the guest reads first at move-in defines the space in memory. If rules lead, the space is remembered as restrictive. The tension is real: operational necessity vs. emotional peak engineering. The resolution: the welcome card leads (peak-first), with the House Manual checklist accessible one tap below -- visible, complete, but not leading.",
      "recommendation": "Adopt the new element's information hierarchy (welcome > essentials > highlights > rules) while preserving the existing element's checklist completeness. The checklist remains intact but moves from the primary to the tertiary position in the move-in information architecture. The guest finds rules when they need them; they encounter warmth when they arrive.",
      "severity": "warning"
    },
    {
      "new_element_id": "looks-001",
      "existing_element_id": "tokens-json",
      "conflict": "The new elements specify surface-warm (#fdfcfa), accent (#2d5a3d), accent-light (#e8f0eb), and Instrument Serif as the peak-moment visual language. These come from tokens.json, which uses a warm green accent palette and serif/sans/mono typographic triad. However, the production style guide (Style-guide.md) uses a purple palette (--primary-purple: #31135D, --secondary-purple: rgb(109,49,194)) and does not reference Instrument Serif or the green accent. The L8 UI elements must use the production purple palette per the run instructions.",
      "evidence_comparison": "tokens.json represents the design system's theoretical palette. Style-guide.md represents the production CSS variables. The L1-L5 elements correctly reference tokens.json for their layer-specific recommendations. The L8 UI elements must translate these into production-ready specifications using the Style-guide.md purple palette. This is the known token drift: tokens.json uses warm green; production uses purple.",
      "recommendation": "L8 UI elements will use the production purple palette (--primary-purple: #31135D, --secondary-purple: rgb(109,49,194), --bg-off-white: rgb(252,250,255)) and Google Fonts (Inter, DM Sans) as specified. The warm/narrative intent from tokens.json (surface-warm for peak moments, serif for narrative significance) will be translated to production equivalents: --bg-off-white for peak-moment warmth, DM Sans Bold for narrative emphasis where Instrument Serif was specified.",
      "severity": "warning"
    }
  ],
  "extensions": [
    {
      "new_element_id": "works-002",
      "gap_filled": "No existing element addresses the lease-end experience as a deliberate design moment. The library has booking confirmation and move-in manual but no specification for how the lease ending should be architected. The Architect the Lease Ending as a Designed Positive Finale element fills this gap with a three-phase sequence (reflection, farewell, gratitude) that creates the positive ending the peak-end rule demands for rebooking.",
      "confidence_note": "High confidence. Kahneman's peak-end rule is one of the most replicated findings in behavioral science. The absence of a designed lease ending in the library is the single largest retention gap the Two Selves lens identifies. This element addresses it directly."
    },
    {
      "new_element_id": "works-006",
      "gap_filled": "No existing element addresses duration neglect as a design consideration. The library assumes that longer engagement produces proportionally better outcomes. The Leverage Duration Neglect element introduces mid-lease check-ins and milestone celebrations that create memorable peaks during the mnemonic void of the lease middle, ensuring that longer leases produce proportionally better memories rather than being compressed into the same peak-end summary as shorter ones.",
      "confidence_note": "High confidence. Duration neglect is empirically established (Kahneman Ch 35). The mid-lease check-in and milestone markers are lightweight interventions with clear mechanisms for creating temporal anchors in the remembering self's summary."
    },
    {
      "new_element_id": "communicates-002",
      "gap_filled": "No existing element prescribes a narrative closing information architecture for lease-end. The library has forward momentum at the close (feels-006) but no specification for what information the guest encounters during the final week. The Narrative Closing Architecture for Lease-End Memory Formation element fills this gap with a three-state evolving card (reflection > farewell > gratitude) that provides the raw material for the remembering self's final evaluation.",
      "confidence_note": "High confidence. Kahneman Ch 36 establishes that vacation rebooking is 'entirely determined by the final evaluation.' The lease-end information architecture IS the final evaluation's raw material. This element addresses the highest-leverage information architecture gap in the guest journey."
    },
    {
      "new_element_id": "communicates-005",
      "gap_filled": "No existing element prescribes a narrative information layer for the active lease dashboard. The library has operational dashboard elements but no specification for how the platform creates memorable touchpoints during the adaptation phase when the guest is 'thinking less and less about it.' The Remembering-Self Narrative Architecture element fills this gap with milestone markers, reflection prompts, and contextual highlights that break duration neglect.",
      "confidence_note": "Medium-high confidence. The principle is sound (adaptation requires interruption for memory formation), but the frequency and tone of narrative touchpoints will need calibration in production. Too many become noise; too few leave the mnemonic void intact."
    },
    {
      "new_element_id": "behaves-002",
      "gap_filled": "No existing element designs the lease-end interaction sequence. The library has per-stay checkout behavior but no specification for a graduated emotional arc across the final week. The Lease-End Gratitude Sequence fills this gap with a three-phase interaction that creates an upward emotional trajectory (reflection > farewell > gratitude), mimicking the gradually improving ending that Kahneman's cold-hand experiment showed produces a preference for repeating the experience.",
      "confidence_note": "High confidence. The three-phase sequence directly implements the cold-hand experiment finding (80% of subjects chose to repeat experiences that ended with gradual improvement). The interaction timing and state management are well-specified."
    },
    {
      "new_element_id": "feels-002",
      "gap_filled": "No existing element addresses the emotional design of the lease ending for the guest journey. The library has forward momentum at the close (feels-006) for hosts, but no guest-specific specification for how the ending should feel. The Narrative Closure element fills this gap with a three-emotion arc (bittersweet anticipation > human warmth > accomplishment with forward momentum) that produces gratitude as the terminal emotion -- the emotion that most naturally produces the desire to repeat.",
      "confidence_note": "High confidence. The emotional specification is tightly coupled to the interaction design (behaves-002) and information architecture (communicates-002). All three layers align on the same three-phase arc."
    },
    {
      "new_element_id": "feels-005",
      "gap_filled": "No existing element addresses the emotional design of the active lease's daily experience. The library has depletion-aware pacing (feels-004) for hosts but no specification for how the platform should feel during 4-16 weeks of routine guest occupancy. The Quiet Contentment element fills this gap with a dual-register design: baseline reliability (invisible when working) and rare peak moments (warm and personal), ensuring the experiencing self's daily contentment is maintained while the remembering self receives strategic memorable touchpoints.",
      "confidence_note": "High confidence. Kahneman Ch 37 establishes that experienced well-being is determined by daily situation, not by the space's aesthetic qualities. The dual-register design correctly separates the experiencing self's needs (reliability) from the remembering self's needs (peaks)."
    }
  ],
  "token_compliance": {
    "new_tokens_flagged": [
      {
        "token": "surface-warm (#fdfcfa) from tokens.json for peak-moment cards",
        "issue": "tokens.json defines surface-warm but this color does not appear in Style-guide.md. The production equivalent is --bg-off-white: rgb(252,250,255). L8 UI elements will use --bg-off-white for peak-moment warmth.",
        "severity": "info"
      },
      {
        "token": "accent (#2d5a3d) from tokens.json for trust and positive signals",
        "issue": "tokens.json uses warm green; production uses purple. The production equivalent for positive signals is --secondary-purple: rgb(109,49,194) or --accent-purple: rgb(140,104,238). L8 UI elements will use the purple palette for interactive and trust signals.",
        "severity": "warning"
      },
      {
        "token": "Instrument Serif from tokens.json for narrative/peak moments",
        "issue": "Instrument Serif is not referenced in Style-guide.md. Production fonts are not explicitly listed in the CSS variables but the system uses Inter and DM Sans. L8 will use DM Sans Bold for narrative emphasis and Inter for body text, as available from Google Fonts.",
        "severity": "warning"
      },
      {
        "token": "--peak-card-shadow: 0 8px 30px rgba(26,23,20,0.10) from looks-001",
        "issue": "This shadow is defined in tokens.json as the 'lg' shadow. Production CSS does not define a named purple shadow. L8 will use a purple-tinted shadow (0 8px 30px rgba(49,19,93,0.12)) to align with the production purple palette while maintaining the elevated treatment.",
        "severity": "info"
      },
      {
        "token": "IBM Plex Mono from tokens.json for evidence/precision register",
        "issue": "IBM Plex Mono is not referenced in Style-guide.md. L8 will use Inter with tabular-nums for precision/data display instead, maintaining the semantic intent without introducing a non-production typeface.",
        "severity": "info"
      }
    ],
    "recommendation": "The L1-L5 elements correctly use tokens.json as their reference palette (warm green, serif/sans/mono triad). L8 UI elements must translate these into the production purple palette per Style-guide.md. Key translations: surface-warm -> --bg-off-white, accent green -> --secondary-purple, Instrument Serif -> DM Sans Bold, IBM Plex Mono -> Inter tabular-nums. The semantic intent (warmth for peaks, precision for data, narrative for milestones) is preserved while the visual execution aligns with production CSS."
  },
  "emotional_arc_check": {
    "journey_emotion_map": [
      {
        "phase": "discovery",
        "target_emotions": ["curiosity", "trust"],
        "source_element": "feels-003",
        "arc_note": "The guest's remembering self encounters Split Lease for the first time. The focusing illusion means the first impression IS the platform in memory. The target emotion is vivid possibility -- curiosity strong enough to produce a memorable first fragment that brings the guest back."
      },
      {
        "phase": "search",
        "target_emotions": ["excitement", "vivid_possibility"],
        "source_element": "feels-003",
        "arc_note": "The search session will be prototyped by one listing card impression. The target emotion is the 'I could live there' moment -- a peak of excited possibility that the remembering self stores as the search summary. Without this peak, the session is remembered as fruitless regardless of duration."
      },
      {
        "phase": "listing_evaluation",
        "target_emotions": ["connection", "calibrated_anticipation"],
        "source_element": "feels-004",
        "arc_note": "Messaging creates the human peak that converts the booking story from transaction to relationship. The focusing illusion must be counterbalanced by experiencing-self data (livability, reviews) to calibrate the affective forecast and reduce the move-in expectation gap."
      },
      {
        "phase": "proposal_creation",
        "target_emotions": ["confident_commitment", "grounded_optimism"],
        "source_element": "feels-003",
        "arc_note": "The guest is at peak anticipated satisfaction (Kahneman's marriage-graph spike). The 'What to expect' callout introduces experienced-utility data to ground the affective forecast. Confidence must be real, not illusory -- grounded in what past guests reported, not just in beautiful photos."
      },
      {
        "phase": "negotiation",
        "target_emotions": ["collaboration", "mutual_accommodation"],
        "source_element": "feels-006",
        "arc_note": "Loss aversion threatens to convert the counter-proposal into a rejection peak. The emotional design redirects the focusing illusion from loss (changed terms) to relationship (host's warm message) and agreement (common ground). The target emotion is 'we worked it out' rather than 'they rejected me.'"
      },
      {
        "phase": "acceptance",
        "target_emotions": ["relief", "narrative_resolution"],
        "source_element": "feels-002",
        "arc_note": "Acceptance is the climax of the booking story. It must feel like a story resolving, not a form submitting. The peak-end rule means this moment is the 'end' of the pre-lease journey and must be positive to create a halo that protects against early move-in disappointments."
      },
      {
        "phase": "move_in",
        "target_emotions": ["delight", "belonging"],
        "source_element": "feels-001",
        "arc_note": "The single most consequential emotional moment in the entire guest journey. The peak-end rule means this peak will define the lease memory. Every sensation is at maximum intensity due to novelty and contrast. The welcome card must direct the focusing illusion toward warmth (host message, neighborhood orientation) before any negative detail is noticed."
      },
      {
        "phase": "active_lease",
        "target_emotions": ["contentment", "punctuated_reflection"],
        "source_element": "feels-005",
        "arc_note": "Dual-register emotional design: baseline contentment (invisible reliability) punctuated by rare narrative peaks (milestones, check-ins). The ending must be a graduated positive arc (reflection > farewell > gratitude) that produces the warm final evaluation the peak-end rule demands for rebooking."
      }
    ],
    "arc_conflicts": [
      {
        "conflict": "The transition from acceptance (relief/resolution) to move-in (delight/belonging) has a temporal gap of days to weeks. During this gap, the guest's anticipation may inflate expectations beyond what the space delivers, widening the affective forecasting gap. The pre-arrival message (24 hours before check-in) partially bridges this gap, but there is no designed emotional touchpoint between acceptance and the pre-arrival message.",
        "phases_affected": ["acceptance", "move_in"],
        "severity": "warning"
      },
      {
        "conflict": "The active_lease phase must produce both baseline contentment (experiencing self) and memorable peaks (remembering self), but the existing library has no guest-specific active-lease emotional element. The new feels-005 fills this gap, but its interaction with the lease-end gratitude sequence (feels-002) needs careful calibration: the mid-lease check-in response must be stored and surfaced in the gratitude card, creating a narrative through-line from middle to end.",
        "phases_affected": ["active_lease"],
        "severity": "info"
      }
    ],
    "arc_assessment": "The emotional arc is coherent and well-grounded in Kahneman's Two Selves framework. The progression from curiosity (discovery) through excitement (search), connection (listing evaluation), confident commitment (proposal), collaboration (negotiation), narrative resolution (acceptance), delight (move-in), and contentment-with-peaks (active lease) follows the natural emotional trajectory of someone finding, committing to, and living in a new space. The two critical moments -- move-in peak and lease-end finale -- receive the strongest emotional specification, correctly reflecting the peak-end rule's prediction that these two moments determine the retrospective evaluation. One gap: the acceptance-to-move-in transition needs additional emotional bridging beyond the pre-arrival message."
  },
  "coverage_map": {
    "discovery": {
      "elements_addressing": ["works-003 (listing cards for peak generation)", "communicates-003 (listing card info design)", "looks-002 (rich listing card visual system)", "looks-005 (neighborhood visual language)", "feels-003 (vivid possibility in search)"],
      "coverage_assessment": "Adequate. Discovery is addressed through the listing card and search elements, which create the first impression peaks the remembering self stores. No dedicated discovery-phase element exists because the Two Selves lens identifies that discovery's impact is through the quality of the first listing card encountered, which is addressed by the search elements.",
      "gaps": "No dedicated discovery landing page element. The focusing illusion means the first non-listing impression (landing page, hero section) also matters. The existing library's Platform Identity Hero Section partially addresses this."
    },
    "search": {
      "elements_addressing": ["works-003", "communicates-003", "communicates-004", "looks-002", "looks-005", "behaves-003", "feels-003"],
      "coverage_assessment": "Strong. Seven elements across five layers address search, reflecting the Two Selves insight that the search session's prototypical impression determines return behavior. The photo carousel, neighborhood identity, availability signal, and progressive hover enrichment together maximize peak probability per card.",
      "gaps": "No explicit end-of-search design. The peak-end rule means the last card viewed matters as much as the best card. A 'Based on what caught your eye' re-surfacing section at end-of-results would address this."
    },
    "listing_evaluation": {
      "elements_addressing": ["works-004", "works-005", "communicates-003", "communicates-004", "communicates-006", "looks-003", "behaves-004", "feels-004"],
      "coverage_assessment": "Strong. Eight elements address listing evaluation, reflecting the critical role of the focusing illusion and affective forecasting at this phase. The dual-track listing page layout (remembering-self aesthetic + experiencing-self livability) is the key innovation.",
      "gaps": "None significant. The messaging integration, livability data layer, and review promotion together counterbalance the focusing illusion's bias toward photos."
    },
    "proposal_creation": {
      "elements_addressing": ["works-004", "works-005", "works-006", "communicates-006", "looks-003", "feels-003"],
      "coverage_assessment": "Adequate. Six elements address the proposal moment, with the 'What to expect' callout and narrative duration framing as the key innovations for calibrating the affective forecast.",
      "gaps": "No dedicated proposal form visual or interaction element. The existing library's Structured Proposal Composer and Natural-Language Stay Configurator partially address this, but neither incorporates the affective forecast calibration."
    },
    "negotiation": {
      "elements_addressing": ["works-004", "communicates-006", "looks-006", "behaves-006", "feels-006"],
      "coverage_assessment": "Strong. Five elements across five layers address negotiation, reflecting the critical importance of loss aversion management. The common-ground-first hierarchy, host message prominence, and collaborative action labels together convert the negotiation from a loss event into a relationship event.",
      "gaps": "None significant. The negotiation design is one of the most thoroughly specified aspects of this run."
    },
    "acceptance": {
      "elements_addressing": ["works-001 (pre-arrival peak priming)", "communicates-001 (peak-first hierarchy begins at acceptance)", "feels-002 (narrative resolution)"],
      "coverage_assessment": "Adequate but thin. Acceptance is addressed as the end of the pre-lease narrative and the beginning of the move-in peak preparation. The existing library's Booking Confirmation with Next-Steps Roadmap provides the operational specification.",
      "gaps": "No dedicated acceptance celebration element from the Two Selves lens. The existing library element covers the operational need, but the peak-end rule suggests acceptance needs stronger emotional marking as the 'ending' of the booking story."
    },
    "move_in": {
      "elements_addressing": ["works-001", "communicates-001", "communicates-002", "looks-001", "behaves-001", "feels-001"],
      "coverage_assessment": "Very strong. Six elements across all five layers address move-in, reflecting the Two Selves lens's identification of move-in as the single most consequential moment in the guest journey. The welcome card takeover, peak-first information hierarchy, and designed delight together engineer a positive peak that anchors the lease memory.",
      "gaps": "None. Move-in has the most comprehensive cross-layer coverage in the run."
    },
    "active_lease": {
      "elements_addressing": ["works-002", "works-006", "communicates-002", "communicates-005", "looks-001", "looks-004", "behaves-002", "behaves-005", "feels-002", "feels-005"],
      "coverage_assessment": "Very strong. Ten elements address the active lease phase, reflecting its dual nature: baseline experiencing-self contentment plus remembering-self peak engineering. The lease-end gratitude sequence, mid-lease check-in, milestone markers, and narrative dashboard layer together combat duration neglect and engineer the positive ending the peak-end rule demands.",
      "gaps": "No specification for handling negative peaks during active lease (disputes, maintenance issues, payment problems). The existing library's notification-as-continuation element partially addresses this, but a dedicated negative-peak mitigation element would strengthen coverage."
    }
  }
}