{
  "lens": {
    "guest_call": "Sophie Charvet - 18 April 2022.txt",
    "book_extract": "nudge-choice-architecture.txt",
    "lens_summary": "This lens reveals how a guest with a mismatched need (short-term, immediate housing for a visiting family member) encounters a platform whose choice architecture fails to qualify, redirect, or retain her before the human-agent call — exposing critical gaps in discovery-phase filtering, stimulus-response compatibility in service messaging, and the absence of smart defaults for ineligible prospects."
  },
  "phases": {
    "discovery": {
      "what_this_lens_reveals": "Sophie found Split Lease through some channel (not specified in the transcript) and called in with a specific, time-sensitive need: a one-month apartment in New York for a visiting family member, needed 'almost next week.' The call reveals that nothing in the discovery experience communicated Split Lease's minimum commitment (6 weeks) or minimum lead time (3 weeks) before Sophie invested the effort of making a phone call. The Nudge chapter on Stimulus-Response Compatibility directly applies: the signals Sophie received during discovery (whatever led her to call) were incompatible with the actual service constraints. She received a stimulus that said 'flexible housing' but the required response was '6-week minimum commitment with 3 weeks lead time.' This is the equivalent of Thaler's door handles that say 'pull' when you need to push. The Make It Easy principle is also violated in reverse: the platform made it easy for an ineligible prospect to reach a human agent, wasting both parties' time, instead of making it easy for her to self-qualify or self-disqualify before calling.",
      "user_state": {
        "emotional_state": "Urgent and purposeful — Sophie has a concrete, time-bound need (family member visiting in May). She is not browsing; she is trying to solve a problem quickly.",
        "knowledge_level": "Very low — Sophie does not understand Split Lease's co-tenancy model, minimum commitment, or lead time requirements. She appears to think it is a standard short-term rental service.",
        "commitment_level": "Ready to act for the wrong service — she has a real need and is willing to commit to a one-month rental, but this does not match what Split Lease offers.",
        "data_available": "Only that she found Split Lease through some external channel and called in. No website interaction is described. She is looking on behalf of a family member, not for herself."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Service constraints (6-week minimum, 3-week lead time) are invisible during discovery, causing 100% dropout for short-term seekers who reach the call stage",
          "No self-qualification mechanism exists before the call — the guest cannot determine eligibility without human interaction",
          "The guest is acting as a proxy for the actual user (a visiting family member), adding a layer of indirection that makes the mismatch harder to catch"
        ],
        "evidence": "Sophie Charvet call, 0:26-1:00: 'I need to understand how I can help you the best, because you mentioned something because you need it almost next week and, uh, zap something too quick. I don't think we can help you with anything, um, before like three weeks. So is that the minimum commitment we require is minimum six weeks after that?' — The agent must manually explain constraints that should have been surfaced before the call."
      },
      "key_quotes": [
        {
          "source": "Sophie Charvet - 18 April 2022.txt, 0:26-1:00",
          "quote": "I need to understand how I can help you the best, because you mentioned something because you need it almost next week and, uh, zap something too quick. I don't think we can help you with anything, um, before like three weeks. So is that the minimum commitment we require is minimum six weeks.",
          "relevance": "Reveals that the core service constraints — minimum lead time and minimum commitment duration — are only communicated during the human call, not during discovery. This is a stimulus-response incompatibility: the discovery signal says 'we can help with housing' but the actual requirement is '6 weeks minimum, 3 weeks from now.'"
        },
        {
          "source": "nudge-choice-architecture.txt, Stimulus-Response Compatibility section",
          "quote": "The idea is that you want the signal you receive (the stimulus) to be consistent with the desired action. When there are inconsistencies, performance suffers and people blunder.",
          "relevance": "Directly explains why Sophie called: the discovery-phase signals she received were inconsistent with the actual service requirements. The stimulus (flexible housing platform) was incompatible with the required response (commit to 6+ weeks with 3 weeks lead time)."
        },
        {
          "source": "nudge-choice-architecture.txt, Make It Easy section",
          "quote": "Often we can do more to facilitate good behavior by removing some small obstacle than by trying to shove people in a certain direction.",
          "relevance": "The platform should remove the obstacle of ambiguity about eligibility. A simple upfront qualifier (minimum stay, lead time) would channel eligible guests forward and ineligible guests to alternatives — facilitating good behavior for both segments."
        }
      ]
    },
    "search": {
      "what_this_lens_reveals": "This lens reveals a complete absence of the search phase for this guest. Sophie never reached the search phase because she called directly (or was routed to a call) without browsing listings. However, the Nudge chapter on Structure Complex Choices and Understanding Mappings reveals what the search phase should do for guests like Sophie: help them quickly map their needs (duration, timing, flexibility) onto the platform's actual offerings. Tversky's 'elimination by aspects' strategy — where people set cutoff criteria and eliminate non-matching options — is exactly what a well-designed search would enable. Sophie's minimum cutoff (one month, starting almost immediately) would have eliminated all Split Lease options instantly if surfaced in a search interface, saving her the call entirely. The absence of this filtering mechanism means the platform relies entirely on human agents to perform the qualification that choice architecture should handle automatically.",
      "user_state": {
        "emotional_state": "Not reached — Sophie bypassed search entirely and went straight to a phone call.",
        "knowledge_level": "Zero familiarity with available listings or the co-tenancy model.",
        "commitment_level": "Would have been high if matching options existed — she had a concrete need and was ready to act.",
        "data_available": "No search behavior data exists for this guest. She never interacted with the listing inventory."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "The search phase was entirely skipped, meaning no automated qualification occurred",
          "If Sophie had searched, the lack of short-term (under 6-week) options with immediate availability would have produced zero results with no explanation of why",
          "Without guidance on what the platform does offer, an empty search result is indistinguishable from a broken or empty platform"
        ],
        "evidence": "Sophie Charvet call, 1:09: 'this was just, uh, for the month of may actually. Um, And, And, uh, yeah, it could have been flexible for earlier than that, but not, not beyond, uh, the end of may' — Her search criteria (1 month, May only) would have returned zero results on the platform. The Nudge chapter on Structure Complex Choices (paint store example) shows that presenting options without structure causes worse outcomes — but presenting zero options with no explanation is even worse."
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Structure Complex Choices section",
          "quote": "Someone using this strategy first decides what aspect is most important (say, commuting distance), establishes a cutoff level (say, no more than a thirty-minute commute), then eliminates all the alternatives that do not come up to this standard.",
          "relevance": "Sophie's decision process follows Tversky's elimination by aspects: her cutoffs are duration (one month) and timing (May). A well-designed search would let her apply these cutoffs and immediately see that no options match — with an explanation of what would match and when."
        },
        {
          "source": "nudge-choice-architecture.txt, Structure Complex Choices section",
          "quote": "As alternatives become more numerous and more complex, choice architects have more work to do, and are much more likely to influence choices (for better or for worse).",
          "relevance": "When the choice set is zero (no matches), the choice architect's work is to redirect, not abandon. The platform should structure the 'no results' experience to educate about what would match, not leave the guest with a dead end."
        }
      ]
    },
    "listing_evaluation": {
      "what_this_lens_reveals": "This lens does not directly address the listing evaluation phase. Sophie never reached a specific listing because her need was disqualified at the discovery/call stage. However, the Nudge chapter on Understanding Mappings is highly relevant to what listing evaluation should accomplish: helping guests map listing attributes (photos, price, rules, schedule, co-tenancy arrangement) onto their actual living experience. The book's ice cream vs. medical treatment comparison applies: choosing an ice cream flavor is easy because the mapping between choice and outcome is direct, but choosing a shared living arrangement is complex because the guest must predict what it will be like to share a space on a split schedule — an experience most have never had. The platform needs to make this unfamiliar mapping comprehensible, much like the free taste at the ice cream shop.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached — Sophie never evaluated a specific listing.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Even if Sophie had reached this phase, the co-tenancy model is inherently unfamiliar and the mapping from listing description to lived experience is opaque",
          "The concept of sharing a space with a complementary-schedule stranger requires explanation that a standard listing page may not provide"
        ],
        "evidence": "Sophie Charvet call, 2:10-2:33: 'the way we do it with the two people was complimentary schedule. So let's say for example, somebody needs Monday through Friday and somebody else needs Friday. So Monday they become, goes to amaze, which use the same space, but in different timeframes.' — The agent's verbal explanation of the co-tenancy model is itself convoluted and hard to follow. A listing page must make this mapping far clearer than a phone explanation does."
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Understanding Mappings section",
          "quote": "A good system of choice architecture helps people to improve their ability to map choices onto outcomes and hence to select options that will make them better off. One way to do this is to make the information about various options more comprehensible, by transforming numerical information into units that translate more readily into actual use.",
          "relevance": "The co-tenancy model requires guests to mentally translate 'Monday through Friday' and 'shared space, different timeframes' into a concrete living arrangement. Listing evaluation should transform this abstract model into visual, concrete representations — calendars showing which days are theirs, photos showing the space in 'their' configuration."
        },
        {
          "source": "Sophie Charvet - 18 April 2022.txt, 2:10-2:33",
          "quote": "The way we do it with the two people was complimentary schedule. So let's say for example, somebody needs Monday through Friday and somebody else needs Friday. So Monday they become, goes to amaze, which use the same space, but in different timeframes.",
          "relevance": "Even the human agent struggles to explain the co-tenancy mapping clearly. If a trained agent fumbles the explanation, a listing page must be designed with extreme clarity to make this unfamiliar model comprehensible."
        }
      ]
    },
    "proposal_creation": {
      "what_this_lens_reveals": "This lens does not directly address the proposal creation phase. Sophie was disqualified before reaching this stage. However, the Nudge chapter on Defaults is deeply relevant. When a guest creates a proposal, they must configure dates, duration, and days per week — a complex set of choices. The book argues that 'many people will take whatever option requires the least effort, or the path of least resistance,' and that 'if, for a given choice, there is a default option — an option that will prevail if the chooser does nothing — then we can usually expect a large number of people to end up with that option.' This means the proposal creation form should offer smart defaults (e.g., pre-populated based on the guest's search criteria, common configurations for the listing type) rather than presenting a blank form. The book also discusses 'required choice' vs. 'prompted choice' — the proposal form should use prompted choice with sensible defaults rather than forcing guests to configure every parameter from scratch.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Configuring a proposal for an unfamiliar co-tenancy arrangement without defaults increases cognitive load and dropout risk",
          "Guests who have never experienced split-schedule living cannot easily determine the right configuration without guidance"
        ],
        "evidence": "nudge-choice-architecture.txt, Defaults section: 'Most users do not want to have to read an incomprehensible manual to determine which arcane setting to select. When choice is complicated and difficult, people might greatly appreciate a sensible default.' — Proposal creation for co-tenancy is exactly this kind of complicated choice."
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Defaults section",
          "quote": "Many people will take whatever option requires the least effort, or the path of least resistance. Recall the discussion of inertia, status quo bias, and the 'yeah, whatever' heuristic. All these forces imply that if, for a given choice, there is a default option — an option that will prevail if the chooser does nothing — then we can usually expect a large number of people to end up with that option.",
          "relevance": "Proposal creation must leverage defaults to guide guests toward viable configurations. Without defaults, guests face a blank-slate problem that triggers inertia and abandonment."
        },
        {
          "source": "nudge-choice-architecture.txt, Defaults section",
          "quote": "The choice architect can force the choosers to make their own choice! This approach has various names, including 'required choice,' 'mandated choice,' and 'active choosing.'... required choosing is often more appropriate for simple yes-or-no decisions than it is for more complex choices.",
          "relevance": "Proposal creation is a complex, multi-parameter choice. Required choice (blank form, fill everything) is inappropriate. Prompted choice with sensible defaults is better."
        }
      ]
    },
    "negotiation": {
      "what_this_lens_reveals": "This lens does not directly address the negotiation phase. Sophie never created a proposal, so no negotiation occurred. However, the Nudge chapter on Give Feedback is relevant. During negotiation, the host may counter a proposal, and the guest must evaluate modified terms. The book states that 'an excellent way to help Humans improve their performance is to provide feedback' and warns that 'warning systems have to avoid the problem of offering so many warnings that they are ignored.' The negotiation phase should provide clear, actionable feedback about what changed in a counter-proposal, why it changed, and what the implications are for the guest — without overwhelming the guest with information. The chapter on Expect Error also applies: guests may accidentally reject or misunderstand counter-proposals, and the system should be forgiving of such errors.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Counter-proposals introduce new terms that may confuse guests unfamiliar with the co-tenancy model",
          "Without clear feedback about what changed and why, guests may interpret a counter as rejection rather than negotiation"
        ],
        "evidence": "nudge-choice-architecture.txt, Give Feedback section: 'An excellent way to help Humans improve their performance is to provide feedback. Well-designed systems tell people when they are doing well and when they are making mistakes.' — Negotiation requires feedback that distinguishes 'the host wants to adjust terms' from 'the host rejected you.'"
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Give Feedback section",
          "quote": "Warning systems have to avoid the problem of offering so many warnings that they are ignored. If our computer constantly nags us about whether we are sure we want to open that attachment, we begin to click 'yes' without thinking about it.",
          "relevance": "Negotiation feedback must be meaningful and specific — not generic warnings. Each counter-proposal should highlight exactly what changed and what the guest needs to decide, without burying the signal in noise."
        },
        {
          "source": "nudge-choice-architecture.txt, Expect Error section",
          "quote": "Humans make mistakes. A well-designed system expects its users to err and is as forgiving as possible.",
          "relevance": "In negotiation, a guest might accidentally decline a counter-proposal or misunderstand the terms. The system should allow easy reversal of errors and clearly confirm consequential actions before they become final."
        }
      ]
    },
    "acceptance": {
      "what_this_lens_reveals": "This lens does not directly address the acceptance phase. Sophie's call ended before any engagement with the platform. However, the Nudge chapter on Expect Error is particularly relevant to acceptance — the moment when payment is authorized and lease documents are sent. The book's discussion of 'postcompletion errors' (forgetting the gas cap after refueling, leaving the ATM card after getting cash) applies directly: after the high-effort decision to accept terms, the guest may neglect critical follow-up steps (reading lease documents, confirming payment details, noting move-in instructions). The system should use forcing functions to ensure these steps are completed, not rely on the guest remembering to do them after the emotional relief of reaching agreement.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Postcompletion errors: after the relief of reaching agreement, guests may neglect critical steps like reviewing lease terms or confirming payment",
          "The acceptance moment is emotionally charged and cognitively depleting, increasing error rates"
        ],
        "evidence": "nudge-choice-architecture.txt, Expect Error section: 'Leaving the gas cap behind is a special kind of mistake psychologists call a postcompletion error. The idea is that when you have finished your main task, you tend to forget things relating to previous steps.' — Acceptance is a postcompletion moment: the main task (finding and agreeing to housing) feels complete, but critical details (lease review, payment confirmation, move-in prep) still need attention."
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Expect Error section",
          "quote": "Another strategy, suggested by Don Norman, is to use what he calls a 'forcing function,' meaning that in order to get what you want, you have to do something else first. So if you have to remove the card in order to get your cash, you will not forget to do so.",
          "relevance": "Acceptance should include forcing functions: the guest cannot proceed to move-in without confirming they have read the lease, acknowledged house rules, and verified payment details. This prevents postcompletion errors at a high-stakes transition."
        }
      ]
    },
    "move_in": {
      "what_this_lens_reveals": "This lens does not directly address the move-in phase from Sophie's experience. However, the Nudge chapter on Stimulus-Response Compatibility and Give Feedback are highly relevant. Move-in is where the guest's mental model of the co-tenancy arrangement meets physical reality. The stimulus-response principle applies: every physical signal in the space (key handoff procedure, storage areas, shared vs. private zones) must be compatible with the guest's expectations set during listing evaluation. If the listing showed a private bedroom but the guest arrives to find ambiguous shared spaces, that is the equivalent of a door handle that says 'pull' when you need to push. The Give Feedback principle applies to the House Manual and check-in procedures: the guest needs clear, real-time confirmation that they are doing the right things (arrived at the right time, using the right entrance, following the right procedures) rather than discovering errors after the fact.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "First physical encounter with the co-tenancy arrangement may produce stimulus-response conflicts if the space does not match the listing's implied promise",
          "Without real-time feedback during check-in, guests may make errors (wrong entrance, wrong storage area) that create negative first impressions",
          "The 'Look Right!' principle from the London crosswalks chapter applies: guests entering an unfamiliar arrangement need prominent, context-specific guidance at the exact moment of potential error"
        ],
        "evidence": "nudge-choice-architecture.txt, Stimulus-Response Compatibility: 'Those doors are bad architecture because they violate a simple psychological principle... stimulus response compatibility. The idea is that you want the signal you receive (the stimulus) to be consistent with the desired action.' — At move-in, every physical and digital signal must be consistent with the guest's expected action. The House Manual must function like London's 'Look Right!' signs — placed exactly where errors are likely to occur."
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Expect Error, London crosswalks example",
          "quote": "The city of London tries to help with good design. On many corners, especially in neighbourhoods frequented by tourists, the pavement has signs that say, 'Look right!'",
          "relevance": "Move-in guidance should follow the 'Look Right!' pattern: place guidance at the exact point of potential error. Key handoff instructions at the door, storage labels on shelves, schedule reminders in the shared space calendar — all positioned where the guest will encounter them at the moment of decision."
        },
        {
          "source": "nudge-choice-architecture.txt, Give Feedback section",
          "quote": "Well-designed systems tell people when they are doing well and when they are making mistakes.",
          "relevance": "The move-in experience should confirm correct actions (check-in photo submitted, arrival notification sent) with positive feedback, not just flag errors. This builds confidence in a novel living arrangement."
        }
      ]
    },
    "active_lease": {
      "what_this_lens_reveals": "This lens does not directly address the active lease phase from Sophie's experience. However, the Nudge chapter on Incentives and its concept of salience is directly relevant to the ongoing lease experience. The book asks 'Who chooses? Who uses? Who pays? Who profits?' — in the co-tenancy model, the guest chooses the arrangement, the guest and a co-tenant both use the space, the guest pays Split Lease which pays the host, and all three parties (guest, host, platform) profit. This multi-party incentive structure means misalignment is likely: the guest's incentive is comfort and flexibility, the host's is reliable income and property care, and the platform's is retention and fee collection. The salience principle is also critical: during active lease, the salient costs are per-stay (cleaning, arrival hassle, schedule constraints) while the benefits (lower cost than solo rental, flexibility) are diffuse and less salient. The Date Change Tool, cleaning photos, and stay reviews mentioned in the journey definition are all opportunities to make the benefits of the arrangement more salient relative to the per-interaction costs.",
      "user_state": {
        "emotional_state": "Not reached.",
        "knowledge_level": "Not reached.",
        "commitment_level": "Not applicable.",
        "data_available": "None for this guest at this phase."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Per-stay friction (cleaning photos, arrival notifications, schedule coordination) is highly salient, while the ongoing benefit (affordable flexible housing) is diffuse and easy to take for granted",
          "Incentive misalignment between guest comfort and platform processes (documentation requirements) could erode satisfaction over time",
          "The 'taxi meter' effect from the Incentives chapter: every per-stay action makes the cost of the arrangement salient, while the savings vs. alternatives are invisible"
        ],
        "evidence": "nudge-choice-architecture.txt, Incentives section: 'every time the family uses a taxi, the cost will be in their face, with the meter clicking every few blocks. So a behavioral analysis of the incentives of car ownership will predict that people will underweight the opportunity costs of car ownership and possibly other less salient aspects... and may overweight the very salient costs of using a taxi.' — Per-stay tasks (cleaning photos, check-in notifications) are the 'taxi meter' of co-tenancy. The ongoing savings are the invisible 'car ownership cost.'"
      },
      "key_quotes": [
        {
          "source": "nudge-choice-architecture.txt, Incentives section",
          "quote": "The most important modification that must be made to a standard analysis of incentives is salience. Do choosers actually notice the incentives they face?",
          "relevance": "During active lease, the platform must make the benefits of co-tenancy salient — not just the obligations. Monthly savings summaries, schedule flexibility confirmations, and positive host reviews all serve to counterbalance the salient per-stay friction costs."
        },
        {
          "source": "nudge-choice-architecture.txt, Incentives section",
          "quote": "Who chooses? Who uses? Who pays? Who profits?",
          "relevance": "The co-tenancy model separates these four roles across guest, co-tenant, host, and platform. Each active lease interaction should align these incentives visibly: when the guest sends cleaning photos, the feedback should show how this protects their deposit and builds their reputation — not just that it is a platform requirement."
        }
      ]
    }
  },
  "cross_phase_patterns": [
    {
      "pattern": "Stimulus-Response Incompatibility Between Platform Messaging and Actual Service Constraints",
      "phases_affected": ["discovery", "search", "listing_evaluation", "move_in"],
      "evidence": "Sophie Charvet call, 0:26-1:09: Sophie's expectation (short-term rental, immediate availability) was completely incompatible with the actual service (6-week minimum, 3-week lead time). This incompatibility was only revealed during a human phone call — not through any automated choice architecture. Nudge, Stimulus-Response Compatibility: 'you want the signal you receive (the stimulus) to be consistent with the desired action. When there are inconsistencies, performance suffers and people blunder.' This pattern recurs: at discovery (messaging doesn't signal constraints), at search (filters don't surface eligibility), at listing evaluation (co-tenancy model is unfamiliar and unexplained), and at move-in (physical space signals may conflict with listing promises)."
    },
    {
      "pattern": "Absence of Smart Defaults Forces Every Guest to Start from Zero",
      "phases_affected": ["search", "proposal_creation", "negotiation", "active_lease"],
      "evidence": "Nudge, Defaults section: 'many people will take whatever option requires the least effort, or the path of least resistance.' Sophie's call shows no pre-qualification defaults existed — she had to call a human to discover basic eligibility. This absence of defaults applies across the journey: search has no pre-set filters based on stated need, proposal creation has no default configurations based on listing norms, negotiation has no default acceptance terms, and active lease has no default schedule templates. Each phase forces the guest to construct their choices from scratch rather than adjusting sensible defaults."
    },
    {
      "pattern": "No Error Recovery Path for Ineligible or Mismatched Prospects",
      "phases_affected": ["discovery", "search", "listing_evaluation"],
      "evidence": "Sophie Charvet call, 1:25-1:38: 'That's unfortunate that we cannot help you... if you ever need something in this type of arrangement, but it was a little more lead time. We'll be happy to help you.' The agent offers a polite verbal redirect, but there is no systematic mechanism to capture Sophie's future need, redirect her to appropriate alternatives, or re-engage her when she might qualify. Nudge, Expect Error: 'A well-designed system expects its users to err and is as forgiving as possible.' The 'error' here is not Sophie's — it is the system's failure to expect that ineligible prospects will arrive and to design a forgiving path (redirect, future notification, referral to appropriate services) rather than a dead end."
    },
    {
      "pattern": "The Proxy Guest Problem — Choosing on Behalf of Another",
      "phases_affected": ["discovery", "search", "listing_evaluation", "proposal_creation"],
      "evidence": "Sophie Charvet call, 3:07: 'I know this, this was just for a family member who was visiting me in New York for a ma. So I won't read that myself.' Sophie is not the end user — she is searching on behalf of a visiting family member. The Nudge chapter on Incentives asks 'Who chooses? Who uses?' — when the chooser and the user are different people, mappings become harder (the chooser cannot taste the ice cream) and defaults become more important (the chooser cannot evaluate subjective fit). This proxy-guest pattern likely recurs: corporate travel arrangers, family members, relocation agents all may search on behalf of the actual guest, creating a systematic mismatch between chooser knowledge and user needs."
    },
    {
      "pattern": "Channel Factor Friction — Small Obstacles That Block the Entire Journey",
      "phases_affected": ["discovery", "search", "proposal_creation", "acceptance"],
      "evidence": "Nudge, Make It Easy / Channel Factors: 'Lewin argued that similarly tiny factors can create surprisingly strong inhibitors to behavior that people want to take. Often we can do more to facilitate good behavior by removing some small obstacle than by trying to shove people in a certain direction.' The tetanus shot study showed 28% uptake vs. 3% when students were given a map and asked to plan their route — even though they knew where the health center was. In Sophie's journey, the small obstacles are: (1) no upfront eligibility check at discovery, (2) no search filter for minimum commitment, (3) no default proposal templates, (4) no redirect mechanism for ineligible prospects. Each is a tiny channel factor that, if removed, would either qualify the right guests faster or gracefully exit the wrong ones."
    },
    {
      "pattern": "Salience Asymmetry — Costs Are Visible, Benefits Are Invisible",
      "phases_affected": ["proposal_creation", "active_lease"],
      "evidence": "Nudge, Incentives / Salience section: 'every time the family uses a taxi, the cost will be in their face, with the meter clicking every few blocks.' In the co-tenancy model, per-interaction costs (cleaning photos, arrival notifications, schedule coordination, proposal configuration effort) are highly salient because they require active effort at specific moments. The benefits (lower cost than solo rental, schedule flexibility, guaranteed housing) are diffuse and chronic — easy to take for granted. This salience asymmetry means the arrangement can feel burdensome even when it is objectively advantageous, increasing dropout risk during active lease and discouraging proposal creation for new prospects."
    }
  ],
  "sources_consulted": [
    "Sophie Charvet - 18 April 2022.txt — Full guest call transcript. Extracted: service constraint mismatch (6-week minimum, 3-week lead time vs. 1-month need), proxy guest pattern (searching for family member), agent's verbal explanation of co-tenancy model, absence of pre-qualification, polite dead-end for ineligible prospect.",
    "nudge-choice-architecture.txt — Full book extract, Chapter 5: Choice Architecture. Extracted: Stimulus-Response Compatibility principle (signals must match desired actions), Make It Easy / Channel Factors (small obstacles block behavior), Defaults (path of least resistance dominates, smart defaults vs. required choice), Expect Error (postcompletion errors, forcing functions, forgiving design), Give Feedback (timely, specific feedback improves performance), Understanding Mappings (help people map choices to outcomes), Structure Complex Choices (elimination by aspects, collaborative filtering, winnowing), Incentives (salience of costs vs. benefits, Who chooses/uses/pays/profits).",
    "journey-types.json — Guest journey phase definitions. Used to map transcript evidence and book principles to the correct phase vocabulary: discovery, search, listing_evaluation, proposal_creation, negotiation, acceptance, move_in, active_lease.",
    "library/elements.json — Existing element library (18,500+ lines, 250+ elements). Consulted to understand existing coverage. Noted: strong coverage of host journey phases (discovery through retention), emerging guest journey coverage. This lens adds unique perspective on ineligible-prospect handling, proxy-guest patterns, and stimulus-response compatibility in service messaging — areas not well covered by existing elements."
  ]
}