{
  "lens": {
    "guest_call": "Susan  Bryant customer call.txt",
    "book_extract": "donnorman-affordances-signifiers-feedback.txt",
    "lens_summary": "This lens reveals that Susan's guest journey is dominated by missing signifiers — the platform fails to communicate what actions are possible, what the service actually is, and how trust can be verified — forcing a human intermediary (Bryant) to serve as the primary signifier for a system whose image is incoherent to first-time users."
  },
  "phases": {
    "discovery": {
      "what_this_lens_reveals": "Susan's discovery of Split Lease is entirely mediated by Bryant, not by the platform. She never encounters the platform's system image during discovery. When she does encounter Bryant, she misidentifies him as a real estate agent (4:55: 'Real estate Agent'). Bryant must correct her: 'I actually work for a company called Split Lease.' This reveals a catastrophic system image failure at discovery: the platform's identity, purpose, and operational model are invisible. Norman's principle of discoverability requires that it be possible to figure out what actions are possible and where and how to perform them. Susan cannot even figure out what the service IS, let alone what actions it affords. The platform has no signifiers that communicate 'we are a schedule-native housing platform for non-continuous stays' in a way a first-time user can perceive without human translation.",
      "user_state": {
        "emotional_state": "Proactive but cautious. Susan initiated the call, indicating motivation, but her tone throughout reveals vigilance about legitimacy ('you know how sometimes people give you all kind of run around,' 2:22). She is a protector acting on behalf of a friend, which amplifies her risk sensitivity.",
        "knowledge_level": "Near zero about Split Lease. Susan does not understand the non-continuous nights model (she asks 'is it a full apartment or is it a bedroom?' at 0:43, and Bryant must explain the part-of-week concept twice). She conflates Split Lease with a real estate brokerage.",
        "commitment_level": "Browsing on behalf of a friend. Susan is exploring options but has not committed to the platform or even to this listing. She explicitly says 'I can have her stay with another friend of mine' (0:43) — she has alternatives.",
        "data_available": "Only what Susan volunteered on the call: she is booking for a friend from Oregon, timeline is 1-2 months, weekday preference Monday-Friday, and the friend has medical appointments that Susan is coordinating."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Susan misidentifies the service as a real estate brokerage — if Bryant were not on the call to correct this, she would have formed a completely wrong conceptual model",
          "The platform itself is never mentioned during discovery — Susan's only signifier for the service is Bryant himself",
          "Susan has an explicit alternative ('I can have her stay with another friend of mine') and will use it if the platform feels illegitimate",
          "Norman: 'When the system image is incoherent or inappropriate, then the user cannot easily use the device' — the system image at discovery IS incoherent because it does not exist independently of Bryant"
        ],
        "evidence": "Susan at 4:55: 'Real estate Agent.' Bryant at 4:55-5:10: 'I'm not, I actually work for a company called Split Lease and we help... posts and multi local.' Susan's conceptual model is wrong, and the only correction mechanism is a human being. Norman (Ch.1, The System Image): 'the entire burden of communication is on the system image.' Here, the system image has failed completely — Bryant IS the system image."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 4:55",
          "quote": "Real estate Agent.",
          "relevance": "Susan's misidentification reveals that the platform has no perceivable signifiers that communicate what Split Lease is. Norman's discoverability principle requires that users can figure out what a system does — Susan cannot."
        },
        {
          "source": "Susan  Bryant customer call.txt, 2:22",
          "quote": "I have to go and see the space and just to make sure that everything is legit. You know how sometimes people give you all kind of run around.",
          "relevance": "Susan's prior experiences with scams have primed her System 1 to distrust remote housing services. The platform needs signifiers that actively counteract this 'run around' mental model."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 The System Image",
          "quote": "The designer of the product and the person using the product form somewhat disconnected vertices of a triangle... the entire burden of communication is on the system image.",
          "relevance": "Split Lease's system image at discovery relies entirely on a human intermediary. If Bryant is removed from the loop, the triangle collapses — there is no system image for the user to form a conceptual model from."
        }
      ]
    },
    "search": {
      "what_this_lens_reveals": "Susan never reaches the platform's search functionality. Her 'search' happens entirely through the phone call, where Bryant describes a specific listing (Rita's condo). This reveals that the platform's search affordances are invisible to Susan — she does not know the platform exists as a searchable entity. Norman's affordance principle states that affordances exist even if they are not visible, but for designers their visibility is critical. The search page may have excellent filters and listings, but none of its affordances are perceivable to Susan because she never encounters them. The call also reveals what search signifiers Susan needs: she asks about the specific space type ('is it a full apartment or is it a bedroom?' 0:43), bathroom availability (1:08), shared occupancy (1:20), location (4:39-5:21), and duration flexibility (1:35). These are the natural search dimensions for a guest like Susan's friend, and the platform's search must make these filterable and prominent.",
      "user_state": {
        "emotional_state": "Transactional and efficient. Susan is gathering facts rapidly — type of space, bathroom, other occupants, location, duration — in a pattern that mirrors a natural search flow. She is not browsing; she has a specific need and is evaluating whether this listing meets it.",
        "knowledge_level": "Susan now understands the specific listing (room in a condo, private bath, near Lincoln Tunnel) but still does not understand the platform or how to find other listings. She has no mental model of Split Lease as a searchable marketplace.",
        "commitment_level": "Evaluating a single option. Susan has not committed to searching the platform broadly. She is assessing one listing that was presented to her via a phone call.",
        "data_available": "Susan's friend's requirements: Oregon-based, 1-2 months stay, weekday preference (M-F), has medical appointments, needs private bathroom, prefers legitimate/verifiable spaces."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Susan has no awareness that a searchable platform exists — if this one listing does not work, she will not know to search for others",
          "The concept of 'non-continuous set of nights' requires explanation twice in the call (0:19-0:35 and 1:35-2:00) — if the platform's search uses this terminology without explanation, it will be a failed signifier",
          "Susan's search criteria (private bath, no shared occupancy, short-term, weekdays only) are very specific — if the platform's search filters do not map to these natural categories, the search affords nothing useful"
        ],
        "evidence": "Bryant at 0:19-0:35: 'I'm looking for a guest who would need this space basically for any non-continuous set of nights. So like part of the week, each week or part of the month, each month.' Susan responds with confusion: 'Like seven nights a week?' (0:43). The platform's core concept requires a signifier that communicates 'part-time housing' without jargon. Norman (Ch.1, Signifiers): 'Signifiers communicate where the action should take place... signifiers must be perceivable, else they fail to function.'"
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 0:43",
          "quote": "Like seven nights a week? I mean, I can have her stay with another friend of mine. So the night that you need the place...",
          "relevance": "Susan's immediate confusion about 'non-continuous nights' reveals that this core concept lacks an effective signifier. She defaults to 'full-time' because that is her existing conceptual model for housing."
        },
        {
          "source": "Susan  Bryant customer call.txt, 0:55-1:08",
          "quote": "Is it a full apartment or is it a bedroom? ... So it's a one bedroom work. Can she, what about a bathroom?",
          "relevance": "Susan's rapid-fire questions reveal the natural search dimensions guests need: space type, bedroom count, bathroom access. These must be prominent signifiers in the search UI, not buried in filters."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Signifiers",
          "quote": "People need some way of understanding the product or service they wish to use, some sign of what it is for, what is happening, and what the alternative actions are.",
          "relevance": "The search experience must signify not just what listings are available but what the entire service model is — part-time housing, non-continuous nights — because guests arrive without this conceptual model."
        }
      ]
    },
    "listing_evaluation": {
      "what_this_lens_reveals": "This is the highest-tension phase in the Susan call. Susan's evaluation of the listing is entirely focused on trust verification — she demands to physically inspect the space before her friend books a flight from Oregon (2:14-2:22, 3:05-3:16, 3:42-3:58). Bryant explains that pre-booking inspection is not allowed for privacy reasons, and Susan pushes back hard. Norman's framework reveals the core failure: the listing page's signifiers are insufficient to replace the affordance of physical inspection. Susan explicitly requests photos as a substitute signifier (3:42: 'If I like the room in the bathroom, I can, should have pictures'). The platform must bridge the gap between what the listing page affords (visual/textual information) and what Susan needs to form a trust-worthy conceptual model (verification that the space is 'legit'). Norman's anti-affordance concept applies: the no-preview policy is an anti-affordance that prevents a natural trust-building interaction, but its signifiers (why the policy exists, what substitutes are available) are absent. Bryant must verbally construct the substitute: 'if you come the first night and it's not something that would work, you have the flexibility to cancel' (3:16). This cancellation-as-safety-net is a crucial affordance that the platform must signify prominently.",
      "user_state": {
        "emotional_state": "Highly anxious and protective. Susan is gatekeeping for a vulnerable friend who would fly across the country. Her repeated insistence on seeing the space (three separate times: 2:14, 3:05, 3:42) reveals deep distrust that the listing alone cannot resolve. She explicitly references past negative experiences: 'you know how sometimes people give you all kind of run around' (2:22).",
        "knowledge_level": "Susan knows the physical details (room in a condo, private bath, near Lincoln Tunnel) but lacks the verification layer: she does not know if these claims are true. She has no way to verify from the listing alone.",
        "commitment_level": "Conditionally ready to commit. Susan says 'I'll give you the deposit right there' (2:34 and 3:58) — but only after personal inspection. Without a substitute signifier for physical verification, she is stuck.",
        "data_available": "Listing details conveyed verbally by Bryant: room within a condo, private bath, private room, near Palisade Ave and 32nd St (close to Lincoln Tunnel). No photos, no reviews, no verified host badge have been presented."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Susan demands physical inspection three times — the listing page's visual signifiers alone are insufficient for her trust threshold",
          "Susan's friend is flying from Oregon — the cost of a wrong decision is not just the booking fee but an airline ticket, making the stakes unusually high",
          "The no-preview policy creates an anti-affordance with no visible substitute signifier — Susan does not learn about cancellation flexibility until Bryant verbally explains it",
          "Susan has been scammed before ('you know how sometimes people give you all kind of run around') — her prior conceptual model for remote housing is 'likely fraud'"
        ],
        "evidence": "Susan at 3:42-3:58: 'I understand that she's going to come from Oregon. I don't want to have to book a ticket and come if, since I'm not here now, If I like the room in the bathroom, I can, should have pictures. And she said, it's okay. I'll give you the deposit right there.' Norman (Ch.1, Affordances): 'To be effective, affordances and anti-affordances have to be discoverable — perceivable.' The no-preview anti-affordance is NOT discoverable until Bryant explains it verbally. The cancellation affordance that substitutes for it is also not discoverable."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 2:14-2:22",
          "quote": "I do have to see the room before she puts her tickets. I have to go and see the space and just to make sure that everything is legit.",
          "relevance": "This is the call's most critical moment. Susan's trust cannot be built by the listing's current signifiers. She needs either physical inspection (not allowed) or substitute signifiers (photos, reviews, verified host badges, cancellation guarantees) that the platform must provide."
        },
        {
          "source": "Susan  Bryant customer call.txt, 3:16",
          "quote": "There would be something set up where if you come the first night and it's not something that would work, you have the flexibility to cancel.",
          "relevance": "Bryant improvises a crucial signifier — the first-night cancellation guarantee. This affordance exists but is invisible on the platform. Norman: 'Affordances exist even if they are not visible. For designers, their visibility is critical.'"
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Affordances",
          "quote": "To be effective, affordances and anti-affordances have to be discoverable — perceivable. This poses a difficulty with glass... If an affordance or anti-affordance cannot be perceived, some means of signaling its presence is required: I call this property a signifier.",
          "relevance": "The no-preview policy is a glass wall — Susan cannot see why it exists or what alternatives it provides. The platform needs signifiers that explain the anti-affordance (privacy protection) and the substitute affordance (cancellation flexibility, verified photos, host reviews)."
        },
        {
          "source": "Susan  Bryant customer call.txt, 3:42",
          "quote": "If I like the room in the bathroom, I can, should have pictures.",
          "relevance": "Susan spontaneously proposes photos as a substitute signifier for physical inspection. This reveals that the listing page must make photo quality and completeness a primary trust mechanism — not an optional add-on."
        }
      ]
    },
    "proposal_creation": {
      "what_this_lens_reveals": "Susan never reaches the proposal creation interface because the call does not progress to platform interaction. However, the call reveals what the proposal creation step must signify. Susan negotiates terms verbally: 1-2 months duration, 5 nights per week (Monday-Friday), her friend's schedule (medical appointments during the day). Bryant translates these into platform terms: '30 night minimum' (1:35), 'five nights a week for like two months' (2:00). This translation step — from the guest's natural language to the platform's proposal format — is where Norman's mapping principle is most relevant. The proposal creation UI must map the guest's natural way of thinking about their stay (weekday nights, specific months, while attending appointments) to the platform's input fields (duration selector, day-of-week toggles, start date). If the mapping is not natural, the guest will not understand how to express their need. Norman: 'A device is easy to use when the set of possible actions is visible, when the controls and displays exploit natural mappings.'",
      "user_state": {
        "emotional_state": "Pragmatic and goal-oriented. Susan is describing her friend's needs in practical terms — she knows the schedule, the duration, and the budget constraints. She is ready to act if the trust barrier is resolved.",
        "knowledge_level": "Susan understands what her friend needs (weekday accommodation for 1-2 months) but does not understand the platform's terminology. Bryant introduces '30 night minimum' — a platform constraint that Susan must translate from her friend's '1-2 months' mental model.",
        "commitment_level": "Ready to commit if trust is established. Susan says twice that she will 'give you a deposit right there' (2:34, 3:58) upon verification.",
        "data_available": "Stay parameters: 5 nights/week (M-F), 1-2 months total, friend is from Oregon, arriving as soon as space is confirmed, daytime appointments scheduled."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "The '30 night minimum' is platform jargon that does not map to Susan's '1-2 months' conceptual model — if the proposal form presents this as a number field rather than a natural duration selector, it becomes a failed signifier",
          "Susan is booking on behalf of someone else — the proposal form must afford proxy booking or she cannot complete the action",
          "The day-of-week selection requires Susan to understand the non-continuous nights model, which she struggled with earlier in the call"
        ],
        "evidence": "Bryant at 1:35: 'Rita would require a 30 night minimum, which it sounds like if you were to do like five nights a week, would likely be something that Rita would be interested in.' The '30 night minimum' is a platform constraint expressed in platform units. Susan thinks in calendar months. Norman (Ch.1, Mapping): 'Natural mapping, taking advantage of spatial analogies, leads to immediate understanding.' The proposal form must map calendar months to platform nights naturally, not force the guest to do the conversion."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 1:35-2:00",
          "quote": "Rita would require a 30 night minimum... five nights a week for like two months would be something that would, could work.",
          "relevance": "Bryant performs the mapping between Susan's calendar-based thinking and the platform's night-based units. The proposal creation UI must perform this mapping visually — showing both '5 nights/week x 8 weeks = 40 nights' and 'approximately 2 months, Mon-Fri.'"
        },
        {
          "source": "Susan  Bryant customer call.txt, 3:58",
          "quote": "Do five days a week. And then would there be a preference for those days, like weekdays?... It's Monday to Friday will be better.",
          "relevance": "Susan's natural way of expressing the schedule is 'Monday to Friday.' The day-of-week selector must support this as a one-click preset, not require toggling 5 individual days."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Mapping",
          "quote": "Natural mapping, taking advantage of spatial analogies, leads to immediate understanding. For example, to move an object up, move the control up.",
          "relevance": "The proposal form's duration/day selectors must exploit natural mappings: calendar-like displays for dates, weekday group presets for schedule selection, and real-time price feedback as the guest configures terms."
        }
      ]
    },
    "negotiation": {
      "what_this_lens_reveals": "The Susan call contains a real-time negotiation, but it happens verbally between Susan and Bryant, not through the platform. Bryant introduces Rita's constraints ('30 night minimum,' no pre-booking inspection) and Susan pushes back ('I do have to see the room'). Bryant offers a compromise ('flexibility to cancel' after the first night). This pattern — constraint introduction, pushback, compromise — is exactly what the platform's negotiation flow must support with appropriate signifiers and feedback. Norman's feedback principle is most relevant here: when Susan pushes back, Bryant provides immediate verbal feedback ('I can talk to her about that,' 'I'll keep you updated'). The platform's negotiation UI must provide equivalent feedback: when a guest questions or rejects a host's terms, the system must immediately acknowledge the action and communicate what happens next. Norman: 'Feedback must be immediate: even a delay of a tenth of a second can be disconcerting.'",
      "user_state": {
        "emotional_state": "Assertive and protective. Susan is not passive — she pushes back on terms she does not accept (no inspection) and proposes alternatives (photos, deposit). In a platform negotiation, this assertiveness needs channels to express itself.",
        "knowledge_level": "Susan understands the basic terms being discussed but does not understand the negotiation structure — who decides what, what is negotiable vs. fixed, what happens after a counter-offer.",
        "commitment_level": "Conditionally committed. Susan is willing to close the deal ('I'll give you the deposit right there') but only on her terms (inspection or photos first).",
        "data_available": "Negotiation parameters: duration (1-2 months), schedule (M-F), host minimum (30 nights), inspection policy (no pre-booking), cancellation flexibility (first-night option)."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "The negotiation is mediated entirely by Bryant — if Susan were on the platform alone, she would have no way to push back on terms she does not accept",
          "The no-inspection policy is presented as non-negotiable, but Bryant improvises a compromise — the platform's counter-offer interface must support this kind of creative compromise",
          "Susan expects immediate feedback ('can you hear me?' appears multiple times when the call has technical issues) — any delay in the platform's negotiation feedback will feel like abandonment"
        ],
        "evidence": "Bryant at 3:16: 'There would be something set up where if you come the first night and it's not something that would work, you have the flexibility to cancel.' This is a negotiation compromise that exists nowhere in the formal platform flow. Norman (Ch.1, Feedback): 'Feedback must be immediate... Feedback must also be informative. Many companies try to save money by using inexpensive lights or sound generators for feedback. These simple light flashes or beeps are usually more annoying than useful.'"
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 3:05-3:16",
          "quote": "She can book and come whenever I can find her the space, but I do have to see the room and the bathroom first. So, um, it wouldn't be, we wouldn't allow Rita wouldn't allow to see the place before booking. However, there would be something set up where if you come the first night and it's not something that would work, you have the flexibility to cancel.",
          "relevance": "This is a complete negotiation micro-cycle: demand (inspection) → rejection (not allowed) → compromise (first-night cancellation). The platform's negotiation UI must afford this pattern, not just accept/reject binaries."
        },
        {
          "source": "Susan  Bryant customer call.txt, 2:42-3:05",
          "quote": "And Susan, can you hear me, Susan? Me? Yep. Can you hear me? No, I, yeah. You're you're back. I can hear you. Can you hear me? Yes. I can hear you.",
          "relevance": "The call drops briefly and both parties scramble to re-establish communication. This is an analog of delayed platform feedback — when the feedback channel breaks, trust erodes immediately. Norman: 'Feedback must be immediate.'"
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Feedback",
          "quote": "Feedback — communicating the results of an action — is a well-known concept from the science of control and information theory... Feedback must be immediate: even a delay of a tenth of a second can be disconcerting.",
          "relevance": "Every negotiation action (counter-offer submitted, terms modified, message sent) must produce immediate, informative feedback — not just a spinner or a 'pending' badge."
        }
      ]
    },
    "acceptance": {
      "what_this_lens_reveals": "The Susan call does not reach formal acceptance — the call ends with Bryant promising to follow up with Rita and keep Susan updated (4:39, 6:57). However, the call reveals what acceptance must signify. Susan's conditional acceptance pattern ('I'll give you the deposit right there' IF she can verify the space) shows that acceptance is not a single click but a multi-condition commitment. Norman's conceptual model principle is key here: the guest's conceptual model of 'acceptance' includes trust verification (photos, inspection), financial commitment (deposit), and confirmation of terms (duration, schedule, price). The platform's acceptance flow must signify all three dimensions clearly. Norman: 'Good conceptual models are the key to understandable, enjoyable products: good communication is the key to good conceptual models.' If the acceptance screen shows only 'Accept Terms → Yes, Proceed' without surfacing the trust verification and financial details, the guest's conceptual model will be incomplete.",
      "user_state": {
        "emotional_state": "Split between readiness and hesitation. Susan is ready to pay ('I'll give you the deposit right there') but cannot accept without verification. The acceptance step must resolve this tension.",
        "knowledge_level": "Susan knows the terms (5 nights/week, 1-2 months, near Lincoln Tunnel) but does not know the total cost, the cancellation policy details, or what happens after acceptance.",
        "commitment_level": "High conditional commitment. Susan has stated willingness to deposit twice. The conditions are: (1) space verification and (2) clear terms.",
        "data_available": "Verbal agreement on schedule and duration. No formal proposal exists yet. No pricing has been discussed on the call."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Susan has stated willingness to pay, reducing dropout risk, but her conditions remain unmet",
          "The acceptance screen must communicate what Susan is committing to (total price, cancellation policy, what happens on day one) or she will hesitate",
          "The call ends without formal next steps — Susan says 'let me see if I can get my friend' (6:50), indicating she may not follow through without a clear signifier of what to do next"
        ],
        "evidence": "Susan at 6:50: 'So I'll reach out to your father since, let me see if I can get my friend.' The call ends with an ambiguous handoff. Norman (Ch.1, Signifiers): 'People need some way of understanding the product or service they wish to use, some sign of what it is for, what is happening, and what the alternative actions are.' The 'what happens next' signifier is missing — Susan leaves the call without a clear path to acceptance."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 2:34",
          "quote": "I like to see the place and I can give you a deposit on her behalf and she's ready to come whenever I can find her spot.",
          "relevance": "Susan's acceptance model is: verify → deposit → book travel. The platform must support this sequence, not skip to 'Submit Proposal' without the verification step."
        },
        {
          "source": "Susan  Bryant customer call.txt, 6:50-6:57",
          "quote": "So I'll reach out to your father since, let me see if I can get my friend... I'll be in contact with Rita. And like I said, I'll keep you updated.",
          "relevance": "The call ends with human promises ('I'll keep you updated') as the only signifier of what happens next. The platform must replace these human signifiers with system-level ones: confirmation emails, timeline indicators, next-step prompts."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Conceptual Models",
          "quote": "Good conceptual models are the key to understandable, enjoyable products: good communication is the key to good conceptual models.",
          "relevance": "The guest's conceptual model of acceptance must include: what they are agreeing to, what they can cancel, what happens on day one, and what the total financial commitment is. All must be signified on the acceptance screen."
        }
      ]
    },
    "move_in": {
      "what_this_lens_reveals": "The move-in phase is the highest-stakes moment in this specific guest journey because Susan's friend is flying from Oregon. The call reveals that Susan's primary anxiety is the gap between listing promises and physical reality (2:22: 'just to make sure that everything is legit'). Norman's framework identifies this as a signifier-to-reality gap: the listing's signifiers (photos, description) make claims about the space, but the move-in experience is when those claims are tested against reality. Norman: 'When the system image is incoherent or inappropriate, then the user cannot easily use the device.' At move-in, the system image IS the physical space — and if it does not match the listing's signifiers, the guest's conceptual model collapses. The House Manual (journey map Phase 5) must serve as a bridge signifier: it communicates what the space affords (Wi-Fi, appliances, check-in procedures), mapping the listing's promises to actionable instructions. Bryant's verbal promise of first-night cancellation flexibility (3:16) must be prominently signified at move-in — the guest must know they can leave if reality does not match the listing.",
      "user_state": {
        "emotional_state": "Highest anxiety in the entire journey. The friend has flown from Oregon, spent money on a ticket, and is now encountering the space for the first time. If the space does not match expectations, the cost is not just the booking but the trip itself.",
        "knowledge_level": "The guest has seen photos and read the listing but has never physically experienced the space. The gap between digital signifiers and physical reality is maximum.",
        "commitment_level": "Financially committed (flight booked, deposit paid) but emotionally uncommitted until the space passes the physical inspection that Susan demanded from the start.",
        "data_available": "Listing photos, description, House Manual content, check-in instructions, host contact information, cancellation policy terms."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Susan's entire call is organized around preventing a bad move-in experience — if this phase fails, the platform loses not just the guest but the referring proxy (Susan) and all future word-of-mouth",
          "The friend is from out of state with no local fallback — a move-in failure is catastrophic, not just inconvenient",
          "The cancellation flexibility Bryant promised (3:16) must be prominently signified at move-in or the guest will not know they have an exit option",
          "The House Manual must serve as the first-contact signifier for how the space works — Norman's 'knowledge in the world' that replaces 'knowledge in the head'"
        ],
        "evidence": "Susan at 3:42: 'I understand that she's going to come from Oregon. I don't want to have to book a ticket and come if, since I'm not here now...' The friend's out-of-state origin makes move-in the highest-risk moment. Norman (Ch.1, Discoverability): 'Two of the most important characteristics of good design are discoverability and understanding.' At move-in, the guest must discover how to enter the space, use its features, and contact the host — all without prior physical experience."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 3:42",
          "quote": "I understand that she's going to come from Oregon. I don't want to have to book a ticket and come if...",
          "relevance": "The out-of-state travel amplifies move-in risk. The platform must provide signifiers that reduce this anxiety before arrival: verified photos, video walkthroughs, host responsiveness scores, and prominently displayed cancellation terms."
        },
        {
          "source": "Susan  Bryant customer call.txt, 1:20",
          "quote": "Would somebody else be in the place when she's there?",
          "relevance": "Susan asks about co-occupancy, which directly affects the move-in experience. If the guest arrives to find unexpected co-occupants, the listing's signifiers have failed. This must be signified clearly in both the listing and the House Manual."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Discoverability",
          "quote": "Two of the most important characteristics of good design are discoverability and understanding. Discoverability: Is it possible to even figure out what actions are possible and where and how to perform them?",
          "relevance": "At move-in, the guest must discover: how to enter the building, how to access the room, how to use shared spaces, how to contact the host. Each of these is an affordance that requires a signifier (key code, House Manual section, in-app messaging button)."
        }
      ]
    },
    "active_lease": {
      "what_this_lens_reveals": "The Susan call provides limited direct evidence about the active lease phase, but several details are revealing. Susan's friend will be 'out most of the day' with 'appointments' that Susan is coordinating (3:58-4:31). The friend will stay with another friend on weekends (4:31). This usage pattern — weekday occupancy with weekend departures — creates a recurring cycle of arrivals and departures, each requiring coordination. Norman's mapping and feedback principles apply to the Date Change Tool: the guest must be able to add, remove, or swap dates with natural mappings (calendar-based, not list-based) and immediate feedback (confirmation that the change was registered, host notification sent). The Stays Manager from the journey map becomes the central signifier hub during active lease — it must make all available actions discoverable (date changes, arrival notifications, cleaning photos, reviews) without requiring the guest to navigate away. Norman: 'A device is easy to use when the set of possible actions is visible, when the controls and displays exploit natural mappings.' Susan's call also reveals that the guest-host communication during active lease may be mediated by a third party (Susan coordinating on behalf of her friend). The platform's messaging must afford and signify this proxy communication pattern.",
      "user_state": {
        "emotional_state": "Settled but vigilant. The guest is using the space regularly but each weekly cycle (arrive Monday, depart Friday) is a mini-move-in and mini-move-out that generates mild anxiety about the space's condition and the host's expectations.",
        "knowledge_level": "The guest knows the space, the rules, and the routine after the first week. But date changes, cleaning photo requirements, and review prompts may be unfamiliar until they encounter them — each is an affordance that needs a signifier.",
        "commitment_level": "Fully committed financially. Emotionally committed if the first week went well. If the first week was poor, the guest is looking for exit signals — which the platform must also signify clearly.",
        "data_available": "Full stay history, payment records, communication logs, cleaning photos from prior stays, review history, date change history."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Each weekly departure-arrival cycle is a potential dropout point if the guest finds the coordination burden too high",
          "Cleaning photo requirements and review prompts, if poorly signified, feel like chores rather than trust-building actions — Norman warns against 'too much feedback' that becomes 'more annoying than too little'",
          "The proxy booking pattern (Susan managing on behalf of her friend) means the platform must signify actions to potentially two people, not one",
          "Susan's friend has an alternative (staying with Susan's other friend on weekends) — if the platform experience is poor, the alternative expands to weekdays too"
        ],
        "evidence": "Susan at 4:31: 'She could stay with a friend of mine if he need the space on the weekend, that would work.' The friend has a fallback. Norman (Ch.1, Feedback): 'Too much feedback can be even more annoying than too little... Feedback has to be planned. All actions need to be confirmed, but in a manner that is unobtrusive.' The active lease phase must balance necessary feedback (cleaning reminders, date confirmations) with the guest's tolerance for notifications."
      },
      "key_quotes": [
        {
          "source": "Susan  Bryant customer call.txt, 3:58-4:31",
          "quote": "She's going to be out most of the day, you know, she has done appointments and all I'm setting up all appointments for her... she could stay with a friend of mine if he need the space on the weekend.",
          "relevance": "The guest's usage pattern (weekdays only, out during the day, appointments scheduled by a proxy) defines the active lease rhythm. The Stays Manager must map to this pattern — showing weekday stays, tracking arrivals/departures, and supporting proxy access."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Feedback",
          "quote": "Feedback has to be planned. All actions need to be confirmed, but in a manner that is unobtrusive. Feedback must also be prioritized, so that unimportant information is presented in an unobtrusive fashion, but important signals are presented in a way that does capture attention.",
          "relevance": "The active lease generates many feedback moments (date confirmations, cleaning reminders, review prompts, payment notifications). Each must be prioritized: critical (payment failed, date change rejected) vs. routine (stay confirmed, cleaning reminder) vs. optional (review prompt). Norman's hierarchy of feedback urgency applies directly."
        },
        {
          "source": "donnorman-affordances-signifiers-feedback.txt, Ch.1 Mapping",
          "quote": "A device is easy to use when the set of possible actions is visible, when the controls and displays exploit natural mappings.",
          "relevance": "The Stays Manager must display the full set of available actions (add dates, remove dates, swap dates, send arrival notice, upload cleaning photos, write review) with natural mappings — a calendar view where clicking a date reveals actions, not a list of abstract buttons."
        }
      ]
    }
  },
  "cross_phase_patterns": [
    {
      "pattern": "The platform's system image is incoherent — Bryant serves as the primary signifier for every phase Susan engages with",
      "phases_affected": ["discovery", "search", "listing_evaluation", "proposal_creation", "negotiation", "acceptance"],
      "evidence": "Susan misidentifies Split Lease as a real estate brokerage (4:55). She negotiates terms through Bryant, not the platform. She learns about cancellation flexibility from Bryant's verbal explanation (3:16), not from the UI. She receives location details as cross streets from Bryant (5:21), not from a map interface. Norman (Ch.1, The System Image): 'When the system image is incoherent or inappropriate, then the user cannot easily use the device.' The system image for Split Lease does not exist independently of Bryant. This is a cross-phase pattern because it affects every phase: at no point does Susan interact with or even reference the platform's interface."
    },
    {
      "pattern": "Missing signifiers for the non-continuous nights model force repeated verbal explanation of the platform's core concept",
      "phases_affected": ["discovery", "search", "proposal_creation", "active_lease"],
      "evidence": "Bryant explains 'non-continuous set of nights' at 0:19-0:35, then rephrases at 1:35-2:00, then again at 5:10. Susan initially defaults to 'seven nights a week' (0:43) because her existing conceptual model for housing is full-time occupancy. Norman (Ch.1, Signifiers): 'Signifiers signal things, in particular what actions are possible and how they should be done. Signifiers must be perceivable, else they fail to function.' The non-continuous nights model is Split Lease's core differentiator, yet it lacks a signifier that first-time users can perceive without human translation. This affects search (filter labels), proposal creation (day-of-week selection UI), and active lease (stays manager showing partial-week occupancy)."
    },
    {
      "pattern": "Trust verification demands recur across phases because the platform lacks visual/structural signifiers that replace physical inspection",
      "phases_affected": ["listing_evaluation", "negotiation", "acceptance", "move_in"],
      "evidence": "Susan demands to see the space at 2:14, 3:05, and 3:42. She accepts photos as a substitute signifier at 3:42. She mentions past scam experiences at 2:22. Norman (Ch.1, Anti-affordances): 'To be effective, affordances and anti-affordances have to be discoverable — perceivable.' The no-preview policy is an anti-affordance (preventing physical inspection), but it has no discoverable substitute signifier. The platform must replace physical inspection with a layered trust system: verified photos, host identity verification, guest reviews, cancellation guarantees — each prominently signified at the evaluation, negotiation, acceptance, and move-in phases."
    },
    {
      "pattern": "Proxy booking breaks the platform's assumption of a single guest actor",
      "phases_affected": ["search", "listing_evaluation", "proposal_creation", "acceptance", "active_lease"],
      "evidence": "Susan is booking for 'a friend of mine who was coming from Oregon' (0:11). She says 'I can give you a deposit on her behalf' (2:34). She is coordinating the friend's appointments (3:58-4:31). The platform's conceptual model assumes the person evaluating, proposing, and accepting is the person staying. Norman (Ch.1, Conceptual Models): 'A conceptual model is an explanation, usually highly simplified, of how something works. It doesn't have to be complete or even accurate as long as it is useful.' The platform's conceptual model of 'one guest = one user' is not useful when proxies are involved. The affordances must support proxy actions (booking for someone else, managing on behalf of), and these must be signified (not hidden behind workarounds)."
    },
    {
      "pattern": "Feedback gaps across the call mirror the feedback gaps the platform likely has — every time communication breaks, trust erodes",
      "phases_affected": ["negotiation", "acceptance", "active_lease"],
      "evidence": "The call drops at 2:42-3:05, causing mutual scrambling ('Can you hear me? Can you hear me?'). Bryant promises future feedback: 'I'll keep you updated' (4:39, 6:57). Susan asks for the exact address (4:39), a feedback request Bryant cannot fully satisfy ('I can give you a close cross streets'). Norman (Ch.1, Feedback): 'Feedback must be immediate: even a delay of a tenth of a second can be disconcerting. If the delay is too long, people often give up.' Every gap in platform feedback — pending proposal with no status update, host counter-offer with no notification, date change with no confirmation — will trigger the same anxiety Susan shows when the call drops."
    }
  ],
  "sources_consulted": [
    "Susan  Bryant customer call.txt — Full transcript of guest-side call. Susan is booking on behalf of a friend from Oregon. Key themes: demand for physical inspection, confusion about the non-continuous nights model, misidentification of Split Lease as a real estate brokerage, conditional readiness to pay deposit, proxy booking pattern.",
    "donnorman-affordances-signifiers-feedback.txt — Full text of The Design of Everyday Things (2013 revised edition) by Don Norman. Key frameworks extracted: affordances (possible interactions), signifiers (perceivable indicators of how to use a design), mapping (relationship between controls and outcomes), feedback (communicating results of actions), conceptual models (simplified explanations of how things work), system image (combined information available to the user), discoverability (can the user figure out what actions are possible), anti-affordances (prevention of interaction, must be discoverable).",
    "split-lease-journey-map.md — Full platform journey map covering Phase 1 (Host listing creation), Phase 2 (Guest proposal creation), Phase 3 (Host counter), Phase 4 (Guest acceptance), Phase 5 (Post-acceptance: documents, leases, stays manager, date change tool, reviews, house manual, messaging). Used to identify platform interaction points that Susan never reaches but her friend would need to navigate.",
    "library/elements.json (first 200 lines) — Reviewed existing element library structure and coverage. Library has 118 elements across 10 runs. Strong coverage in discovery, evaluation, listing creation, pricing. Moderate coverage in proposal management, acceptance, active lease. Weak coverage in move-in. Don Norman's affordances/signifiers/feedback framework has never been applied before — this is the first run using this lens. Noted that prior runs use Kahneman (System 1/2), Cialdini (authority/liking/scarcity), Christensen (jobs-to-be-done), and Eyal (Hook Model)."
  ]
}