{
  "lens": {
    "host_call": "tammy-call.txt",
    "book_extract": "kahneman-part2-heuristics-biases.txt",
    "lens_summary": "A large-scale professional host's rigid income anchors ($5,000/month minimums) and availability-driven risk perceptions (Airbnb horror stories, pandemic losses) reveal how heuristics and biases shape every phase of the host journey, from discovery through retention."
  },
  "phases": {
    "discovery": {
      "what_this_lens_reveals": "Tammy's discovery phase is dominated by anchoring effects. Her $5,000/month anchor for 2BR and $3,000/month for 1BR are not negotiable starting points but fixed reference numbers that any new platform must meet or exceed. When Split Lease presents a per-night model yielding ~$2,500/month, Tammy's System 1 immediately rejects it because the number falls below her anchor. Kahneman's anchoring research shows that even random numbers bias subsequent estimates — Tammy's anchors are not random but deeply experience-based, making them even more resistant to adjustment. Discovery fails not because the platform lacks value, but because the first number the host encounters ($2,500/month equivalent) triggers an automatic comparison against an immovable anchor ($5,000/month).",
      "user_state": {
        "emotional_state": "Skeptical but open. Tammy is willing to listen ('Feel free to send me anything' at 30:34) but her emotional default is protective of her income floor. The affect heuristic is active: she feels good about her current system (Zelle, upfront payment, monthly tenants) and that positive affect reduces her perceived risk of the status quo while increasing perceived risk of Split Lease's model.",
        "knowledge_level": "Highly knowledgeable about rental economics but unfamiliar with Split Lease's specific model. She understands the per-night concept but has not internalized how paired tenants could reach her monthly minimum.",
        "commitment_level": "Evaluating but with a strong default toward rejection. The law of small numbers applies: she is judging Split Lease based on a single data point ($2,500/month) from a single interaction, treating this small sample as representative of the platform's entire value proposition.",
        "data_available": "We know her portfolio size (13-14 units), pricing anchors ($5K/$3K), seasonal patterns (busy Nov-Dec, vacant Jan-April), payment preferences (Zelle), and competitive frame (hates Airbnb, prefers VRBO)."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Income anchor mismatch: $2,500/month vs $5,000/month minimum creates an immediate anchoring-driven rejection",
          "Availability heuristic: Tammy's vivid negative experiences with Airbnb (pandemic cancellations, refund abuse) are highly available and transfer suspicion to all platforms",
          "Affect heuristic: positive feelings about her current direct-booking system make any alternative feel risky by comparison"
        ],
        "evidence": "tammy-call.txt, 02:09: 'I don't understand that I can pay what I can make on a monthly basis... the math doesn't add up.' This is anchoring in action — the first number she encounters fails to meet her anchor, triggering immediate System 1 rejection."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 02:09",
          "quote": "The math doesn't add up.",
          "relevance": "Instant anchoring rejection. Her monthly minimum anchor makes the per-night rate feel inadequate before any calculation occurs."
        },
        {
          "source": "tammy-call.txt, 04:26",
          "quote": "I can look to people all day long at 5,000 a month for the two bedroom, one bath.",
          "relevance": "This is her anchor stated explicitly. Any Split Lease presentation must either meet this number or reframe the comparison entirely."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Anchors chapter",
          "quote": "The estimates stay close to the number that people considered — hence the image of an anchor... Any number that you are asked to consider as a possible solution to an estimation problem will induce an anchoring effect.",
          "relevance": "Tammy's $5,000 is the anchor. Split Lease must either present a number that meets or exceeds it, or use the paired-tenant model to establish a new anchor above $5,000."
        }
      ]
    },
    "evaluation": {
      "what_this_lens_reveals": "Tammy's evaluation is driven by the availability heuristic and affect heuristic in tandem. Her vivid, emotionally charged negative experiences with Airbnb are highly available — she can recall specific incidents (pandemic cancellations, fraudulent credit cards, guests complaining about carpet marks) with ease and emotional intensity. Kahneman shows that 'dramatic events temporarily increase the availability of their category.' For Tammy, every platform encounter activates the 'platform = Airbnb = betrayal' category. Her evaluation of Split Lease is not a fresh assessment but a comparison against the most available platform experience she has, which is overwhelmingly negative. Simultaneously, VRBO's hands-off approach anchors her expectation: any legitimate platform should let the host set policy and stay out of the way.",
      "user_state": {
        "emotional_state": "Guarded and experienced. She evaluates through the lens of past losses, not future possibilities. The affect heuristic means her negative feelings about platforms substitute for careful analysis of Split Lease's specific features.",
        "knowledge_level": "Expert-level understanding of hosting economics, guest vetting, and payment risk. She knows exactly what she needs (upfront payment, employer verification, electronic locks) and evaluates platforms against this established checklist.",
        "commitment_level": "Conditionally interested. She states openness ('if you can... kind of take advantage of Airbnb's inability' at 21:45) but conditions are strict: match monthly minimums, pair tenants, let her set policy.",
        "data_available": "Her evaluation criteria are explicit: monthly income floor, upfront payment, host policy control, minimal platform interference. She also reveals seasonal vacancy windows (Jan-April) as a potential entry point."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Availability cascade from Airbnb: every negative platform story she recalls reinforces the 'platforms betray hosts' narrative",
          "Insufficient adjustment from VRBO anchor: she expects VRBO-level hands-off behavior; any deviation triggers rejection",
          "Law of small numbers: she will judge Split Lease on the first interaction, treating one experience as definitive"
        ],
        "evidence": "tammy-call.txt, 16:53: 'I really can't stand Airbnb... that is the model of bad customer service.' This is the availability heuristic: Airbnb's failures are the most vivid, emotionally charged platform experience available to her, and they define her category for 'platform behavior.'"
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 16:53-19:03",
          "quote": "I really can't stand Airbnb... they support the client or the landlord. They take too much control over damages... a lot of landlords are just starting to rent off their own sites.",
          "relevance": "An availability cascade in miniature: vivid negative experiences with Airbnb lead to generalized platform distrust and a trend toward disintermediation."
        },
        {
          "source": "tammy-call.txt, 19:12",
          "quote": "VRBO... they kind of let you set the policy. They just kind of take a more hands off approach.",
          "relevance": "VRBO anchors her expectation for platform behavior. Split Lease must signal VRBO-like host autonomy or trigger the Airbnb-like control aversion."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Availability and Affect",
          "quote": "The affect heuristic simplifies our lives by creating a world that is much tidier than reality. Good technologies have few costs in the imaginary world we inhabit, bad technologies have no benefits.",
          "relevance": "Tammy has classified Airbnb as 'bad technology' (all costs, no benefits) and her own system as 'good technology' (all benefits, no costs). Split Lease must avoid being classified in the Airbnb category."
        }
      ]
    },
    "onboarding": {
      "what_this_lens_reveals": "Tammy's onboarding expectations are shaped by anchoring on her existing operational workflow. She has a well-established system: booking form, Zelle payment, electronic locks, onsite managers. Any onboarding process must either map onto these existing mental models or clearly demonstrate superiority. Kahneman's insufficient adjustment principle predicts that Tammy will evaluate Split Lease's onboarding relative to her current system and fail to adjust sufficiently from that anchor. If onboarding feels like 'more work than what I already do,' she abandons. The law of small numbers also applies: one confusing screen, one unnecessary field, one unfamiliar term, and Tammy will generalize this single data point into 'this platform is not for professional hosts.'",
      "user_state": {
        "emotional_state": "Impatient and efficiency-focused. She manages 13-14 units and has no tolerance for processes that are slower than her existing workflow.",
        "knowledge_level": "Expert — she already knows how to run her business. Onboarding must respect this expertise and not treat her like a first-time host.",
        "commitment_level": "Low — she has not committed to using the platform. Onboarding is another evaluation point, not a sunk-cost continuation.",
        "data_available": "Her operational requirements: Zelle/electronic payments, guest vetting criteria (employer, location, purpose), property details (Harlem brownstones, specific pricing), seasonal availability."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Anchoring on existing workflow efficiency means any friction is felt as regression",
          "Law of small numbers: one bad onboarding experience = platform is not for professionals",
          "Affect heuristic: if onboarding feels tedious, the negative affect transfers to the entire platform"
        ],
        "evidence": "tammy-call.txt, 29:35: 'We have onsite managers at all locations. If they have a problem, they come the next day or that day.' She has a fast, human system. Platform onboarding must not feel slower than calling her manager."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 03:27",
          "quote": "I have like 13, 14 [units], so these are not [single-property situations].",
          "relevance": "Scale anchors her onboarding expectations. A platform designed for single-property hosts will feel wrong to a 13-unit professional. Onboarding must signal multi-property capability immediately."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Anchoring as Adjustment",
          "quote": "Insufficient adjustment is a failure of a weak or lazy System 2.",
          "relevance": "Tammy's System 2 will not invest in adjusting from her existing workflow anchor unless the platform gives her powerful reasons to adjust. The first impression must exceed her current system's ease of use."
        }
      ]
    },
    "listing_creation": {
      "what_this_lens_reveals": "Tammy has two brownstones and multiple units — she needs bulk listing capability, not a single-property wizard. The law of small numbers creates a specific risk here: the 6-step listing wizard was presumably designed from a small sample of host types, and its 'average' design fails for outlier hosts like Tammy who manage 9+ properties. Kahneman shows that 'extreme outcomes are most likely in small samples' — if the design team tested with 5-10 hosts, professional multi-property hosts like Tammy may not have been represented, creating a wizard that is structurally wrong for her. The anchoring effect also predicts that Tammy will anchor on whatever the first listing creation experience feels like and project that onto all future listings. If creating listing #1 takes 15 minutes, she will estimate 15 x 9 = 135 minutes for all NYC units and abandon.",
      "user_state": {
        "emotional_state": "Task-oriented and time-constrained. She is managing a portfolio, not lovingly crafting one listing.",
        "knowledge_level": "She knows all her property details cold. The information exists; the question is whether the platform can capture it at conversational speed.",
        "commitment_level": "Conditional — she will create listings only if the paired-tenant economics work first. Listing creation is downstream of pricing resolution.",
        "data_available": "Property types (brownstones, apartments), locations (Harlem near Whole Foods, Bay Area), unit counts (9 NYC, others Bay Area), pricing ($5K/2BR, $3K/1BR), amenities (electronic locks, onsite managers)."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Anchoring: time to create first listing multiplied by unit count produces overwhelming total",
          "No bulk listing support for professional hosts",
          "Law of small numbers: wizard designed from small sample likely excludes multi-property professional workflow"
        ],
        "evidence": "tammy-call.txt, 05:47: 'I have two brown buildings, one with five furniture furniture. So you guys can... I can give you an envelope that I like, and you've got create the stage.' Tammy expects Split Lease to do the listing setup work, not her."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 05:47-06:40",
          "quote": "I can give you an envelope that I like, and you've got create the stage, but the model is a little deep bottling to me.",
          "relevance": "Tammy wants to hand over property details and have the platform (or team) create the listings. This is a professional host expectation that the current self-service wizard does not meet."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Law of Small Numbers / Gates Foundation",
          "quote": "If the statisticians who reported to the Gates Foundation had asked about the characteristics of the worst schools, they would have found that bad schools also tend to be smaller than average. The truth is that small schools are not better on average; they are simply more variable.",
          "relevance": "Design decisions based on a small sample of hosts (possibly single-property casual hosts) may optimize for an unrepresentative user. Multi-property professional hosts like Tammy are the 'extreme outcome' that small-sample design misses."
        }
      ]
    },
    "pricing": {
      "what_this_lens_reveals": "Pricing is the central battlefield of this lens. Tammy's entire engagement hinges on whether Split Lease can present pricing that overcomes her $5,000/month anchor. Kahneman's anchoring research shows two mechanisms at work: (1) Deliberate adjustment — Tammy consciously compares Split Lease's per-night model against her monthly anchor and finds the gap ($2,500 vs $5,000) too large to adjust from. (2) Priming — the per-night framing itself primes 'small amounts' and 'uncertainty,' while her monthly framing primes 'large amounts' and 'stability.' The solution she suggests — pairing multiple tenants to exceed the monthly minimum — is itself an anchoring strategy: present the paired total first, then break it down. This is Tammy unconsciously applying Kahneman's insight that the first number presented becomes the anchor.",
      "user_state": {
        "emotional_state": "Frustrated and protective. Pricing is where her livelihood is at stake. The affect heuristic is at maximum intensity: any pricing model that feels like 'less money' triggers immediate negative affect regardless of the actual math.",
        "knowledge_level": "Deeply informed. She knows her market rates, seasonal patterns, and the exact math. She is not confused about per-night vs monthly — she understands both and rejects the per-night model on financial grounds.",
        "commitment_level": "Zero commitment to current pricing model. Full commitment conditional on paired-tenant solution meeting monthly minimums.",
        "data_available": "Exact anchors: $5,000/month 2BR, $3,000/month 1BR. Seasonal vacancy: Jan-April. Willingness to try during low season. Explicit request for Split Lease to create paired arrangements."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "Primary anchor mismatch: $2,500/month vs $5,000/month — the gap is 100%, far beyond typical adjustment range",
          "Affect heuristic: 'less money' feeling overwhelms any rational analysis of paired-tenant potential",
          "Anchoring permanence: even if shown paired-tenant math, the original $2,500 anchor may persist as a 'what if only one tenant books' worry"
        ],
        "evidence": "tammy-call.txt, 10:16: 'That was my hesitation. When you say I have a split, they earn them until they're at 2,500 a month. What can I look that, so then what would I do moving forward?' She identifies the core risk: if the paired-tenant model fails to fill, she is stuck at $2,500/month — half her anchor."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 04:26",
          "quote": "I can look to people all day long at 5,000 a month for the two bedroom, one bath. Or do you guys have for a one bedroom? I can both off as 3000 per month.",
          "relevance": "The $5,000 and $3,000 anchors are stated as market facts, not negotiating positions. They are deeply held and experience-validated."
        },
        {
          "source": "tammy-call.txt, 10:16",
          "quote": "What can I look that, so then what would I do moving forward? So I think that is my biggest challenge is not being able to secure that in an online model.",
          "relevance": "The uncertainty of the per-night model triggers availability of worst-case scenarios: empty units, partial bookings, income below the anchor."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Anchoring Index",
          "quote": "The anchoring effect was 41%... the professionals were almost as susceptible to anchoring effects as business school students with no real-estate experience.",
          "relevance": "Even real estate professionals cannot resist anchoring. Tammy, despite her expertise, will anchor on whatever number Split Lease presents first. If that number is $2,500/month, the damage is done."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Uses and Abuses of Anchors",
          "quote": "Moving first is an advantage in single-issue negotiations... the initial anchor has a powerful effect.",
          "relevance": "Split Lease must present the paired-tenant total ($5,000+) as the first number, not the per-night rate or single-tenant monthly. First number wins."
        }
      ]
    },
    "proposal_mgmt": {
      "what_this_lens_reveals": "Proposal management for Tammy must address two heuristic risks: (1) The availability heuristic will make her overweight negative scenarios when evaluating proposals. Every proposal from a guest she does not know triggers recall of her worst booking experiences (fraudulent credit cards at 13:31, local renters causing problems at 13:31). These vivid memories are highly available and will bias her proposal evaluation toward rejection. (2) The law of small numbers means she will judge Split Lease's entire guest quality based on the first 1-2 proposals she receives. If the first proposal comes from a guest who does not match her vetting criteria (non-local, employed professional, able to pay upfront), she will generalize: 'Split Lease sends bad guests.'",
      "user_state": {
        "emotional_state": "Cautious and gatekeeping. She has a well-developed screening system (employer check, payment ability, purpose of stay) and will apply it to every proposal.",
        "knowledge_level": "Expert at guest evaluation. She has clear criteria and knows exactly what red flags look like.",
        "commitment_level": "Engaged only if proposals meet her screening criteria. Each proposal is an independent evaluation, not a continuation of prior trust.",
        "data_available": "Her vetting criteria: non-local guests preferred, employer verification, purpose of stay, ability to pay deposit upfront. Red flags: local renters, same-day requests, credit card issues."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "Availability heuristic: worst-case guest scenarios are more vivid and available than best-case",
          "Law of small numbers: first 1-2 proposals define her perception of guest quality on the platform",
          "Insufficient adjustment: if the first proposal is weak, she will not sufficiently adjust her opinion upward even after seeing strong proposals"
        ],
        "evidence": "tammy-call.txt, 13:31: 'Local people... check from their employer... What are they there for? What's the company, who are they there and where are they going to be working?' Her vetting checklist is specific and non-negotiable. Proposals that do not surface this information will be rejected."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 11:33",
          "quote": "If they have fun, pretty much, they have to wear with all their... My property is a little bit cheaper, but if you have $5,000 a month and you're paying upfront and there's not much risk.",
          "relevance": "Upfront payment is her risk-elimination anchor. Proposals must show payment capability upfront to pass her System 1 screening."
        },
        {
          "source": "tammy-call.txt, 15:57",
          "quote": "If they're a nurse and they're going to be working at a particular hospital, I know where they're working, I know what they're doing.",
          "relevance": "Employment context reduces availability of worst-case scenarios. When she knows the guest's employer, the 'bad guest' memory category becomes less available."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Availability, Emotion, and Risk",
          "quote": "A dramatic event temporarily increases the availability of its category. A plane crash that attracts media coverage will temporarily alter your feelings about the safety of flying.",
          "relevance": "Each bad guest experience 'temporarily' increases Tammy's vigilance — but with 13-14 units and years of hosting, these 'temporary' increases compound into permanent hypervigilance."
        }
      ]
    },
    "active_lease": {
      "what_this_lens_reveals": "Tammy's active lease management reveals a sophisticated system designed to minimize availability of negative outcomes. Electronic locks eliminate the availability of 'guest won't leave' scenarios. Onsite managers ensure that maintenance issues are resolved same-day, preventing the availability cascade of 'one problem leads to guest complaint leads to bad review leads to reduced bookings.' Her 15-day advance payment requirement anchors the lease relationship around financial reliability: by establishing payment discipline early, each on-time payment reinforces the 'good tenant' anchor and suppresses the availability of 'non-payment' scenarios. Kahneman's finding that 'personal experiences are more available than statistics' means that Tammy's active lease decisions are driven by her most vivid past experiences, not by aggregate data.",
      "user_state": {
        "emotional_state": "Operationally confident but vigilant. She has systems (managers, electronic locks, advance payment) that keep her in control.",
        "knowledge_level": "Expert. She knows how to manage tenants across multiple properties with professional infrastructure.",
        "commitment_level": "High within her existing system. On Split Lease, commitment during active lease depends entirely on whether early experiences confirm or disconfirm her anchored expectations.",
        "data_available": "Operational infrastructure: electronic locks, onsite managers, 15-day advance payment cycle, Zelle as primary payment method, same-day maintenance response."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "If the first Split Lease active lease produces any operational friction, the availability of that friction will dominate her assessment",
          "Her existing system is highly optimized; the platform must add value, not replace working processes",
          "Availability cascade risk: one problem during active lease triggers concern → more scrutiny → discovery of more issues → platform abandonment"
        ],
        "evidence": "tammy-call.txt, 29:35: 'We have onsite managers at all locations. If they have a problem, they come the next day or that day, and we go with it.' Her baseline is same-day resolution. Split Lease's response time becomes the active-lease anchor."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 11:33-13:20",
          "quote": "I also have electronic locks. So if it ever came to that... people are paying upfront. If they give you their money upfront, you know, they know that they have a place to stay while they work a particular contract.",
          "relevance": "Her active lease risk mitigation is built on upfront payment + electronic access control. The platform must not weaken these systems."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Availability Cascades",
          "quote": "An availability cascade is a self-sustaining chain of events, which may start from media reports of a relatively minor event and lead up to public panic and large-scale government action.",
          "relevance": "In the host context, an availability cascade starts with one minor operational issue and compounds into platform abandonment. The platform must break the cascade by resolving issues before they compound."
        }
      ]
    },
    "retention": {
      "what_this_lens_reveals": "Retention for Tammy is governed by the interplay of anchoring and the affect heuristic. Her retention anchor is the income she earns from her current system. If Split Lease produces income at or above her $5,000/month anchor, the affect heuristic flips: positive income feelings transfer to positive platform feelings, reducing perceived risk and increasing perceived benefits (exactly as Kahneman describes in the affect heuristic research). Conversely, if income falls below the anchor even once, the negative affect is sticky and resistant to correction. The availability heuristic also plays a role: one successful lease will be less available (because success is 'normal' and boring) than one failed or underperforming lease (which is dramatic and emotionally charged). Retention requires making success vivid and available through explicit income reporting and comparison against her anchors."
    ,
      "user_state": {
        "emotional_state": "Pragmatic. She will stay if the math works and leave if it does not. Emotional loyalty to a platform is absent; this is purely economic.",
        "knowledge_level": "Full expertise. She knows her alternatives and can benchmark Split Lease against direct booking, VRBO, and monthly tenants in real time.",
        "commitment_level": "Entirely contingent on income performance relative to her monthly anchor.",
        "data_available": "Her retention benchmark: $5,000/month per 2BR unit, $3,000/month per 1BR. Seasonal context: willing to use Split Lease for vacancy periods (Jan-April) even at lower rates if it fills otherwise-empty units."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Anchoring: any month below $5,000 resets the negative affect cycle",
          "Availability heuristic: one bad month is more memorable than six good months",
          "Affect heuristic: if she 'feels' that Split Lease is underperforming, rational data may not override the feeling"
        ],
        "evidence": "tammy-call.txt, 30:48: 'The split release would work for any honor. It was very lucrative.' She explicitly conditions retention on 'lucrative' — the affect must be positive, which requires income above her anchor."
      },
      "key_quotes": [
        {
          "source": "tammy-call.txt, 30:48",
          "quote": "The split release would work for any honor if it was very lucrative.",
          "relevance": "Retention is explicitly conditional on income. The affect heuristic predicts that 'lucrative' feeling drives retention more than actual numbers, but the numbers must support the feeling."
        },
        {
          "source": "tammy-call.txt, 09:01",
          "quote": "If you want practice on one or try out one, put together something that's profitable for us both.",
          "relevance": "She is open to a trial during vacancy season — this is the retention entry point. If the trial succeeds, the 'success' anchor drives continued use."
        },
        {
          "source": "kahneman-part2-heuristics-biases.txt, Affect Heuristic",
          "quote": "People who had received a message extolling the benefits of a technology also changed their beliefs about its risks... the technology they now liked more than before was also perceived as less risky.",
          "relevance": "If Split Lease can make Tammy feel positive about income results, her perception of platform risk will decrease automatically. The affect heuristic works in both directions."
        }
      ]
    }
  },
  "cross_phase_patterns": [
    {
      "pattern": "The $5,000/month Anchor Governs Everything",
      "phases_affected": ["discovery", "evaluation", "pricing", "proposal_mgmt", "retention"],
      "evidence": "tammy-call.txt, 02:09 ('the math doesn't add up'), 04:26 ('$5,000 a month for the two bedroom'), 10:16 ('my biggest challenge is not being able to secure that in an online model'), 30:48 ('it was very lucrative'). Kahneman: 'Any number that you are asked to consider as a possible solution to an estimation problem will induce an anchoring effect.' Tammy's $5,000 is not just a number — it is the reference point for every platform evaluation. Split Lease must present paired-tenant totals that meet or exceed this anchor as the FIRST number shown, not as a secondary calculation."
    },
    {
      "pattern": "Airbnb Availability Cascade Poisons All Platform Trust",
      "phases_affected": ["discovery", "evaluation", "onboarding", "active_lease", "retention"],
      "evidence": "tammy-call.txt, 16:53-19:03: Extended negative Airbnb narrative covering customer service failures, pandemic cancellations, lack of landlord support, guest abuse of refund policies. Kahneman on availability cascades: 'a self-sustaining chain of events, which may start from media reports of a relatively minor event and lead up to public panic.' Tammy's Airbnb experiences have cascaded into a generalized platform distrust that Split Lease must actively counter at every phase."
    },
    {
      "pattern": "Professional Host Identity as Anchoring Defense",
      "phases_affected": ["onboarding", "listing_creation", "proposal_mgmt", "active_lease"],
      "evidence": "tammy-call.txt, 03:27 ('I have like 13, 14 [units]'), 29:35 ('we have onsite managers at all locations'), 11:33-13:20 (sophisticated payment/security system). Tammy's professional identity means she anchors on professional-grade tools and processes. She has ALREADY solved most hosting problems (vetting, payment, access control, maintenance). The platform must not ask her to re-solve solved problems. Instead, it must integrate with or enhance her existing professional infrastructure. Kahneman's anchoring research on real estate professionals: 'the professionals were almost as susceptible to anchoring effects as business school students' — even her expertise does not protect her from anchoring biases."
    },
    {
      "pattern": "Seasonal Vacancy as Availability-Bias-Reduced Entry Point",
      "phases_affected": ["discovery", "pricing", "active_lease", "retention"],
      "evidence": "tammy-call.txt, 09:01: 'from after Christmas to March, April, we were pretty much empty.' During vacancy season, the availability of 'I could be earning $5,000 from a monthly tenant' is low because no monthly tenants are available. This reduces the anchoring effect: $2,500-3,000/month from Split Lease looks better when the alternative is $0/month, not when it competes with $5,000/month. Kahneman: 'Anchoring effects are reduced when the second mover focuses attention on the minimal offer that the opponent would accept.' In vacancy season, Tammy's minimum acceptable offer drops to near zero, making Split Lease's economics viable."
    },
    {
      "pattern": "Affect Heuristic Bidirectionality — One Success Flips Everything",
      "phases_affected": ["evaluation", "pricing", "active_lease", "retention"],
      "evidence": "Kahneman: 'respondents who were told that the risks of a technology were mild developed a more favorable view of its benefits... The emotional tail wags the rational dog.' If Tammy's first Split Lease experience produces income above her adjusted seasonal anchor (even $3,000 during a normally vacant January), the positive affect will transfer to all aspects of the platform: reduced perceived risk, increased perceived benefits, higher tolerance for friction. The opposite is also true: one underperforming month poisons everything. This bidirectionality means the first lease experience must be carefully managed to succeed."
    }
  ],
  "sources_consulted": [
    "tammy-call.txt — Full transcript analyzed for anchoring language, availability-driven risk perception, affect heuristic expressions, and professional host identity markers",
    "kahneman-part2-heuristics-biases.txt — Chapters on Law of Small Numbers, Anchoring (adjustment + priming), Availability Heuristic, Affect Heuristic, and Availability Cascades extracted for host journey application",
    "split-lease-journey-map.md — Full 5-phase journey map reviewed for phase structure, interaction patterns, and critical decision points",
    "library/elements.json (first 200 lines) — Reviewed existing elements: works-001 (System 1 Trust Gate), works-002 (Depleted User), works-003 (Cognitive Speed Match), works-004 (Human-to-Digital Trust Bridge). Existing coverage is strongest in evaluation/onboarding phases with System 1/2 lens. Gap: no existing elements address anchoring in pricing or availability cascades in platform trust. This lens fills those gaps."
  ]
}