{
  "host": {
    "label": "Host Journey",
    "user_role": "host",
    "user_description": "A property owner or leaseholder who lists their space on Split Lease to find guests for shared living arrangements.",
    "call_transcript_path": "Agents-data-source/Customer calls Analysis/02-call-transcripts/host",
    "journey_phases": [
      "discovery",
      "evaluation",
      "onboarding",
      "listing_creation",
      "pricing",
      "proposal_mgmt",
      "active_lease",
      "retention"
    ],
    "phase_descriptions": {
      "discovery": "Host first hears about Split Lease (referral, ad, search). Deciding whether to explore.",
      "evaluation": "Host researches the platform. Compares to Craigslist, Airbnb, roommate apps. Reads about guarantees.",
      "onboarding": "Host signs up, verifies identity, connects with their assigned agent (e.g., Bryant). First call happens here.",
      "listing_creation": "Host creates their listing: photos, description, amenities, house rules, availability calendar.",
      "pricing": "Host sets nightly/weekly rates. Understands the payment model, guaranteed income, Split Lease fee structure.",
      "proposal_mgmt": "Host receives guest proposals, reviews them, counters terms, accepts or declines. Upon acceptance, Split Lease sends lease documents to both parties.",
      "active_lease": "Guest is living in the space. Host accesses the Leases page to track payments and manage stays. Both parties use the Date Change Tool to add, remove, or swap dates. Guest notifies Host of arrival and sends cleaning photos at end of each stay. Guest accesses the House Manual for rules and guidelines. Both parties review each stay.",
      "retention": "Lease ends or renews. Host decides whether to list again, refer others, or leave the platform."
    },
    "key_concerns": [
      "Trust in the platform and payment guarantees",
      "Quality and reliability of guests",
      "Effort required vs. alternatives (Craigslist, Airbnb)",
      "Pricing fairness and income predictability",
      "Agent support and responsiveness"
    ]
  },
  "guest": {
    "label": "Guest Journey",
    "user_role": "guest",
    "user_description": "A person seeking shared living space on Split Lease — typically a professional, student, or relocator who needs flexible mid-term housing (weeks to months).",
    "call_transcript_path": "Agents-data-source/Customer calls Analysis/02-call-transcripts/guest",
    "journey_phases": [
      "discovery",
      "search",
      "listing_evaluation",
      "proposal_creation",
      "negotiation",
      "acceptance",
      "move_in",
      "active_lease"
    ],
    "phase_descriptions": {
      "discovery": "Guest first finds Split Lease (search, referral, social media). Trying to understand what the platform is and if it's trustworthy.",
      "search": "Guest browses available listings. Filters by location, price, dates, amenities. Compares multiple options.",
      "listing_evaluation": "Guest is on a specific listing page. Evaluating photos, price, rules, host info, neighborhood. Deciding whether to commit.",
      "proposal_creation": "Guest configures their desired terms (dates, duration, days per week) and submits a proposal to the host.",
      "negotiation": "Host may counter the proposal. Guest reviews counter-terms, decides whether to accept, counter back, or walk away.",
      "acceptance": "Both parties agree on terms. Guest confirms, payment is authorized. Split Lease sends lease documents to both parties.",
      "move_in": "Guest arrives at the space. First impressions, key handoff, settling in. Guest accesses House Manual for rules, guidelines, and check-in procedures. Reality vs. listing expectations.",
      "active_lease": "Guest is living in the space. Guest accesses the Leases page to track payments and manage stays. Both parties use the Date Change Tool to add, remove, or swap dates. Guest notifies Host of arrival and sends cleaning photos at end of each stay. Both parties review each stay. Day-to-day communication through platform messaging."
    },
    "key_concerns": [
      "Safety and trustworthiness of the host and space",
      "Accurate listing photos and descriptions",
      "Price fairness and transparency (no hidden fees)",
      "Flexibility of terms (dates, duration, cancellation)",
      "Platform legitimacy vs. scams",
      "Speed of the booking process",
      "Communication with the host before committing"
    ]
  }
}
