{
  "lens": {
    "host_call": "user-stories-initial-analysis.md",
    "book_extract": "flow-solitude-others.txt",
    "lens_summary": "Csikszentmihalyi's Chapter 8 reveals the host journey as a continuous negotiation between solitude and social interaction. Hosting on Split Lease is, at its core, the act of voluntarily disrupting one's solitude by admitting a stranger into private space — the exact tension the chapter analyzes. The lens exposes how each phase demands the host to manage a different aspect of the solitude-companionship dialectic: from the initial disruption of privacy (listing creation) through the evaluation of who deserves entry (proposal management) to the daily reality of sharing space (active lease) and the retrospective question of whether the social arrangement enriched or depleted the self (retention). Csikszentmihalyi's concepts of differentiation and integration in family/household systems, the autotelic personality that transforms constraints into flow, and the skill of 'taming solitude' map precisely onto the host's challenge of making shared living enjoyable rather than merely tolerable."
  },
  "phases": {
    "discovery": {
      "what_this_lens_reveals": "Discovery is the phase where a potential host first encounters Split Lease, while still in full possession of their solitude. Csikszentmihalyi opens Ch 8 by establishing that 'the quality of life depends on two factors: how we experience work, and our relations with other people' (lines 20-22). For the host in discovery, the platform is proposing a radical change to the second factor: it asks them to convert their private space into a shared social environment. The chapter's central paradox applies directly: 'We are biologically programmed to find other human beings the most important objects in the world. Because they can make life either very interesting and fulfilling or utterly miserable' (lines 31-34). The host in discovery is unconsciously weighing this exact bet — will bringing someone into my space make my life interesting or miserable? The user stories analysis reveals that 'value before the ask — always' governs this phase. The flow lens explains why: Csikszentmihalyi shows that people in unstructured solitude (like a host with an empty room) experience psychic entropy — 'worries about one's love life, health, investments, family, and job are always hovering at the periphery of attention' (lines 210-212). The platform's discovery messaging must frame hosting not as a loss of solitude but as a solution to the entropy that unused space creates — turning an empty room from a source of worry (wasted income, maintenance burden) into a structured challenge.",
      "user_state": {
        "emotional_state": "The host is in what Csikszentmihalyi describes as the uncomfortable gap between valuing privacy and sensing that unused space generates psychic entropy. They may feel the 'nearly intolerable sense of emptiness' (line 179) not of personal loneliness but of spatial waste — a room sitting idle while financial pressures hover at the periphery of attention. The discovery moment promises to convert that entropy into ordered purpose.",
        "knowledge_level": "Minimal. The host may have heard about Split Lease through a referral, ad, or search. They understand they have a space and might want income from it, but do not yet understand the social commitment involved — that hosting means managing a relationship, not just a transaction.",
        "commitment_level": "Browsing. No commitment made. The host is still in full control of their solitude. They have not yet accepted any challenge that would create the conditions for flow.",
        "data_available": "Referral source, landing page visit data, ad click attribution. No profile, no property details, no stated intent."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "The host perceives hosting as a threat to solitude rather than as a structured challenge that could produce flow — Csikszentmihalyi: 'if we learn to make our relations with others more like flow experiences, our quality of life as a whole is going to be much improved' (lines 35-37), but the host has not yet learned this framing",
          "The platform asks for information before demonstrating value — user stories: 'Any flow that requires users to give information before seeing results will lose most of them' — this violates Csikszentmihalyi's principle that flow requires clear goals and immediate feedback before demanding effort",
          "The host may be someone who has 'tamed solitude' successfully and sees no reason to disrupt it — Csikszentmihalyi's examples of Dorothy and Susan Butcher show people who have built rich lives alone, and such hosts will need a compelling reason to accept social complexity"
        ],
        "evidence": "User stories: 'Any flow that requires users to give information before seeing results will lose most of them. Show something useful first. Offer to refine after.' Csikszentmihalyi Ch 8 (lines 197-202): 'keeping order in the mind from within is very difficult. We need external goals, external stimulation, external feedback to keep attention directed. And when external input is lacking, attention begins to wander, and thoughts become chaotic.' The platform must position itself as the external structure that converts spatial entropy into ordered income."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 20-22",
          "quote": "More than anything else, the quality of life depends on two factors: how we experience work, and our relations with other people.",
          "relevance": "Discovery is where the host first considers changing the second factor by introducing a stranger into their living environment. The platform must frame this as an opportunity for improved quality of life, not merely as a financial transaction."
        },
        {
          "source": "user-stories-initial-analysis.md, 'Value before the ask' section",
          "quote": "Any flow that requires users to give information before seeing results will lose most of them. Show something useful first. Offer to refine after.",
          "relevance": "Flow requires clear goals and feedback before demanding effort. Discovery fails when the platform demands commitment (registration, property details) before the host can see what the experience will be like — before the 'challenge' is clear enough to engage with."
        }
      ]
    },
    "evaluation": {
      "what_this_lens_reveals": "Evaluation is where the host compares the social complexity of hosting against the relative simplicity of maintaining their current solitude. Csikszentmihalyi's chapter establishes that 'the average adult spends about one-third of his or her waking time alone, yet we know very little about this huge slice of our lives, except that we heartily dislike it' (lines 175-177). But for hosts, the relevant inversion is: they may not dislike their solitude at all — they may have structured it effectively. The evaluation question becomes whether the platform's proposed social arrangement offers challenges that match or exceed the host's current skill level. The user stories analysis identifies that hosts compare Split Lease to alternatives — Craigslist, Airbnb, roommate apps. Csikszentmihalyi's framework reframes this comparison: each alternative represents a different balance of social complexity and personal control. Craigslist offers maximum autonomy but no structure (high entropy risk). Airbnb offers structure but constant guest turnover (low relationship depth). Split Lease proposes mid-term cohabitation — the deepest social commitment and therefore the highest potential for both flow and misery. The chapter's discussion of how 'relationships make us extremely happy when they go well, and very depressed when they don't work out' (lines 117-118) is the exact risk calculation the evaluating host is performing. The cross-activation insight from user stories — 'verified reviews and host credibility signals activate guests' — inverted for hosts means: seeing other hosts' positive experiences provides evidence that the social complexity of hosting can be structured into flow rather than chaos.",
      "user_state": {
        "emotional_state": "Calculating curiosity mixed with self-protective caution. The host is performing Csikszentmihalyi's challenge-skill assessment: do I have the social skills to manage a stranger in my space? Is the platform sophisticated enough to structure this into a manageable challenge rather than an overwhelming one? The emotional register oscillates between the appeal of income (a clear goal) and fear of the social unknown.",
        "knowledge_level": "Emerging. The host is actively comparing platforms and may have had an initial agent conversation. They understand the basic proposition but not the granular social mechanics — how daily coexistence actually works, what happens when conflicts arise, how the platform mediates.",
        "commitment_level": "Evaluating. The host has moved from browsing to active comparison. They are assessing whether hosting's social complexity is within their current skill set or represents a challenge too far beyond it — what Csikszentmihalyi would call the anxiety zone rather than the flow channel.",
        "data_available": "Referral source, page visit patterns (time on guarantees page, pricing page, FAQ), possibly initial agent call notes, comparison behavior signals."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "The host may conclude that maintaining their current solitude structure is a more reliable source of well-being than the uncertain social complexity of hosting — Csikszentmihalyi: 'a person who rarely gets bored, who does not constantly need a favorable external environment to enjoy the moment, has passed the test for having achieved a creative life' (lines 295-297) — a host who has already achieved this has less incentive to disrupt it",
          "Comparison to simpler alternatives (Craigslist, word-of-mouth) that offer income without the depth of social commitment Split Lease requires",
          "Insufficient evidence from other hosts that the social complexity of mid-term cohabitation can reliably produce flow rather than conflict"
        ],
        "evidence": "User stories: 'Rod isn't sure people are willing to give all that information before they've seen any results. The platform needs to earn that trust first.' Csikszentmihalyi Ch 8 (lines 135-136): 'It is the very flexibility of relationships that makes it possible to transform unpleasant interactions into tolerable, or even exciting ones.' The evaluating host needs evidence that Split Lease provides this flexibility — that the social arrangement can be adjusted, not just endured."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 117-118",
          "quote": "Relationships make us extremely happy when they go well, and very depressed when they don't work out.",
          "relevance": "This is the binary that makes evaluation high-stakes for hosts. Unlike short-term rentals, Split Lease's mid-term cohabitation model means the relationship will be deep enough to produce either genuine flow or genuine misery. The evaluating host senses this depth and must decide if the potential reward justifies the risk."
        },
        {
          "source": "user-stories-initial-analysis.md, Cross-Activation section",
          "quote": "A skeptical guest who sees verified reviews, ID checks, and real host history doesn't need the platform to convince them — another user already did. Every review is a past guest activating a future one.",
          "relevance": "Inverted for hosts: a skeptical host who sees other hosts' positive cohabitation experiences does not need the platform to convince them that social complexity can be structured into flow — another host already demonstrated it. The trust infrastructure is flow-evidence infrastructure."
        }
      ]
    },
    "onboarding": {
      "what_this_lens_reveals": "Onboarding is where the host takes the first concrete step toward disrupting their solitude by entering the platform's social system. Csikszentmihalyi describes how 'every relationship requires a reorienting of attention, a repositioning of goals' (line 542). Onboarding is this reorientation in its earliest form: the host creates an account (committing identity to the system), verifies themselves (accepting scrutiny), and connects with an assigned agent (experiencing the first structured social interaction the platform provides). The agent call is the critical flow moment in onboarding. Csikszentmihalyi's conditions for flow in relationships — common goals, reciprocal feedback, matched challenges and skills — should all be present in this call. The agent is not just onboarding the host; they are demonstrating what platform-mediated social interaction feels like. If the agent call achieves flow (the host feels heard, the conversation moves naturally, the goals are clear), it provides experiential evidence that the platform can structure social complexity into enjoyable interaction. The user stories principle that 'authentication should be invisible until it matters' maps to Csikszentmihalyi's point that flow requires concentration on the task, not on the mechanics: the host should be focused on the conversation with the agent, not on form fields and verification screens.",
      "user_state": {
        "emotional_state": "Tentative engagement. The host is experiencing the first psychic energy investment in the hosting journey. Csikszentmihalyi notes that 'when two people choose to focus their attention on each other, both will have to change their habits; as a result, the pattern of their consciousness will also have to change' (lines 550-551). The agent call begins this consciousness change — the host starts thinking of their space not just as theirs but as potentially shared.",
        "knowledge_level": "Growing. The host learns platform mechanics, vetting processes, and what to expect. The agent call fills knowledge gaps and translates abstract platform promises into concrete personal guidance.",
        "commitment_level": "Low-to-medium. Account creation and an agent call represent sunk costs, but withdrawal is still easy. The host has invested attention but not yet invested in the deep challenge of creating a listing.",
        "data_available": "Account creation data, verification status, agent assignment, call completion, initial property information shared verbally."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "If the agent call fails to achieve flow — poor rapport, unclear goals, mismatched expectations — the host extrapolates that the platform cannot structure social interaction well, and therefore cannot be trusted with the deeper social complexity of hosting",
          "Verification and identity demands feel like surveillance rather than safety if not framed as part of a flow-producing system — Csikszentmihalyi: 'clear feedback' is a condition of flow, and verification without immediate benefit violates this",
          "The gap between the warm agent interaction and the cold platform mechanics produces what Csikszentmihalyi calls the shift from companionship to solitude: the host feels supported during the call, then alone with a form-filled interface"
        ],
        "evidence": "User stories: 'Authentication should be invisible until it matters. Inline auth pop-up, not a full-page redirect.' Csikszentmihalyi Ch 8 (lines 282-284): 'The ultimate test for the ability to control the quality of experience is what a person does in solitude, with no external demands to give structure to attention.' After the agent call ends, the host is alone with the platform. If the platform cannot sustain the flow the agent initiated, onboarding stalls."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 542-546",
          "quote": "Every relationship requires a reorienting of attention, a repositioning of goals. When two people begin to go out together, they must accept certain constraints that each person alone did not have: schedules have to be coordinated, plans modified.",
          "relevance": "Onboarding is the host's first 'reorienting of attention' toward the platform's social system. The constraints they accept (account creation, verification, scheduling an agent call) are the earliest version of the constraints hosting will impose. If these feel burdensome rather than purposeful, the host will resist deeper commitment."
        },
        {
          "source": "user-stories-initial-analysis.md, Authentication section",
          "quote": "Authentication should be invisible until it matters. Inline auth pop-up, not a full-page redirect. Users don't lose search context.",
          "relevance": "Flow requires unbroken concentration. Authentication mechanics that disrupt the host's engagement with the platform break the flow state that onboarding should be building. The host should stay focused on the challenge (preparing to host) not the mechanics (filling forms)."
        }
      ]
    },
    "listing_creation": {
      "what_this_lens_reveals": "Listing creation is where the host must articulate what makes their space suitable for shared living — and this is Csikszentmihalyi's concept of differentiation made concrete. The chapter defines differentiation as each person being 'encouraged to develop his or her unique traits, maximize personal skills, set individual goals' (lines 668-669). For the listing, differentiation means the host must identify and express what is unique about their space, their rules, their lifestyle, and the kind of coexistence they offer. This is not just a form-filling exercise — it is an act of self-knowledge applied to one's living environment. The 6-step wizard (Space Snapshot, Features, Lease Styles, Pricing, Rules, Photos) maps to an escalating sequence of differentiation challenges. Step 1 (address, room type) is low-differentiation: objective facts. Step 5 (house rules) is high-differentiation: the host must articulate their personal boundaries, which requires knowing themselves well enough to predict what a stranger's presence will disrupt. Step 6 (photos) is the most intimate differentiation act: selecting which images represent both the space's appeal and the host's standards. Csikszentmihalyi's discussion of Dorothy, who 'personalized her surroundings to an uncommon degree' with 'flower tubs, garden gnomes, discarded tools' (lines 386-388), illuminates what listing creation asks: the host must show how they have made this space theirs — and then invite someone else into it. The user stories confirm that 'completion percentage is a good host nudge' — this is Csikszentmihalyi's feedback mechanism applied to the differentiation process: the host can see how much of the self-expression work remains.",
      "user_state": {
        "emotional_state": "Creative effort mixed with vulnerability. The host is performing a differentiation exercise that requires both practical work (uploading photos, selecting amenities) and psychological work (deciding what matters enough to declare as a rule, what is unique enough to highlight). Csikszentmihalyi notes that 'some people will need to live in the wilderness, or spend long periods of time alone at sea. Most people will prefer to be surrounded by the reassuring hustle and bustle of human interaction' (lines 470-472) — the listing is the host deciding which kind of person they are and what kind of coexistence they can offer.",
        "knowledge_level": "Task-specific. The host knows their space intimately but must translate that knowledge into the platform's categories. The tension between personal knowledge (what it feels like to live here) and platform categories (number of bedrooms, parking type) mirrors Csikszentmihalyi's distinction between instrumental and expressive skills: the wizard demands instrumental precision about something the host experiences expressively.",
        "commitment_level": "Medium-to-high. Each completed step increases sunk cost. But listing creation is the largest single dropout pool because the differentiation challenge is cognitively and emotionally demanding — the host must turn inward to articulate what they normally take for granted.",
        "data_available": "Partial listing data per step, time spent per step, abandonment point, template/common feature usage (indicating shortcuts through the differentiation process)."
      },
      "dropout_risk": {
        "level": "critical",
        "reasons": [
          "The differentiation challenge exceeds the host's self-knowledge: they cannot articulate what makes their space unique because they have never had to think about it from a stranger's perspective",
          "Photos require the host to see their private space through public eyes — a psychologically disorienting shift from solitude to social presentation",
          "House rules require the host to anticipate interpersonal conflict before it has occurred — a challenge that demands high social skill and produces anxiety in those who lack it",
          "Without the pause function, an interrupted host loses all differentiation work — user stories: 'Pause preserves the work, keeps the door open, and costs nothing'"
        ],
        "evidence": "User stories: 'Completion percentage is a good host nudge. Hosts need to know what's unfinished before a listing goes live.' AND 'Pause matters more than delete.' Csikszentmihalyi Ch 8 (lines 386-394): Dorothy 'personalized her surroundings to an uncommon degree... As extensions of Dorothy's taste, this junk creates a familiar environment where her mind can be at ease. In the midst of untamed nature, she has introduced her own idiosyncratic style, her own civilization.' Listing creation asks the host to articulate this personalization — to make visible the invisible ways they have made the space theirs."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 668-670",
          "quote": "Differentiation means that each person is encouraged to develop his or her unique traits, maximize personal skills, set individual goals. Integration, in contrast, guarantees that what happens to one person will affect all others.",
          "relevance": "Listing creation is pure differentiation: the host must identify and express what is unique about their space and their cohabitation offer. The integration challenge comes later, in active_lease, when what the guest does affects the host and vice versa. But without strong differentiation in the listing, integration during the lease will lack the foundation needed for flow."
        },
        {
          "source": "user-stories-initial-analysis.md, Completion percentage section",
          "quote": "Hosts need to know what's unfinished before a listing goes live. A visible progress indicator on the listing card creates just enough friction to get them to finish — without being in the way.",
          "relevance": "The completion percentage is a flow-feedback mechanism: it provides clear, immediate information about where the host stands in the differentiation challenge. Without this feedback, the 6-step wizard feels like an open-ended task with no sense of progress — the opposite of flow conditions."
        }
      ]
    },
    "pricing": {
      "what_this_lens_reveals": "Pricing is where the host must assign economic value to the social disruption of their solitude. Csikszentmihalyi's chapter does not address money directly, but it deeply addresses the 'cost' of social interaction: 'getting married requires a radical and permanent reorientation of attentional habits' (line 552) — and hosting requires a similar reorientation, for which the price must compensate. The journey map shows pricing as Step 4 of the wizard with 'default values already populated.' Csikszentmihalyi's flow conditions explain why defaults work: flow requires challenges matched to skills, and pricing is a challenge most hosts lack the skills for. They know the emotional cost of sharing their space but not the market rate. The default serves as a skill-bridge: it converts an overwhelming challenge (determine the economic value of your privacy) into a manageable one (review and accept or adjust). The user stories analysis does not address pricing directly — itself a signal that pricing is emotionally loaded. Csikszentmihalyi's framework explains the load: the host is being asked to quantify a qualitative experience. What is my solitude worth per night? What is the psychic energy cost of sharing my kitchen, my bathroom, my quiet mornings? The 'right' price is one that makes the social disruption feel worthwhile — not just financially but in terms of Csikszentmihalyi's 'quality of experience.' A host who prices too low will resent the guest's presence; too high and they will receive no proposals, wasting the differentiation effort of listing creation.",
      "user_state": {
        "emotional_state": "Defensive uncertainty. The host wants fair compensation for the disruption to their solitude but lacks a framework for calculating it. Csikszentmihalyi: 'happiness is something essentially subjective' (from the broader flow framework) — the host's subjective sense of what their space is worth may diverge sharply from market rates, creating internal conflict.",
        "knowledge_level": "Variable. Some hosts have researched comparable listings; others operate purely on instinct. The host knows what they pay in mortgage/rent but translating 'my home' into 'a nightly rate for a stranger' requires an emotional-to-economic translation that most find difficult.",
        "commitment_level": "High. Step 4 of 6 — significant sunk cost. But pricing anxiety can stall even a highly committed host who has completed all prior steps.",
        "data_available": "Property details from prior wizard steps, local market comparisons (if platform provides them), the host's financial expectations from the agent call."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Pricing anxiety: the host fears underselling their solitude (resentment during active lease) or overpricing (no proposals, wasted effort)",
          "Fee structure opacity: if the platform's cut is not transparent, the host feels an additional extraction — they are paying for the privilege of disrupting their own solitude",
          "Comparison to no-fee alternatives (Craigslist, personal networks) where the host keeps the full amount and retains more control over the social arrangement"
        ],
        "evidence": "Journey map: 'The pricing section appears with default values already populated. The Host reviews and accepts the defaults.' Csikszentmihalyi Ch 8 (lines 636-638): 'Cicero once wrote that to be completely free one must become a slave to a set of laws. In other words, accepting limitations is liberating.' The default price is a 'law' — an external constraint that paradoxically frees the host from the paralyzing challenge of self-valuation. Hosts who accept defaults are accepting the platform's social contract in the same way Csikszentmihalyi describes accepting the rules of a game as liberating."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 637-638",
          "quote": "Cicero once wrote that to be completely free one must become a slave to a set of laws. In other words, accepting limitations is liberating.",
          "relevance": "The pricing default is a constraint that liberates: by accepting the platform's suggested price, the host is freed from the agonizing calculation of what their privacy is worth. This mirrors Csikszentmihalyi's broader argument that the rules of flow activities (games, monogamy, creative disciplines) feel constraining but actually enable deeper engagement."
        },
        {
          "source": "split-lease-journey-map.md, Listing Wizard Step 4",
          "quote": "The pricing section appears with default values already populated. The Host reviews and accepts the defaults, clicking 'Next' to continue.",
          "relevance": "Most hosts accept defaults, suggesting that pricing is a challenge beyond their current skill level. The platform resolves the skill-challenge mismatch by providing an external structure — exactly what Csikszentmihalyi prescribes for preventing anxiety when challenges exceed skills."
        }
      ]
    },
    "proposal_mgmt": {
      "what_this_lens_reveals": "Proposal management is the phase where the host evaluates whether a specific stranger will create flow or entropy in their household. This is the most direct application of Csikszentmihalyi's analysis of human relationships: 'The same person can make the morning wonderful and the evening miserable. Because we depend so much on the affection and approval of others, we are extremely vulnerable to how we are treated by them' (lines 120-124). Every proposal is a concrete person asking to enter the host's life. The host is not just reviewing dates and prices — they are performing a social assessment: will this person respect my space? Follow my rules? Contribute to household flow or generate psychic entropy? Csikszentmihalyi's framework for intimate relationships applies: the host needs 'common goals and reciprocal feedback' (line 970) from the guest to feel safe accepting. A well-structured proposal demonstrates these: clear dates show shared temporal goals, a reasonable price shows economic alignment, and any pre-proposal messaging shows the capacity for reciprocal communication. The user stories confirm: 'A well-structured proposal — clear dates, schedule, pricing, intent — activates the host to respond. A vague or incomplete one creates friction.' The flow lens explains why: a structured proposal is evidence of the guest's capacity for ordered consciousness — they can articulate their needs, respect the host's framework, and engage in the kind of goal-aligned communication that Csikszentmihalyi identifies as the foundation of enjoyable relationships. A vague proposal signals psychic disorder in the guest, which the host instinctively reads as a threat to their own ordered environment. The counter-proposal mechanism (the host changing duration from 16 to 10 weeks) is the host exercising what Csikszentmihalyi calls the 'flexibility of relationships' — 'a social situation has the potential to be transformed by redefining its rules' (lines 160-162). The host is not just negotiating terms; they are defining the parameters within which flow can occur.",
      "user_state": {
        "emotional_state": "Vigilant assessment. The host oscillates between the excitement of validated demand (someone wants my space) and the anxiety of social commitment (this person will be in my home). Csikszentmihalyi's insight that 'people are the most flexible, the most changeable aspect of the environment we have to deal with' (lines 119-120) means the host knows they cannot fully predict the guest's behavior — which is both the appeal and the danger of the arrangement.",
        "knowledge_level": "Good platform knowledge but limited guest knowledge. The host understands proposals but knows little about the specific person behind each one. Guest profiles, reviews, and verification signals serve as Csikszentmihalyi's 'feedback' — information that helps the host assess whether the proposed relationship is within the flow channel or in the anxiety zone.",
        "commitment_level": "High. A live listing receiving proposals represents substantial investment. But each proposal is a discrete decision point: the host can accept, counter, or decline without abandoning the overall commitment.",
        "data_available": "Guest profile, proposal terms, guest history and reviews, verification status, any pre-proposal messages, proposal structure quality."
      },
      "dropout_risk": {
        "level": "medium",
        "reasons": [
          "Low-quality proposals signal that the marketplace will not produce guests capable of the ordered social interaction the host requires for flow — Csikszentmihalyi: 'socializing of this kind mimics friendship relations, but provides few of the benefits of the real thing' (lines 909-910) — vague proposals mimic genuine interest without demonstrating it",
          "Proposal overload or neglect: if proposals arrive when the host is not psychologically ready, they default to inaction — the user stories note that 'urgency should surface first on the dashboard'",
          "The counter-proposal process may feel like negotiation friction rather than the 'flexibility of relationships' — if the platform makes countering cumbersome, the host loses the sense of control that flow requires"
        ],
        "evidence": "User stories: 'A well-structured proposal activates the host to respond. A vague or incomplete one creates friction.' AND 'Urgency should surface first on the dashboard. Unread proposals, pending actions — that's what a host needs to see the moment they log in.' Csikszentmihalyi Ch 8 (lines 161-162): 'a social situation has the potential to be transformed by redefining its rules' — the counter-proposal is this transformation in action, and the platform must make it feel empowering rather than burdensome."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 119-124",
          "quote": "People are the most flexible, the most changeable aspect of the environment we have to deal with. The same person can make the morning wonderful and the evening miserable. Because we depend so much on the affection and approval of others, we are extremely vulnerable to how we are treated by them.",
          "relevance": "This is the core anxiety of proposal management: the host is evaluating a variable they cannot fully control. The platform's vetting, reviews, and structured proposal formats are attempts to reduce this variability — to make the incoming stranger more predictable and therefore less threatening to the host's ordered environment."
        },
        {
          "source": "user-stories-initial-analysis.md, Cross-Activation section",
          "quote": "A well-structured proposal — clear dates, schedule, pricing, intent — activates the host to respond. A vague or incomplete one creates friction. Stories that push toward more structured, pre-populated proposal forms aren't just about UX, they're about making the cross-activation moment as clean as possible.",
          "relevance": "Csikszentmihalyi's flow conditions demand clear goals and feedback. A structured proposal provides both: the host can immediately see the goal (the proposed arrangement) and assess fit (feedback on whether this matches their listing's intent). Pre-populated fields do the flow-structuring work that the guest might otherwise fail to do."
        }
      ]
    },
    "active_lease": {
      "what_this_lens_reveals": "Active lease is where Csikszentmihalyi's Chapter 8 finds its deepest application: the daily reality of sharing space is precisely what the chapter analyzes — how to make cohabitation enjoyable rather than merely tolerable. The host has now invited a stranger into their home, disrupting their solitude in a sustained, ongoing way. Every concept in the chapter becomes operational. SOCIAL FLOW: Csikszentmihalyi's conditions for flow in relationships — 'common goals, reciprocal feedback, matched challenges and skills' — must be actively maintained between host and guest. The journey map details the mechanisms: the Stays Manager creates shared temporal structure (common goals for when the guest arrives and departs), cleaning photos provide reciprocal feedback (the guest demonstrates respect, the host receives evidence of compliance), and reviews after each stay create a feedback loop that continuously calibrates the relationship. QUALITY OF SOLITUDE: The host does not lose their solitude during active lease — they alternate between it and social interaction, depending on the guest's schedule. Csikszentmihalyi's insight is critical here: 'unless one learns to tolerate and even enjoy being alone, it is very difficult to accomplish any task that requires undivided concentration' (lines 44-46). The host who can 'tame solitude' between guest stays uses that time productively; the host who cannot will experience the gaps as psychic entropy, anxiously awaiting the next arrival or dreading the next disruption. DIFFERENTIATION AND INTEGRATION: The listing represented differentiation (the host's unique identity). Active lease demands integration — 'what happens to one person will affect all others' (line 671). If the guest leaves the kitchen messy, the host's morning is affected. If the host imposes unreasonable restrictions, the guest's comfort suffers. The platform's tools (House Manual, Date Change Tool, messaging) are integration mechanisms: they ensure that both parties' actions are coordinated toward shared standards. FAMILY DYNAMICS APPLIED TO HOSTING: Csikszentmihalyi's analysis of family flow — 'to provide flow, a family has to have a goal for its existence' (line 656) — applies to the host-guest household. The 'goal' of the Split Lease household is mutually respectful cohabitation that benefits both parties. Without this shared goal, the arrangement degrades into the 'boring routine' Csikszentmihalyi warns about (line 732), kept alive by 'mutual convenience' (the lease) rather than genuine enjoyment. THE PAIN OF LONELINESS INVERTED: For most hosts, the risk is not loneliness but its opposite — the loss of productive solitude. Csikszentmihalyi identifies that 'the ultimate test for the ability to control the quality of experience is what a person does in solitude' (lines 281-282). Active lease tests the inverse: can the host control the quality of experience when their solitude is interrupted by another person's presence? The host who sets clear rules (House Manual), maintains personal routines, and uses the Date Change Tool to protect essential alone-time is practicing what Csikszentmihalyi calls 'taming' — but taming social intrusion rather than taming solitude. ENJOYMENT VS TOLERANCE: The chapter's most important insight for active lease is the distinction between relationships that are merely pleasant (providing order) and those that are genuinely enjoyable (providing growth). Csikszentmihalyi warns against social arrangements that 'mimic friendship relations but provide few of the benefits of the real thing' (lines 909-910). A hosting arrangement where host and guest merely coexist without positive interaction is the household equivalent of 'drinking buddies' — it prevents entropy but does not produce growth. The platform should help hosts and guests find 'new challenges in each other's company' (line 972) — which is what per-stay reviews, date flexibility, and the House Manual's evolving content can enable.",
      "user_state": {
        "emotional_state": "Oscillating between the satisfaction of ordered cohabitation and the stress of social disruption. When the guest follows the rituals (arrival notification, cleaning photos, rule compliance), the host experiences what Csikszentmihalyi calls the 'enjoyment of companionship' — the knowledge that another person is respectfully sharing their space, contributing to household order. When rituals are broken, the host experiences 'psychic entropy' — the disordering of consciousness that unstructured social interaction produces. Csikszentmihalyi: 'entropy is the basic condition of group life, just as it is of personal experience. Unless the partners invest psychic energy in the relationship, conflicts are inevitable' (lines 697-698). The host must continuously invest attention in the arrangement, which can be either energizing (when it produces flow) or depleting (when it produces conflict).",
        "knowledge_level": "High. The host understands the platform, the lease terms, and is developing knowledge of the specific guest's patterns. The unknown is behavioral: will the guest maintain the rituals? Will new friction emerge? The review system and communication tools provide ongoing feedback.",
        "commitment_level": "Very high. The lease is binding, payments are flowing, the guest is physically present. This is full commitment — the host has accepted the disruption of their solitude for a defined period. Withdrawal means lease termination, a major real-world action.",
        "data_available": "Payment history, stay dates, date change requests, communication logs, cleaning photos, reviews given and received, House Manual access patterns, any reported issues or disputes."
      },
      "dropout_risk": {
        "level": "low",
        "reasons": [
          "The lease is structurally binding — the 'rules of the game' are set and both parties have committed",
          "Payment flow provides continuous reinforcement — Csikszentmihalyi's 'clear feedback' condition is satisfied by regular income",
          "The guest is physically present, making 'dropping out' a complex real-world action rather than a simple digital one"
        ],
        "evidence": "Journey map: 'Date change requests follow the same confirmation flow and may require the other party's approval depending on the lease terms.' Csikszentmihalyi Ch 8 (lines 636-638): 'to be completely free one must become a slave to a set of laws. In other words, accepting limitations is liberating.' The lease's constraints — fixed dates, agreed prices, mutual approval for changes — paradoxically liberate both parties from the exhausting negotiation that unstructured cohabitation would require. Csikszentmihalyi Ch 8 (lines 639-642): 'by making up one's mind to invest psychic energy exclusively in a monogamous marriage, regardless of any problems, obstacles, or more attractive options that may come along later, one is freed of the constant pressure of trying to maximize emotional returns.' The committed lease serves the same function: the host stops wondering whether to host and focuses on how to host well."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 668-674",
          "quote": "Differentiation means that each person is encouraged to develop his or her unique traits, maximize personal skills, set individual goals. Integration, in contrast, guarantees that what happens to one person will affect all others. If a child is proud of what she accomplished in school, the rest of the family will pay attention and will be proud of her, too. If the mother is tired and depressed, the family will try to help and cheer her up. In an integrated family, each person's goals matter to all others.",
          "relevance": "Active lease is where the host's differentiation (their unique space, rules, lifestyle) meets integration (the guest's presence affects the host and vice versa). The platform's tools — House Manual, cleaning photos, reviews — are integration mechanisms that ensure mutual awareness and responsiveness. Without integration, the host and guest become isolated cohabitants, which Csikszentmihalyi warns produces entropy rather than flow."
        },
        {
          "source": "flow-solitude-others.txt, lines 697-702",
          "quote": "Entropy is the basic condition of group life, just as it is of personal experience. Unless the partners invest psychic energy in the relationship, conflicts are inevitable, simply because each individual has goals that are to a certain extent divergent from those of all other members of the family. Without good lines of communication the distortions will become amplified, until the relationship falls apart.",
          "relevance": "This is the central risk of active lease. The host and guest have divergent goals (the host wants quiet mornings; the guest wants to cook breakfast). Without the communication tools the platform provides (messaging, House Manual, Date Change Tool), these divergences amplify into conflicts. The platform's communication infrastructure is not a convenience feature — it is the mechanism that prevents the entropic collapse of the cohabitation arrangement."
        },
        {
          "source": "flow-solitude-others.txt, lines 855-865",
          "quote": "One of the most basic delusions of our time is that home life takes care of itself naturally, and that the best strategy for dealing with it is to relax and let it take its course... They have an almost superstitious faith in the integrity of the home. Only when it is too late — when the wife has become dependent on alcohol, when the children have turned into cold strangers — do many men wake up to the fact that the family, like any other joint enterprise, needs constant investments of psychic energy to assure its existence.",
          "relevance": "Hosts who assume the lease will manage itself — that rules set at listing creation will be followed without reinforcement, that the guest will naturally respect boundaries — are subject to this 'basic delusion.' Active lease requires continuous psychic energy investment: reviewing stays, responding to messages, updating the House Manual, adjusting dates. The platform must make this investment feel like flow (clear goals, immediate feedback, matched challenges) rather than like a chore."
        },
        {
          "source": "flow-solitude-others.txt, lines 281-284",
          "quote": "The ultimate test for the ability to control the quality of experience is what a person does in solitude, with no external demands to give structure to attention. It is relatively easy to become involved with a job, to enjoy the company of friends, to be entertained in a theater or at a concert. But what happens when we are left to our own devices?",
          "relevance": "Active lease inverts this test: the host must control the quality of experience when their solitude is interrupted by external demands. Can they maintain their routines, their sense of self, their enjoyment of their space when a stranger occupies part of it? Hosts who have developed strong personal routines (Csikszentmihalyi's 'taming solitude') will integrate the guest's presence without losing their center; hosts who depended on uninterrupted privacy for their well-being will struggle."
        },
        {
          "source": "split-lease-journey-map.md, Host-Guest Communication section",
          "quote": "Guest notifies arrival — Guest sends a message to the Host indicating they are arriving. Guest sends cleaning photos — At the end of each stay, the Guest takes and sends photos showing the space has been cleaned and left in good condition.",
          "relevance": "Arrival notifications and cleaning photos are cohabitation rituals — structured social behaviors that Csikszentmihalyi would recognize as flow-enabling. They convert potentially anxiety-laden transitions (Is the guest arriving? Did they clean?) into predictable, information-rich moments. The host receives clear feedback about the guest's behavior, which reduces psychic entropy and sustains the flow of the arrangement."
        }
      ]
    },
    "retention": {
      "what_this_lens_reveals": "Retention is the phase where the host decides whether the hosting experience has made them a more complex person — or merely a more tired one. Csikszentmihalyi's concept of the autotelic personality is the key: 'a person who rarely gets bored, who does not constantly need a favorable external environment to enjoy the moment, has passed the test for having achieved a creative life' (lines 295-297). The autotelic host has been transformed by the hosting experience: they have developed social skills, learned to manage cohabitation flow, grown through the challenge of sharing space. They choose to continue hosting not because they need the income (extrinsic motivation) but because the activity itself has become a source of enjoyment and growth (intrinsic motivation). This is the deepest retention mechanism — when hosting shifts from a transaction to an autotelic activity. Csikszentmihalyi warns that relationships maintained only by extrinsic reasons will eventually collapse: 'extrinsic reasons are not the only ones for staying married... There are great opportunities for joy and for growth that can only be experienced in family life, and these intrinsic rewards are no less present now' (lines 593-596). For retention, the parallel is exact: a host who continues solely for income will eventually find the social cost exceeds the financial reward. A host who has discovered intrinsic rewards — the satisfaction of managing a well-run household, the pleasure of positive guest interactions, the growth that comes from navigating social complexity — will persist even when income fluctuates. The chapter's discussion of how to maintain flow in long-term relationships — 'the only way to restore flow to the relationship is by finding new challenges in it' (lines 734-735) — applies directly. A host who has hosted the same type of guest for several cycles will find the challenge diminishing. The platform must help them find new challenges: hosting different types of guests, upgrading their listing, mentoring new hosts, joining a host community. Without escalating challenges, Csikszentmihalyi predicts 'boredom and frustration will inevitably set in' (lines 654-655). The user stories' insight that 'Pause matters more than delete' maps to retention precisely: a host who pauses is temporarily retreating to solitude to recover — Csikszentmihalyi's 'taming solitude' as a regenerative practice. A host who deletes is declaring that the social arrangement failed to produce the growth Csikszentmihalyi describes. THE WIDER COMMUNITY LENS: Csikszentmihalyi's final section on community involvement (lines 1049-1124) opens a retention pathway not visible through other lenses. A host who moves from individual hosting to community participation — forums, referrals, mentoring, hosting events — shifts from the 'family' level of social complexity to the 'wider community' level. This is an escalation of challenge that could sustain flow indefinitely. Csikszentmihalyi: 'the larger the social arena one moves in, the greater the challenges it presents' (lines 1059-1060). A host-community member who helps shape platform policies, mentors new hosts, or builds neighborhood hosting networks is experiencing the highest level of social flow the platform can offer.",
      "user_state": {
        "emotional_state": "Retrospective integration. The host is performing what Csikszentmihalyi describes as the assessment of whether an activity increased the complexity of the self. Did hosting make me a more interesting, more skilled, more connected person? Or did it deplete me, reduce my privacy, and add stress without growth? The emotional register depends entirely on this subjective assessment — not on objective outcomes like income amount. Csikszentmihalyi Ch 8 (lines 867-870): 'Any manager knows that his company will start falling apart if his attention wanders... without concentration, a complex activity breaks down into chaos.' The host in retention is asking: was this activity worth my concentrated attention, or was I better off in solitude?",
        "knowledge_level": "Complete. The host has lived through the full cycle. They know the platform, the process, the guest dynamics, and the emotional cost and reward of participation. No new information will change their assessment — only the quality of their reflection on the experience.",
        "commitment_level": "Zero to very high, entirely dependent on whether the host experienced flow or entropy during active lease. A host who found flow will re-list eagerly. A host who experienced chronic entropy (rule violations, communication breakdown, privacy loss without compensating satisfaction) will resist returning. There is no structural commitment holding them — only the pull of intrinsic reward or the push of financial need.",
        "data_available": "Complete journey data: listing performance, all guest reviews given and received, payment history, communication logs, date change frequency, dispute history, time-to-re-list (if any), referral behavior, community participation signals."
      },
      "dropout_risk": {
        "level": "high",
        "reasons": [
          "The accumulated micro-frictions of active lease crystallize into a narrative in retrospect — Csikszentmihalyi's point that 'obvious challenges have been exhausted' (line 729) means a host who found the experience predictable will find it boring; a host who found it unpredictable will find it stressful. Both lead to exit without new challenges",
          "No structural mechanism compels re-listing: the host must voluntarily choose to disrupt their recovered solitude again",
          "The 'autotelic' threshold: only hosts who discovered intrinsic rewards (not just income) during active lease will return. The platform's retention infrastructure must identify and amplify these intrinsic signals",
          "Comparison to 'not hosting' (recovered solitude, full privacy) feels powerfully appealing after a period of sustained social management — Csikszentmihalyi: 'Every rule has its exceptions, and even though most people dread solitude, there are some individuals who live alone by choice' (lines 367-368)"
        ],
        "evidence": "Csikszentmihalyi Ch 8 (lines 734-735): 'The only way to restore flow to the relationship is by finding new challenges in it.' AND (lines 654-655): 'if [family life] is not [a flow activity], boredom and frustration will inevitably set in, and then the relationship is likely to break up unless there are strong external factors keeping it together.' User stories: 'Pause preserves the work, keeps the door open, and costs nothing' — the retention equivalent is making re-entry effortless so the host who pauses for solitude recovery can return without rebuilding."
      },
      "key_quotes": [
        {
          "source": "flow-solitude-others.txt, lines 293-297",
          "quote": "A person who rarely gets bored, who does not constantly need a favorable external environment to enjoy the moment, has passed the test for having achieved a creative life.",
          "relevance": "This is the retention test: has hosting developed the host's capacity for creative engagement with their living environment? A host who returns to hosting because the activity itself is enjoyable — not because they need the money or fear empty space — has developed autotelic qualities through the experience. The platform's retention strategy should identify and cultivate this autotelic transformation."
        },
        {
          "source": "flow-solitude-others.txt, lines 593-596",
          "quote": "Extrinsic reasons are not the only ones for staying married and for living together in families. There are great opportunities for joy and for growth that can only be experienced in family life, and these intrinsic rewards are no less present now than they were in the past.",
          "relevance": "Retention driven by extrinsic reasons (income) is fragile — it collapses when better alternatives appear or when the social cost exceeds the financial reward. Retention driven by intrinsic rewards (the host enjoys the social complexity, takes pride in well-run cohabitation, has grown through the challenge) is durable. The platform must help hosts discover and articulate these intrinsic rewards."
        },
        {
          "source": "flow-solitude-others.txt, lines 1059-1060",
          "quote": "The larger the social arena one moves in, the greater the challenges it presents.",
          "relevance": "The highest-order retention strategy is escalating the host's challenge from individual hosting to community participation. A host who mentors new hosts, contributes to platform improvement, or builds local hosting networks is operating at a higher level of social complexity — which Csikszentmihalyi predicts will produce deeper flow than any individual hosting arrangement can sustain."
        },
        {
          "source": "user-stories-initial-analysis.md, Pause section",
          "quote": "Pause preserves the work, keeps the door open, and costs nothing. Delete is a one-way door that creates regret.",
          "relevance": "For retention, 'pause' is the mechanism of healthy solitude recovery — the host retreats to restore their psychic energy before re-engaging. Csikszentmihalyi's Dorothy chooses solitude but maintains connection to the world (summer visitors). A host who pauses maintains connection to the platform while recovering from social intensity. Delete severs the connection entirely, requiring the host to rebuild all differentiation work from scratch — a cost that Csikszentmihalyi would predict deters all but the most motivated."
        }
      ]
    }
  },
  "cross_phase_patterns": [
    {
      "pattern": "The Solitude-Companionship Oscillation — the host journey is a continuous alternation between solitude (control of private space) and social engagement (sharing space with a stranger), with each phase demanding a different balance",
      "phases_affected": ["discovery", "listing_creation", "active_lease", "retention"],
      "evidence": "Csikszentmihalyi Ch 8 opens with: 'Whether we are in the company of other people or not makes a great difference to the quality of experience' (lines 30-31). Discovery = full solitude (the host's space is entirely their own). Listing creation = articulating solitude for social consumption (describing private space for public viewing). Active lease = managed oscillation (the guest is present on specific days, absent on others — the Date Change Tool controls this rhythm). Retention = choosing whether to return to full solitude or re-enter the oscillation. The platform's effectiveness depends on how well it helps hosts manage this alternation — not eliminating solitude or social interaction, but making the transitions between them smooth and intentional."
    },
    {
      "pattern": "Differentiation Before Integration — the host must fully express their unique identity (listing creation) before meaningful cohabitation (active lease) is possible",
      "phases_affected": ["listing_creation", "proposal_mgmt", "active_lease"],
      "evidence": "Csikszentmihalyi Ch 8 (lines 668-674): 'Differentiation means that each person is encouraged to develop his or her unique traits... Integration guarantees that what happens to one person will affect all others.' Listing creation IS differentiation: the host articulates house rules, photos, amenities, lifestyle requirements. Proposal management tests differentiation: does this guest's proposal align with the host's articulated identity? Active lease demands integration: both parties must coordinate their divergent goals within the framework the listing established. A weak listing (poor differentiation) produces a weak integration framework during active lease — the host has no clear standards to enforce, the guest has no clear expectations to meet, and entropy follows."
    },
    {
      "pattern": "The Autotelic Development Arc — hosting transforms from an extrinsic transaction to an intrinsic flow activity as the host's skills grow to match the social challenges",
      "phases_affected": ["onboarding", "active_lease", "retention"],
      "evidence": "Csikszentmihalyi Ch 8 (lines 293-297): 'A person who rarely gets bored, who does not constantly need a favorable external environment to enjoy the moment, has passed the test for having achieved a creative life.' In onboarding, hosting is extrinsic (the host seeks income, the platform provides structure). In active lease, the host encounters genuine social challenges (communication, boundary management, conflict resolution) that develop their skills. In retention, the host who has grown through these challenges experiences hosting as intrinsically rewarding — they have become an 'autotelic host' who finds the social complexity enjoyable. The platform should track this arc: does the host's engagement deepen over time, or does it flatten? Deepening engagement signals autotelic development; flattening signals boredom — the 'obvious challenges have been exhausted' (line 729) that precedes dropout."
    },
    {
      "pattern": "Rituals as Entropy Prevention — structured micro-interactions across phases prevent the psychic entropy that unstructured cohabitation would produce",
      "phases_affected": ["listing_creation", "proposal_mgmt", "active_lease"],
      "evidence": "Csikszentmihalyi Ch 8 describes how Dorothy structures every day with strict routines (lines 396-398) and how Susan Butcher's routines 'demand that her consciousness be focused on manageable tasks all of the time — thereby making life a continuous flow experience' (lines 420-422). The platform's rituals serve the same function for the host-guest relationship: the listing wizard structures the differentiation process, the proposal format structures evaluation, the arrival notification structures transitions, cleaning photos structure departures, and per-stay reviews structure reflection. Each ritual converts a potentially anxiety-laden moment into a predictable, manageable task. Without these rituals, the host-guest relationship becomes like the unstructured solitude Csikszentmihalyi describes: 'keeping order in the mind from within is very difficult' (line 199). The rituals keep order in the relationship from without."
    },
    {
      "pattern": "The Wider Community as Retention Infrastructure — moving hosts from individual hosting to community participation escalates challenges and sustains flow beyond what any single lease can provide",
      "phases_affected": ["active_lease", "retention"],
      "evidence": "Csikszentmihalyi Ch 8 (lines 1049-1060): 'A person is part of a family or a friendship to the extent he invests psychic energy in goals shared with other people. In the same way, one can belong to larger interpersonal systems... the larger the social arena one moves in, the greater the challenges it presents.' A host who only hosts is operating at the 'family' level of social complexity — managing one household relationship at a time. A host who participates in a host community (forums, referrals, mentoring, neighborhood networks) operates at the 'wider community' level. This escalation provides the new challenges Csikszentmihalyi says are necessary to prevent boredom in long-term relationships: 'the only way to restore flow to the relationship is by finding new challenges in it' (lines 734-735). User stories document the cross-activation principle: 'When someone who's already used Split Lease applies to a host who's never had a guest, that guest's reputation does the selling.' A host community institutionalizes this cross-activation, turning individual hosting experiences into collective flow."
    }
  ],
  "sources_consulted": [
    "flow-solitude-others.txt — Chapter 8 of Csikszentmihalyi's Flow: The Psychology of Optimal Experience. Sections: The Conflict between Being Alone and Being with Others, The Pain of Loneliness, Taming Solitude, Flow and the Family, Enjoying Friends, The Wider Community. Applied as the primary interpretive lens for the host's experience of managing the solitude-companionship dialectic across all journey phases. Key concepts used: psychic entropy in unstructured solitude, differentiation and integration in household systems, autotelic personality development through social challenge, rituals as flow-enabling structures, the paradox that relationships produce both the best and worst experiences, the wider community as the highest level of social flow.",
    "user-stories-initial-analysis.md — Rod's analysis of user stories. Used for host-side UX principles: value before the ask (flow requires goals before effort), authentication invisibility (flow requires unbroken concentration), completion percentage (flow requires clear feedback), pause vs. delete (healthy solitude recovery vs. permanent exit), urgency surfacing (flow requires timely challenges), messaging as cross-activation (social flow between host and guest begins with communication), structured proposals (ordered consciousness demonstrated through well-formed requests). Document focuses primarily on guest UX but was inverted for host perspective throughout.",
    "split-lease-journey-map.md — Complete host and guest journey map covering 5 phases. Used for concrete journey mechanics and touchpoint identification. Key active_lease mechanisms mapped to Csikszentmihalyi's flow conditions: Stays Manager = temporal integration, cleaning photos = reciprocal feedback, House Manual = differentiation made accessible, Date Change Tool = flexibility of social arrangements, per-stay reviews = escalating challenge through continuous assessment.",
    "inputs/journey-types.json — Phase vocabulary and descriptions for both host and guest journeys. Used to ensure all 8 host phases were addressed and to ground phase descriptions in the platform's own terminology and key concerns (trust, guest quality, effort vs. alternatives, pricing fairness, agent support)."
  ]
}