{
  "lens": {
    "guest_call": "user-stories-initial-analysis.md",
    "book_extract": "flow-conditions-of-flow.txt"
  },
  "reinforcements": [
    {
      "new_element_id": "works-004",
      "existing_element_id": "ds-ui-guest-stays-manager-system1-dashboard",
      "similarity": "Both prescribe an evolving Stays Manager that adapts to the guest's growing skill across 13+ weekly visits. The existing element (from the Kahneman/System 1 lens) designs the Stays Manager as a System 1 Weekly Dashboard with a hero card pattern that reduces cognitive load. The new element (from the Flow lens) adds the complexity ratchet: the page must not only be easy to process but must introduce escalating challenges (orientation checklist, micro-reviews, reflection prompts) matched to the guest's growing platform skill across three lifecycle phases.",
      "combined_evidence": "Kahneman's ego depletion model (existing) says the weekly visit must be a cognitive stroll. Csikszentmihalyi's complexity ratchet (new) says the stroll must lead somewhere new each week or boredom ensues. Combined: the hero card pattern provides the stable, low-effort structure; the phased content evolution provides the challenge escalation. The hero card IS the stable skeleton; the evolving content within it IS the complexity ratchet. These are complementary, not redundant.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-002",
      "existing_element_id": "ds-ui-host-instant-acknowledgment",
      "similarity": "Both prescribe sub-200ms feedback on every user action. The existing element (Motion as Confirmation, from Kahneman lens) specifies sub-100ms acknowledgment and 300ms settle for host interactions. The new element (Continuous Feedback During Action, from Flow lens) extends this to the entire guest journey and adds a two-phase cascade (acknowledgment then resolution) plus async feedback for cross-activation events (host-viewed, host-typing signals).",
      "combined_evidence": "The existing element proved that fast acknowledgment reduces cognitive effort (System 2 does not need to wonder 'did that work?'). The new element adds the Flow justification: feedback is one of four necessary conditions for flow, and feedback vacuums during async waits (proposal submission, negotiation) are as damaging as slow direct-action responses. Combined insight: sub-200ms for direct actions PLUS status cascade for async events covers the full feedback spectrum.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "works-001",
      "existing_element_id": "ds-ui-host-system1-trust-gate",
      "similarity": "Both address the anxiety that occurs at phase transitions. The existing element (System 1 Trust Gate) prescribes visual consistency and familiar language at every host-journey phase transition to pass System 1's automatic assessment. The new element (Challenge-Skill Escalation Ladder) prescribes intermediate-challenge actions (messaging, saving, comparing) at every guest-journey phase transition to prevent the skill-challenge gap from pushing guests into anxiety (A3).",
      "combined_evidence": "Kahneman's System 1 trust gate (existing) addresses the cognitive mechanism: does the new context feel familiar? Csikszentmihalyi's A3 anxiety zone (new) addresses the experiential mechanism: does the guest feel capable of the next challenge? Combined: phase transitions must both LOOK familiar (System 1 approval) and FEEL achievable (challenge-skill balance). The escalation ladder adds intermediate actions that the trust gate alone does not provide.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "behaves-002",
      "existing_element_id": "ds-ui-guest-save-and-resume",
      "similarity": "Both address preserving the guest's state across interruptions. The existing element (Save-and-Resume) focuses on preserving progress across sessions for multi-step processes. The new element (Contextual Continuity Preservation) extends this to real-time spatial continuity: search state, scroll position, map zoom, and filter selections must persist across in-session transitions (search-to-listing, listing-to-proposal, auth modals).",
      "combined_evidence": "Save-and-Resume (existing) handles the between-session case (guest leaves and returns). Contextual Continuity (new) handles the within-session case (guest navigates between contexts without leaving). Combined: the platform must preserve state at both temporal scales -- across sessions AND across in-session transitions. The Flow lens adds a stronger justification: concentration preservation, not just convenience.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "communicates-003",
      "existing_element_id": "ds-ui-host-trust-credential-stack",
      "similarity": "Both prescribe a structured trust information hierarchy that leads with verifiable mechanisms before claims. The existing element (Trust Credential Stack, from Kahneman lens) specifies process-before-promise for host-facing trust signals. The new element (Trust Information Architecture, from Flow lens) distributes trust signals across all guest-facing pre-commitment phases, calibrated to each phase's decision gate: platform legitimacy at discovery, host credibility at search, evidence-based trust at listing evaluation, commitment-safety at proposal.",
      "combined_evidence": "The existing element established the principle: mechanism before promise. The new element extends it across the full guest journey with phase-specific calibration. Combined: trust signals must be both structurally honest (mechanism first, per existing) and temporally distributed (present at every decision gate, per new). The Flow lens adds Csikszentmihalyi's 'commitment' trait from the autotelic family context: trust enables unselfconscious involvement, which is a prerequisite for flow.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "behaves-005",
      "existing_element_id": "ds-ui-guest-proposal-pipeline-status",
      "similarity": "Both address the feedback vacuum during cross-activation events, particularly proposal submission and negotiation. The existing element (Proposal Pipeline as Anxiety-Resolving Status Stream) provides status visibility throughout the proposal lifecycle. The new element (Cross-Activation Events as Conversational Interactions) reframes all cross-activation moments -- messaging, proposals, negotiation, reviews -- as social flow activities with conversational feedback (host profile, typing indicators, response time estimates, staggered pre-population).",
      "combined_evidence": "The existing element solves the status-visibility problem for proposals specifically. The new element generalizes this to all cross-activation events and adds the social dimension: showing the host's profile alongside the message composer, framing negotiation as collaborative agon, presenting reviews as community contributions. Combined: status visibility (existing) plus social framing (new) transforms cross-activation from transactional to relational.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "behaves-004",
      "existing_element_id": "ds-ui-guest-weekly-glance",
      "similarity": "Both address how the Stays Manager should feel on repeated weekly visits. The existing element (The Weekly Glance: From Vigilance to Ease Over 13 Weeks) prescribes a progressive relaxation of the Stays Manager as the guest grows comfortable. The new element (Stays Manager Complexity Ratchet) prescribes three lifecycle phases with escalating interaction complexity: orientation (weeks 1-3), rhythm (weeks 4-9), reflection (weeks 10-13).",
      "combined_evidence": "The existing element focuses on reducing effort over time (vigilance to ease). The new element focuses on increasing challenge over time (complexity ratchet). These seem contradictory but are complementary: the STRUCTURE becomes easier (guest knows where to look) while the CONTENT becomes richer (new actions and prompts appear). Csikszentmihalyi's autotelic family context requires both clarity (stable, easy structure) and challenge (evolving content). Combined: the weekly glance pattern provides structural ease; the complexity ratchet provides content evolution within that stable structure.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "communicates-001",
      "existing_element_id": "ds-ui-host-progressive-disclosure",
      "similarity": "Both prescribe progressive disclosure of information matched to user readiness. The existing element (Progressive Disclosure Through Visual Weight) uses visual weight tiers (dense content fades, not hides) for the host journey. The new element (Progressive Disclosure Matched to Challenge-Skill Balance) structures guest-facing information in three tiers matched to the guest's escalating search skill: Tier 1 (photo+price+location), Tier 2 (neighborhood+availability on hover), Tier 3 (reviews+rules on listing page).",
      "combined_evidence": "The existing element establishes the visual mechanism (weight tiers). The new element applies it specifically to the guest search experience with Flow-derived skill-challenge calibration. Combined: progressive disclosure is both a visual design principle (existing) and a flow-maintenance mechanism (new). The Flow lens adds the theoretical justification: information complexity must match the guest's growing skill or boredom (too little) or anxiety (too much) results.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "feels-004",
      "existing_element_id": "ds-ui-host-pre-packaged-proposal",
      "similarity": "Both prescribe pre-populated proposal forms that frame the user's task as confirmation rather than construction. The existing element (Pre-Packaged Proposal, from Kahneman lens) presents host-side proposals as confirmable packages rather than multi-field forms. The new element (Proposal Creation as Confident Assembly, from Flow lens) applies the same principle to guest-side proposal creation: pre-populated dates, real-time price calculation, and a host-view preview that reduces self-consciousness.",
      "combined_evidence": "The existing element reduces cognitive effort (Kahneman's depleted user). The new element reduces self-consciousness (Csikszentmihalyi's flow inhibitor). Combined: pre-populated proposals serve dual purposes -- they save mental effort AND reduce the anxiety of composing something from scratch. The Flow lens adds the emotional dimension: the guest sees the 'right answer' before they act, which transforms the experience from anxious form-filling to confident assembly.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "feels-001",
      "existing_element_id": "ds-ui-guest-discovery-promise",
      "similarity": "Both address the guest's first emotional experience at discovery. The existing element (The Discovery Promise, from Kahneman/prospect theory lens) focuses on setting honest expectations that survive contact with reality. The new element (Discovery as Entering a Distinct World, from Flow lens) focuses on creating the sense of discovery by showing real listings immediately without sign-up gates or marketing copy.",
      "combined_evidence": "The existing element addresses expectation accuracy (promise matches reality). The new element addresses emotional distinctiveness (the platform feels different from everyday browsing). Combined: discovery must both feel distinct (Flow's requirement that flow activities differ from the paramount reality) AND set accurate expectations (Kahneman's insight about reference points). Honest expectations + immediate value = a discovery experience that is both engaging and trustworthy.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "looks-001",
      "existing_element_id": "ds-ui-guest-schedule-first-listing-cards",
      "similarity": "Both address listing card design in search results. The existing element (Schedule-First Listing Cards) leads with schedule pattern fit as the primary signal. The new element (Progressive Visual Density) adds three visual density tiers that reveal richer layers on interaction (hover for Tier 2, expanded preview for Tier 3).",
      "combined_evidence": "The existing element determines WHAT information appears first on the card (schedule fit). The new element determines HOW information depth scales with interaction (progressive density). Combined: the Tier 1 card should lead with schedule fit (existing) and reveal richer data on hover (new). These are orthogonal and composable: schedule-first is the content hierarchy; progressive density is the interaction model.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "communicates-006",
      "existing_element_id": "ds-ui-guest-negotiation-feedback",
      "similarity": "Both address the information gap during negotiation. The existing element (Provide Immediate, Informative Feedback at Every Negotiation Action, from Norman lens) prescribes clear feedback on negotiation actions using signifiers and status indicators. The new element (Negotiation Information Architecture: Calibration Data) adds market context data, side-by-side comparison, and modification options beyond accept/reject.",
      "combined_evidence": "The existing element addresses feedback clarity within the negotiation interface (Norman's feedback principle). The new element addresses information completeness: the guest needs calibration data (market averages, host patterns) to evaluate whether a counter-offer is reasonable, plus action options beyond binary accept/reject to prevent Csikszentmihalyi's alienation. Combined: negotiation needs both clear feedback (existing) AND rich context (new) to function as a flow activity rather than a gamble.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "feels-006",
      "existing_element_id": "ds-ui-guest-booking-confirmation",
      "similarity": "Both address the acceptance/confirmation moment. The existing element (a booking confirmation screen that produces grounded confidence) avoids celebration theatrics and provides a 'What happens next' roadmap. The new element (Acceptance as Transformation, from Flow lens) adds a two-beat structure: brief celebration acknowledging the journey completed, immediately followed by orientation toward move-in preparation.",
      "combined_evidence": "The existing element avoids over-celebrating. The new element adds emotional acknowledgment that the guest completed a multi-phase journey. Combined: acceptance should be grounded (existing) but not emotionally flat (new). The two-beat structure from the Flow lens -- brief celebration then immediate orientation -- balances emotional resonance with practical forward momentum.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-006",
      "existing_element_id": "ds-ui-guest-no-signup-discovery",
      "similarity": "Both prescribe showing value before requiring identity investment. The existing element (first screen with no sign-up gate, from Cold Start/network effects lens) shows listings and trust signals before any account creation. The new element (Value-Before-Investment as Flow Entry Gate, from Flow lens) provides the theoretical framework: flow requires the activity to be 'distinct from the paramount reality,' and a sign-up gate IS the paramount reality of web browsing.",
      "combined_evidence": "The existing element establishes the design pattern (no gate, show listings first). The new element adds the Flow-theoretical justification and extends the pattern to progressive profile building (request additional data contextually during later interactions, not upfront). Combined: value-before-investment is both a conversion optimization (existing) AND a flow prerequisite (new). The Flow lens elevates it from a UX best practice to a structural requirement for engagement.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "communicates-004",
      "existing_element_id": "ds-ui-guest-batched-review-prompts",
      "similarity": "Both address how the Stays Manager should present review opportunities during active lease. The existing element (Batched Review Prompts at Natural Reflection Points) prescribes 3 review moments (Week 4, midpoint, final) instead of 13 weekly prompts. The new element (Stays Manager Temporal Information Architecture) proposes a three-phase content evolution (orientation, rhythm, reflection) where review prompts surface as phase-appropriate engagement.",
      "combined_evidence": "The existing element solves review fatigue by batching to 3 moments. The new element provides the temporal framework that explains WHY those 3 moments work: they correspond to natural lifecycle transitions (settling in, established routine, preparing to leave). Combined: the 3-point batching (existing) fits perfectly within the 3-phase temporal architecture (new). Orientation phase has no reviews. Rhythm phase has the mid-point review. Reflection phase has the final review. The first review at Week 4 bridges orientation and rhythm.",
      "recommendation": "merge"
    }
  ],
  "contradictions": [
    {
      "new_element_id": "behaves-004",
      "existing_element_id": "ds-ui-guest-batched-review-prompts",
      "conflict": "The new element (Stays Manager Complexity Ratchet) proposes one-tap micro-review prompts after EACH completed stay cycle during the rhythm phase (weeks 4-9), creating potentially 6 weekly review moments. The existing element (Batched Review Prompts) explicitly warns against per-stay review prompts: 'DO NOT prompt for a review after every single stay. Weekly review prompts create fatigue that reduces both completion rate and review quality.' The existing element prescribes only 3 review moments across the entire lease.",
      "evidence_comparison": "The existing element draws from Kahneman's ego depletion research: 13 micro-reviews cumulatively overwhelm. The new element draws from Csikszentmihalyi's complexity ratchet: the guest needs escalating challenges, and micro-reviews serve as weekly flow activities. The tension is real: Kahneman says fewer reviews preserve cognitive resources; Csikszentmihalyi says more engagement opportunities prevent boredom. The resolution likely lies in making micro-reviews truly micro (one-tap rating, no text required) while keeping narrative reviews batched to 3 moments.",
      "recommendation": "Adopt a hybrid: use the existing element's 3-point narrative review structure as the primary review mechanism. Add the new element's one-tap micro-rating (a single 5-point scale, no text, no expansion unless the guest initiates) as an optional, low-effort engagement signal during rhythm phase. The micro-rating should never feel mandatory or accumulate as unaddressed tasks. It is an invitation, not an obligation.",
      "severity": "warning"
    },
    {
      "new_element_id": "looks-001",
      "existing_element_id": "tokens-json",
      "conflict": "The new element specifies --font-inter as the primary typeface, --secondary-purple as the primary interactive color, and --shadow-purple-md as a brand-tinted shadow. However, tokens.json uses Outfit as the sans-serif typeface, #2d5a3d (warm green) as the accent color, and Instrument Serif as the serif typeface. The production style guide (Style-guide.md) uses Inter for labels and the purple palette (#31135D primary, rgb(109,49,194) secondary).",
      "evidence_comparison": "This is the known token drift flagged in MEMORY.md: tokens.json uses warm green accent while production uses purple. The new elements correctly reference the production style guide's purple palette and Inter typeface. tokens.json is the outdated reference.",
      "recommendation": "No action needed on the new elements -- they correctly follow production CSS variables from Style-guide.md. tokens.json should be updated to match production values. This is an existing issue, not a new contradiction introduced by this run.",
      "severity": "warning"
    },
    {
      "new_element_id": "looks-006",
      "existing_element_id": "ds-ui-host-green-trust-badges",
      "conflict": "The existing element (Green Trust Badges) reserves the accent color (green in tokens.json, which maps to purple in production) exclusively for verified and guaranteed elements. The new element (Trust Signal Visual Grammar) proposes a unified trust badge system using --text-gray on --bg-light-gray pills with a shield-check icon. These are different visual treatments for trust: the existing element uses color exclusivity (one color = trust); the new element uses a consistent badge grammar (icon + pill pattern = trust).",
      "evidence_comparison": "The existing element's principle is sound: a single color reserved for trust creates a learned association. The new element's principle is also sound: a consistent badge pattern across all phases creates recognizable trust grammar. They are not strictly contradictory -- the badge pill could use the trust-reserved color as its accent. The risk is if both systems are implemented independently, creating two competing trust visual languages.",
      "recommendation": "Unify: use the new element's shield-check + pill pattern as the trust badge structure, but apply the existing element's color-reservation principle to the pill. The pill should use the trust-reserved color (production purple accent) as a subtle tint rather than neutral gray, creating a single visual language where both the pattern AND the color signal trust. This merges the recognition speed of a distinctive color with the scalability of a consistent component pattern.",
      "severity": "warning"
    }
  ],
  "extensions": [
    {
      "new_element_id": "works-007",
      "gap_filled": "No existing element provides a universal design checklist derived from a psychological framework that applies to every phase. The Autotelic Platform Context (clarity, centering, choice, commitment, challenge) fills this gap by providing five verifiable traits that can be audited at every phase. The library has phase-specific elements but lacks a cross-phase quality framework.",
      "confidence_note": "High confidence. The five autotelic traits map directly to identifiable design requirements: clarity = next-step communication, centering = present-tense content, choice = multiple actions, commitment = trust signals, challenge = progressive complexity. Each trait is independently testable."
    },
    {
      "new_element_id": "communicates-005",
      "gap_filled": "No existing element prescribes a goal-first information hierarchy at phase entry points. The library has anchor-then-advance (showing known data first) for host screens but no equivalent for guest screens. This element fills the gap: at every phase entry, the achievable goal must be the first thing the guest perceives (listings at discovery, results at search, availability at listing evaluation), not the mechanism (sign-up form, filter panel, photo carousel).",
      "confidence_note": "High confidence. The goal-first pattern is supported by both the user stories ('show something useful first') and Flow's requirement that activities 'set up goals.' It generalizes the existing anchor-then-advance principle to guest contexts."
    },
    {
      "new_element_id": "looks-002",
      "gap_filled": "No existing element addresses the map's visual behavior in detail. The library has schedule-first listing cards and space composition cards but no specification for how the map responds to guest interaction. This element fills the gap: pin proximity scaling, neighborhood boundary reveal on dwell, transit icon fade-in, and price label appearance on zoom-in. The map becomes a visual feedback system rather than a static reference.",
      "confidence_note": "High confidence. The user stories explicitly request a map that 'feels alive.' This element provides the visual specification that no existing element addresses."
    },
    {
      "new_element_id": "behaves-006",
      "gap_filled": "No existing element treats error states as flow redirection opportunities. The library has save-and-resume for session recovery but no specification for how errors should redirect the guest's psychic energy to productive actions. This element fills the gap: every error becomes adjacent to at least one forward-moving action (similar listings for unavailable ones, retry with preserved data for submission failures, alternative auth methods for login errors).",
      "confidence_note": "High confidence. Error recovery as flow redirection is a novel application of Csikszentmihalyi's framework that no prior lens has addressed. The principle that errors should never be dead ends extends the platform's defensive construction against chaos."
    },
    {
      "new_element_id": "feels-005",
      "gap_filled": "No existing element addresses negotiation as an emotional experience. The library has negotiation feedback (Norman lens) and proposal pipeline status but no specification for the emotional design of the counter-offer moment. This element fills the gap: framing negotiation as collaborative game (agon), providing agency through modification options, and reducing anomie through market calibration data.",
      "confidence_note": "Medium-high confidence. The agonistic framing is theoretically strong (Csikszentmihalyi's agon concept maps well to negotiation), but implementation depends on having sufficient market data to provide calibration context. If market data is sparse, the calibration signals may feel speculative."
    },
    {
      "new_element_id": "feels-003",
      "gap_filled": "No existing element addresses the emotional design of the guest-to-host messaging interaction. The library has messaging as a cross-activation concept but no specification for how the message composer should feel: host profile visible alongside, suggested questions, response time indicators, and the emotional arc from desire through connection to confidence.",
      "confidence_note": "High confidence. Messaging is identified as the highest cross-activation story in the user stories analysis. The emotional specification for the composer interaction is a critical gap."
    },
    {
      "new_element_id": "looks-004",
      "gap_filled": "No existing element specifies the visual design of the proposal form as a continuation of the listing page rather than a separate form context. The library has pre-packaged proposals (host side) and proposal pipeline status but no visual specification for how the guest-side proposal form should look and feel: pre-populated fields with listing data, real-time price feedback with purple highlight pulse, and a host-view preview card.",
      "confidence_note": "High confidence. The visual continuity between listing evaluation and proposal creation is identified by both the user stories and the Flow framework as critical to preventing dropout at the highest-stakes moment."
    }
  ],
  "token_compliance": {
    "new_tokens_flagged": [
      {
        "token": "--font-inter",
        "issue": "tokens.json uses 'Outfit' as the sans-serif font, but production CSS and Style-guide.md do not specify Inter either. The L3 elements reference Inter throughout. Verify which typeface is canonical in production.",
        "severity": "info"
      },
      {
        "token": "--accent-coral (proposed for save-heart in looks-001)",
        "issue": "No coral color exists in tokens.json or Style-guide.md. If a save/favorite interaction needs a distinct color, it should use an existing palette color (possibly --accent-purple or a status color) rather than introducing a new hue.",
        "severity": "warning"
      },
      {
        "token": "--shadow-purple-md",
        "issue": "No purple-tinted shadow exists in tokens.json (shadows use rgba(26,23,20,X)). Style-guide.md does not define purple shadows either. The L3 elements propose this as a brand-specific shadow. If adopted, it should be added to the production token set.",
        "severity": "info"
      },
      {
        "token": "--status-warning #C4841D (proposed in looks-005)",
        "issue": "tokens.json defines signal-warn as #c17a28. Style-guide.md may define a different warning color. The proposed #C4841D is close but not identical. Align to whichever is canonical.",
        "severity": "info"
      },
      {
        "token": "--bg-info #f0f7ff (proposed in looks-006)",
        "issue": "tokens.json defines signal-info-bg as #e8f0fa. The proposed #f0f7ff is lighter. Recommend aligning to the existing token or documenting why a lighter variant is needed.",
        "severity": "info"
      }
    ],
    "recommendation": "The new elements correctly reference the production purple palette from Style-guide.md rather than the outdated green accent in tokens.json. The primary compliance issue is the persistent token drift between tokens.json and production CSS. Recommend a one-time reconciliation of tokens.json to match Style-guide.md production values, then validate that all new proposed tokens (card-hover-translate-y, map-pin sizes, stays-timeline-segment-width, etc.) are formally added to the token set before implementation. The proposed coral accent should be replaced with an existing palette color."
  },
  "emotional_arc_check": {
    "journey_emotion_map": [
      {
        "phase": "discovery",
        "target_emotions": ["curiosity", "permission"],
        "source_element": "feels-001",
        "arc_note": "The guest must feel that this platform is distinct from everyday browsing. Curiosity is the entry emotion; permission (from trust signals) allows them to invest attention."
      },
      {
        "phase": "search",
        "target_emotions": ["absorption", "discovery"],
        "source_element": "feels-002",
        "arc_note": "Search should feel like active exploration. The map and cards must respond to interaction, creating the sense of discovery that sustains flow. If absorption is not achieved here, the guest will not progress."
      },
      {
        "phase": "listing_evaluation",
        "target_emotions": ["connection", "cautious_investment"],
        "source_element": "feels-003",
        "arc_note": "Messaging transforms the guest from solitary evaluator to social participant. The emotional bridge from evaluation to commitment runs through human connection with the host."
      },
      {
        "phase": "proposal_creation",
        "target_emotions": ["confidence", "agency"],
        "source_element": "feels-004",
        "arc_note": "Pre-populated fields and host-view preview replace self-consciousness with knowledge. The guest should feel like they are assembling a strong offer, not filling out a scary form."
      },
      {
        "phase": "negotiation",
        "target_emotions": ["agency", "collaborative_tension"],
        "source_element": "feels-005",
        "arc_note": "Negotiation must feel like con petire (seeking together), not an ultimatum. Market calibration and modification options replace powerlessness with informed participation."
      },
      {
        "phase": "acceptance",
        "target_emotions": ["accomplishment", "anticipation"],
        "source_element": "feels-006",
        "arc_note": "Two-beat design: brief celebration of the completed journey, then immediate orientation toward what comes next. Accomplishment must flow into anticipation, not into a post-decision vacuum."
      },
      {
        "phase": "move_in",
        "target_emotions": ["orientation", "grounded_excitement"],
        "source_element": "feels-006",
        "arc_note": "The platform must create order in the chaotic move-in experience. The House Manual and arrival protocols serve as Csikszentmihalyi's 'culture' -- defensive constructions against chaos."
      },
      {
        "phase": "active_lease",
        "target_emotions": ["belonging", "evolving_mastery"],
        "source_element": "feels-007",
        "arc_note": "The Stays Manager transforms from orientation tool to weekly ritual. The guest should feel known, valued, and progressively more capable across 13+ visits. Belonging is the sustained emotion; boredom is the primary threat."
      }
    ],
    "arc_conflicts": [
      {
        "conflict": "The transition from negotiation (agency/tension) to acceptance (accomplishment) has no emotional bridge if the guest accepts the host's counter without modification. The guest may feel they 'gave in' rather than 'achieved a result.' The acceptance celebration must acknowledge the full journey, including the negotiation challenge, to reframe acceptance as an achievement even when the guest did not 'win' the negotiation.",
        "phases_affected": ["negotiation", "acceptance"],
        "severity": "warning"
      },
      {
        "conflict": "Move-in has the weakest emotional specification of any phase. L5 does not include a dedicated move-in emotional element; feels-006 covers acceptance and move-in together. The physical-to-digital transition at move-in is the most emotionally vulnerable moment and needs its own dedicated emotional design.",
        "phases_affected": ["move_in"],
        "severity": "warning"
      }
    ],
    "arc_assessment": "The emotional arc is coherent and well-structured across the eight guest phases. The progression from curiosity (discovery) through absorption (search), connection (listing evaluation), confidence (proposal), agency (negotiation), accomplishment (acceptance), orientation (move-in), and belonging (active lease) follows a natural escalation that matches Csikszentmihalyi's complexity ratchet. Two gaps exist: (1) the negotiation-to-acceptance emotional bridge needs explicit design for cases where the guest accepts terms they did not propose; (2) move-in needs a dedicated emotional element separate from acceptance. The active_lease phase has the strongest emotional specification, consistent with its importance as the highest-frequency touchpoint."
  },
  "coverage_map": {
    "discovery": {
      "element_count": 7,
      "coverage": "moderate",
      "elements": ["works-006", "works-007", "communicates-001", "communicates-003", "communicates-005", "feels-001", "behaves-007"],
      "note": "Good coverage of value-before-investment and trust architecture. The autotelic checklist (works-007) provides a universal audit framework. Gap: no dedicated visual element for the discovery landing experience."
    },
    "search": {
      "element_count": 12,
      "coverage": "strong",
      "elements": ["works-001", "works-002", "works-003", "works-006", "works-007", "communicates-001", "communicates-002", "communicates-005", "communicates-007", "looks-001", "looks-002", "looks-003", "looks-007", "behaves-001", "behaves-002", "behaves-003", "behaves-007", "feels-002", "feels-008"],
      "note": "Strongest pre-commitment coverage. Progressive card density, alive map, contextual continuity, and real-time feedback are all addressed across all five layers. Multiple elements converge on the card hover interaction."
    },
    "listing_evaluation": {
      "element_count": 11,
      "coverage": "strong",
      "elements": ["works-001", "works-005", "works-007", "communicates-001", "communicates-003", "communicates-005", "communicates-007", "looks-001", "looks-003", "looks-006", "behaves-002", "behaves-003", "behaves-005", "behaves-007", "feels-003", "feels-008"],
      "note": "Strong coverage. Messaging as emotional bridge, trust information at the evaluation gate, and challenge-skill escalation from evaluation to proposal are all addressed. The pre-proposal intermediate action (messaging) is well-specified."
    },
    "proposal_creation": {
      "element_count": 10,
      "coverage": "strong",
      "elements": ["works-001", "works-002", "works-005", "works-007", "communicates-002", "communicates-003", "communicates-005", "communicates-007", "looks-003", "looks-004", "looks-006", "looks-007", "behaves-001", "behaves-002", "behaves-003", "behaves-005", "feels-004", "feels-008"],
      "note": "Strongest single-phase coverage. Pre-populated forms, real-time price feedback, host-view preview, visual continuity from listing, and concentration preservation during auth are all specified. This run's Flow lens adds the emotional dimension (confidence vs. self-consciousness) that prior lenses did not address."
    },
    "negotiation": {
      "element_count": 6,
      "coverage": "moderate",
      "elements": ["works-002", "works-005", "works-007", "communicates-002", "communicates-006", "behaves-005", "feels-005", "looks-007"],
      "note": "Moderate coverage with critical extension. The calibration data architecture (communicates-006) and agonistic emotional framing (feels-005) are new to the library. The modification option beyond accept/reject is a significant contribution. Gap: no dedicated visual element for the negotiation side-by-side comparison interface."
    },
    "acceptance": {
      "element_count": 4,
      "coverage": "thin",
      "elements": ["works-007", "communicates-005", "feels-006", "behaves-006"],
      "note": "Thin coverage. The two-beat celebration+orientation pattern (feels-006) is the primary contribution. The autotelic checklist (works-007) applies generally. Gap: no dedicated visual element for the acceptance confirmation experience. No dedicated interaction pattern for the acceptance-to-move-in transition."
    },
    "move_in": {
      "element_count": 3,
      "coverage": "thin",
      "elements": ["works-007", "communicates-005", "feels-006", "behaves-006"],
      "note": "Weakest coverage, consistent with L0's observation that move-in has the fewest library elements (25 of 420). The Flow lens reveals that move-in is where the physical world interrupts the digital flow channel, but no elements specifically address how to extend the platform's flow structure into the physical move-in experience. This is a known gap that persists."
    },
    "active_lease": {
      "element_count": 12,
      "coverage": "strong",
      "elements": ["works-004", "works-005", "works-007", "communicates-002", "communicates-004", "looks-005", "looks-007", "behaves-001", "behaves-004", "behaves-005", "behaves-006", "feels-007"],
      "note": "Strongest overall coverage, appropriately. The complexity ratchet (works-004), temporal information architecture (communicates-004), visual evolution (looks-005), three-phase interaction surface (behaves-004), and weekly ritual emotional design (feels-007) collectively address the Stays Manager's role as the platform's primary engagement surface across 13+ visits. The existing library's 126 active_lease elements are strongly reinforced."
    }
  },
  "loop_back_recommendations": [
    {
      "target_layer": "L3",
      "element": "looks-001",
      "recommendation": "Replace the proposed --accent-coral for the save-heart icon with an existing palette color. The production style guide does not include coral. Consider using --accent-purple at reduced opacity or --secondary-purple for the save affordance.",
      "priority": "low"
    },
    {
      "target_layer": "L3",
      "element": "looks-006",
      "recommendation": "Reconcile the trust badge visual grammar with the existing Green Trust Badges element. The L3 element proposes neutral gray pills; the existing library uses color-reserved badges. Propose a unified approach: shield-check icon + pill structure (new pattern) with the trust-reserved purple accent color (existing principle).",
      "priority": "medium"
    },
    {
      "target_layer": "L4",
      "element": "behaves-004",
      "recommendation": "Reconcile the weekly micro-review interaction with the existing Batched Review Prompts element. The L4 complexity ratchet proposes one-tap micro-reviews after each stay cycle; the existing library explicitly prohibits per-stay review prompts. Adopt a hybrid: 3-point narrative reviews (existing) plus optional one-tap micro-ratings during rhythm phase (new) that are truly micro (single tap, no text, no accumulation as unaddressed tasks).",
      "priority": "high"
    },
    {
      "target_layer": "L5",
      "element": "feels-006",
      "recommendation": "Split the acceptance and move-in emotional specification into two separate elements. The current feels-006 covers both phases, but move-in deserves its own dedicated emotional element addressing the physical-to-digital transition, the House Manual as a flow-enabling cultural document, and the first-night anxiety reduction pattern.",
      "priority": "medium"
    },
    {
      "target_layer": "L0",
      "element": "journey-context",
      "recommendation": "The L0 analysis identifies move-in as the weakest phase (25 library elements) and this run did not substantially close the gap. Consider a dedicated future run with a lens focused on the physical-to-digital transition (e.g., Norman's 'knowledge in the world' chapter or Csikszentmihalyi's chapter on creating flow in everyday life) combined with a guest call that discusses the move-in experience.",
      "priority": "medium"
    }
  ]
}