{
  "lens": {
    "host_call": "user-stories-initial-analysis.md",
    "book_extract": "becker-terror-vital-lie.txt"
  },
  "reinforcements": [
    {
      "new_element_id": "works-001 (Incremental Armor-Shedding Listing Wizard)",
      "existing_element_id": "works-001 (Graduate Instinctual Renunciation Across the Phase Sequence) [Freud 1830 run]",
      "similarity": "Both elements prescribe fragmented, step-by-step listing creation to manage the escalating psychological cost of self-exposure. The existing element uses Freud's instinctual renunciation gradient to mandate value-delivery before every demand. The new element uses Becker's character armor and Perls' four neurotic layers to prescribe beaver-sized pieces that prevent the host from confronting the totality of exposure. Both identify listing_creation as the peak vulnerability phase and prescribe the same structural remedy: progressive fragmentation with intervening rewards.",
      "combined_evidence": "Freud evidence: 'if the deprivation is not made good economically, one may be certain of producing serious disorders.' Becker evidence: 'He doesn't bite the world off in one piece as a giant would, but in small manageable pieces, as a beaver does.' The combined insight is that the cost is both instinctual (Freud: host sacrifices privacy) and existential (Becker: host sheds character armor protecting their hero system). Both must be offset at each step transition. The Becker lens adds the specific mechanism: each wizard step must simultaneously remove one thin layer of armor AND provide a platform-mediated replacement defense (progress indicator, saved state, pre-populated defaults).",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-002 (Pause-as-Armor Listing State)",
      "existing_element_id": "works-002 (Preserve Reversibility to Contain the Revolt Against Civilization) [Freud 1830 run]",
      "similarity": "Both prescribe pause-over-delete as the primary deactivation mechanism. The existing element frames pause as containing Freud's revolt against civilization -- temporary autonomy-seeking that remains compatible with marketplace participation. The new element frames pause as Becker's middle path between the terror of continued exposure and the grief of destroying a hero system built at existential cost. Both agree that delete creates irreversible psychological damage.",
      "combined_evidence": "Freud evidence: two types of freedom-seeking (civilized revolt vs. primitive autonomy). Becker evidence: 'Repression is not simply a negative force opposing life energies; it lives on life energies and uses them creatively.' Rod's user stories: 'Pause matters more than delete.' The combined insight: pause contains both the civilizational revolt (Freud) and the character-armor retreat (Becker) in a single, reversible action. The Becker lens adds the emotional specificity: the host who pauses is maintaining the vital lie that they are 'still a host' without bearing the cost of active stranger-availability.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-003 (Stranger-Vetting Proposal Interface)",
      "existing_element_id": "works-003 (Structure Guest Proposals as Civilizational Compliance Signals) [Freud 1830 run]",
      "similarity": "Both prescribe that proposals must arrive pre-structured with trust-relevant information prominently displayed. The existing element uses Freud's insight that proposal structure is itself a civilizational compliance signal -- demonstrating the guest has submitted to marketplace rules. The new element uses Becker's framework of delegated powers: an experienced guest's review history functions as borrowed character armor that allows the host to process the stranger as manageable rather than terrifying.",
      "combined_evidence": "Freud evidence: 'men are not gentle, friendly creatures.' Becker evidence: 'Each thing, in order to deliciously expand, is forever gobbling up others.' Rod's user stories: 'A well-structured proposal activates the host to respond.' The combined insight: pre-structuring reduces both civilizational threat (Freud: stranger as uncivilized) and existential terror (Becker: stranger as death-symbol). The Becker lens adds the counter-offer mechanism as a character defense: shortening duration is the host asserting temporal control over their own vulnerability.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-004 (Default-Delegated Pricing Engine)",
      "existing_element_id": "communicates-005 (Pricing Defaults as Delegated Judgment Architecture) [existing library communicates layer]",
      "similarity": "Both prescribe pre-populated pricing defaults as the host's primary anxiety buffer. The existing element frames defaults as progressive disclosure architecture. The new element frames defaults as Becker's other-power delegation: the platform absorbs the existential burden of self-valuation on the host's behalf, converting the terrifying question 'What am I worth?' into a simple confirmation.",
      "combined_evidence": "Existing evidence: 'Value before the ask -- always.' Becker evidence: 'We don't want to admit that we do not stand alone, that we always rely on something that transcends us.' The combined insight: defaults function simultaneously as information architecture (showing the recommendation before asking for agreement) and as psychological infrastructure (the platform-as-transcendent-system making the most anxiety-laden decision for the host). The Becker lens adds the guaranteed income projection as an 'immunity bath' against financial death anxiety.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-005 (Ritual Control Dashboard for Active Lease)",
      "existing_element_id": "works-004 (Use Repetitive Rituals to Contain Active-Lease Anxiety) [Freud 1830 run]",
      "similarity": "Both prescribe a dashboard of micro-rituals (arrival confirmations, cleaning photo reviews, date change requests) as the primary mechanism for managing the sustained anxiety of active lease. The existing element uses Freud's order-as-repetition-compulsion. The new element uses Becker's self-preservation instinct and the concept of the manageable world reduced to a screen of actionable items.",
      "combined_evidence": "Freud evidence: 'order is a kind of repetition-compulsion by which doubt and hesitation shall be avoided.' Becker evidence: 'Such constant expenditure of psychological energy on the business of preserving life would be impossible if the fear of death were not as constant.' Rod's user stories: 'Urgency should surface first on the dashboard.' The combined insight: the dashboard is both civilizational order (Freud: predictable rituals reduce doubt) and character armor externalized (Becker: the host's self-preservation instinct given a concrete outlet). Both lenses converge on the same prescription: fixed-position, urgency-first, ritual-based.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "works-006 (Immortality-Project Retention Loop)",
      "existing_element_id": "works-005 (Build Host Identity as Civilizational Binding for Retention) [Freud 1830 run]",
      "similarity": "Both address retention through identity-level narrative. The existing element uses Freud's narcissism of minor differences: small grievances outweigh cumulative benefits, so cumulative identity metrics must counteract this. The new element uses Becker's immortality project: hosting must be reframed as a contribution that transcends the individual transaction, providing the narcissistic supply needed to sustain the expanded hero system.",
      "combined_evidence": "Freud evidence: 'unite men in love towards one another.' Becker evidence: 'The irony of man's condition is that the deepest need is to be free of the anxiety of death and annihilation; but it is life itself which awakens it.' Rod's user stories: 'Pause matters more than delete.' The combined insight: retention fails at both the civilizational level (Freud: accumulated grievances) and the existential level (Becker: the host cannot sustain aliveness). The counter-mechanism must operate at both: cumulative metrics counteract grievances (Freud) while legacy framing sustains the hero system (Becker).",
      "recommendation": "merge"
    },
    {
      "new_element_id": "communicates-002 (Proposal Vetting Information Hierarchy)",
      "existing_element_id": "communicates-003 (Stranger Threat Reduction Through Civilizational Compliance Signals) [Freud 1830 run]",
      "similarity": "Both prescribe identity-first, terms-second scan order for proposals. The existing element structures this as safety -> compatibility -> terms -> action. The new element structures it as 'Who is this person?' -> 'What do they want?' -> 'Why?' -> 'What do I do?' Both agree that trust assessment precedes all other cognitive processing when a stranger requests entry.",
      "combined_evidence": "Existing evidence: Freud's stranger-threat calculus. Becker evidence: 'The fear of death is to be regarded as an analogue of the fear of castration, and the situation to which the ego reacts is the state of being forsaken or deserted by the protecting superego.' The combined insight: the proposal view must resolve two threats simultaneously -- civilizational (is this person rule-abiding?) and existential (has the platform-as-superego vetted this person?). The Becker lens adds: counter-offer fields must be hidden until tapped, because showing negotiation controls prematurely signals the proposal is inadequate.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "communicates-003 (Urgency-First Dashboard Information Order)",
      "existing_element_id": "communicates-004 (Urgency-First Dashboard as Civilizational Order System) [Freud 1830 run]",
      "similarity": "Both prescribe the same three-tier dashboard hierarchy: action-required items at top, status updates in the middle, background information at the bottom. The existing element uses Freud's civilizational order. The new element uses Becker's self-preservation instinct externalized into color-coded urgency signals (red for overdue, amber for today, green for upcoming).",
      "combined_evidence": "Freud evidence: 'order is a kind of repetition-compulsion.' Becker evidence: 'the very term self-preservation implies an effort against some force of disintegration.' Rod's user stories: 'Urgency should surface first on the dashboard.' The combined insight: the urgency-first dashboard is validated by three independent sources (Freud, Becker, user research) as the correct host dashboard architecture. The Becker lens adds the traffic-light system and the reassurance zone ('Everything else is on track') as explicit vital-lie sustenance.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "looks-002 (Proposal Vetting Card: Trust-Signal Visual Weight)",
      "existing_element_id": "looks-002 (Purple Gradient Authority) [Freud 1830 run]",
      "similarity": "Both prescribe that trust signals must carry the greatest visual weight in the proposal view. The existing element uses purple palette authority (--primary-purple on trust badges). The new element prescribes the verification badge as the single most important visual signal -- the platform's guarantee that the stranger has been vetted. Both agree on the principle; they differ on color tokens (purple vs. green accent).",
      "combined_evidence": "Existing evidence: Freud's civilizational authority must be visible. Becker evidence: 'the fear of death is an analogue of being forsaken by the protecting superego.' The combined insight: the verification badge IS the platform-as-superego made visible. Its visual prominence must communicate 'we have vetted this person for you -- you are not forsaken.' The production purple palette (#31135D for authority, rgb(109,49,194) for interactive) should carry this function.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "looks-004 (Pricing Default as Confident Visual Anchor)",
      "existing_element_id": "communicates-005 (Pricing Defaults as Delegated Judgment) -- visual layer",
      "similarity": "Both prescribe that the default price must be the dominant visual element on the pricing step. The new element adds specific visual specifications: 48px serif hero number, single trust line, guaranteed income in accent color, market range bar as subordinate context. The principle is identical: visual size enacts the value-before-ask sequence.",
      "combined_evidence": "Existing evidence: 'Value before the ask -- always.' Becker evidence: 'We don't want to admit that we do not stand alone.' The combined insight: the price number at maximum typographic scale IS the transcendent system the host embeds in. Its visual dominance communicates certainty that the host cannot generate themselves.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "behaves-001 (Wizard Step Transition with Armor-Preservation Saves)",
      "existing_element_id": "behaves-005 (Wizard Save-and-Resume with Civilizational Progress Preservation) [Freud 1830 run]",
      "similarity": "Both prescribe auto-save, exact-state resume, and progress persistence during listing creation. The existing element specifies 2-second auto-save debounce and local storage fallback. The new element specifies the emotional dimension: the 'Saved' micro-label beside the progress dot functions as the platform whispering 'I have this' -- a moment of delegated power. The new element adds the fade transition pattern (200ms out, 250ms in) as repression in motion.",
      "combined_evidence": "Freud evidence: 'each completed wizard step is an instinctual renunciation the host has already performed.' Becker evidence: 'The great boon of repression is that it makes it possible to live decisively.' The combined insight: save-and-resume prevents both civilizational waste (Freud) and character-armor destruction (Becker). The Becker lens adds the transition animation spec: fade-out is repression of the previous step; fade-in is engagement with the current one.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "behaves-003 (Pause/Resume Listing Toggle)",
      "existing_element_id": "behaves-002 (Cautious Reversible Flows for Instinctual Acts) [Freud 1830 run]",
      "similarity": "Both prescribe frictionless reversibility for deactivation actions. The existing element applies Freud's two types of freedom-seeking and prescribes 5-second cool-down for destructive actions. The new element specifies the pause/resume toggle interaction: instant state change (200ms desaturation), no confirmation modal, no reason-collection form. The host's boundary is respected without interrogation.",
      "combined_evidence": "Freud evidence: 'the desire for freedom may be a revolt that proves favourable to civilization.' Becker evidence: 'repression lives on life energies and uses them creatively.' The combined insight: pause IS creative repression -- channeling the retreat impulse into a productive holding state. The Becker lens adds the critical detail: no 'Are you sure?' modal, because forcing the host to articulate their retreat breaks the repressive defense that makes pause psychologically viable.",
      "recommendation": "merge"
    },
    {
      "new_element_id": "feels-003 (Confident Surrender at the Pricing Step)",
      "existing_element_id": "feels-003 (Dignified Surrender at Listing Creation) [Freud 1830 run]",
      "similarity": "Both address the host's emotional experience of delegating authority to the platform. The existing element uses Freud's dignified surrender (the host trades instinctual freedom for civilizational protection). The new element uses Becker's embedding in other-power (the host accepts the platform's price because standing alone with self-valuation is existentially unbearable). Both target the same emotion: acceptance should feel like confidence, not defeat.",
      "combined_evidence": "Freud evidence: the host trades instinctual freedom for civilizational security. Becker evidence: 'We always rely on something that transcends us.' The combined insight: the pricing default creates both civilizational compliance (Freud: accepting marketplace norms) and existential relief (Becker: delegating the terror of self-valuation). The acceptance animation (price scale-up with spring easing) must make this feel like a stamp of approval, not a rubber stamp of surrender.",
      "recommendation": "keep_both"
    },
    {
      "new_element_id": "feels-004 (Sanctuary Restoration Through Cleaning Verification)",
      "existing_element_id": "behaves-004 (Ritual Cadence Interaction for Stay Cycle Confirmation) [Freud 1830 run]",
      "similarity": "Both address the cleaning photo ritual within the stay cycle. The existing element prescribes a three-beat ritual cadence (arrival, departure + cleaning, cycle close). The new element adds the emotional dimension: the cleaning photo approval is not administrative but ritual -- the host is confirming that their sanctuary survived contact with the stranger and was restored to its pre-invasion state. The approval action is the emotional climax of each stay cycle.",
      "combined_evidence": "Freud evidence: repetition-compulsion contains anxiety through predictable ritual. Becker evidence: 'self-preservation implies an effort against some force of disintegration.' The combined insight: the three-beat ritual cadence (Freud) is the temporal structure; the sanctuary-restoration emotion (Becker) is the psychological content. The Becker lens adds the specific emotional spec: the border-color transition from warn-amber to safe-green IS the psychological transition from vigilance to relief.",
      "recommendation": "keep_both"
    }
  ],
  "contradictions": [
    {
      "new_element_id": "looks-001 (Wizard Step Enclosure as Character Armor) + tokens.json palette",
      "existing_element_id": "looks-001 (Warm Containment: Rounded Containers) [Freud 1830 run] + production style guide",
      "conflict": "The Becker elements reference tokens.json values: bg (#f6f4f0), accent (#2d5a3d, forest green), surface (#ffffff), Instrument Serif/Outfit typography. The Freud 1830 elements and the production style guide use: --bg-off-white (rgb(252, 250, 255)), --primary-purple (#31135D), --secondary-purple (rgb(109, 49, 194)), DM Sans/Inter typography. The two systems describe fundamentally different visual identities -- warm neutral earth tones (tokens.json) vs. purple-tinted premium (production).",
      "evidence_comparison": "The production style guide (Agents-data-source/Style-guide.md) is the authoritative source for deployed CSS variables. tokens.json represents the design-stack's internal token system. Prior coherence audits have flagged this same drift. The Becker elements' green accent (#2d5a3d) for trust badges conflicts with the production purple trust badges (#31135D).",
      "recommendation": "Treat the production style guide (purple palette) as authoritative for all UI elements (L8). The Becker elements' theoretical insights (character armor, managed pieces, delegated power) are valid regardless of color tokens. In L8 synthesis, all UI elements must use production purple palette: --primary-purple (#31135D), --secondary-purple (rgb(109,49,194)), Inter/DM Sans typography. The tokens.json green palette may be retained for the design-stack's internal taxonomy but must not appear in buildable UI components.",
      "severity": "warning"
    },
    {
      "new_element_id": "looks-005 (Cleaning Photo Review as Ritual Restoration Visual)",
      "existing_element_id": "looks-004 (Urgency Amber, Not Alarm Red) [Freud 1830 run]",
      "conflict": "The new element prescribes a traffic-light system with signal-danger (#b83a3a) red borders for overdue items. The existing Freud element prescribes amber-only urgency, reserving red exclusively for system errors. The Becker dashboard urgency cards use red for overdue cleaning photo reviews -- a routine urgency item, not a system error.",
      "evidence_comparison": "The Freud element argues red triggers aggressive alarm. The Becker element argues overdue items represent genuine self-preservation threats that warrant red-level signaling. The host whose cleaning photos are 48 hours overdue is experiencing real character-armor erosion, not a routine administrative delay.",
      "recommendation": "Compromise: Use amber for time-sensitive items with no actual breach (proposals awaiting response, upcoming arrivals). Use red only for items where the host's space-protection protocol has been violated (overdue cleaning photos not received, missed payment). This reserves red for genuine sanctuary-threat items while keeping routine urgency in amber.",
      "severity": "minor"
    },
    {
      "new_element_id": "communicates-001 (Armor-Layered Listing Wizard Disclosure) -- no character counts",
      "existing_element_id": "behaves-005 (Wizard Save-and-Resume) [Freud 1830 run] -- completion percentage on dashboard",
      "conflict": "The new element excludes character counts and 'minimum description length' warnings as signals of inadequacy during vulnerable self-narration. The existing element shows completion percentage on the dashboard listing card as a motivational mechanism. There is a tension: completion percentage is a progress signal that could be read as pressure during a vulnerable process.",
      "evidence_comparison": "Becker's analysis: the completion percentage converts overwhelming vulnerability into a simple, actionable number. Rod's user stories: 'Completion percentage is a good host nudge.' The nudge quality of the percentage is validated by user research but must be carefully implemented to feel like progress, not pressure.",
      "recommendation": "Keep the completion percentage on the dashboard listing card (external view) but do NOT show it within the wizard steps themselves. Inside the wizard, the host sees only the progress dots (completed vs. upcoming). The percentage appears only on the dashboard card where it serves as a return-nudge, not an in-process pressure signal. This resolves the tension: the number motivates return but does not add pressure during active completion.",
      "severity": "minor"
    }
  ],
  "extensions": [
    {
      "new_element_id": "looks-005 (Cleaning Photo Review as Ritual Restoration Visual)",
      "gap_filled": "No existing element specifies the visual design of the cleaning photo verification ritual. The Freud 1830 run addresses ritual cadence as a behavioral pattern but not its visual expression. The Becker element fills this gap with a full visual specification: 2x2 photo grid, 'Approve: Space Restored' button, accent-light green overlay on confirmation, 48-hour persistence on dashboard. This converts the ritual from a behavioral prescription into a buildable visual component.",
      "confidence_note": "High confidence. The cleaning photo ritual is identified by both Freud and Becker lenses as a critical anxiety-management mechanism. Its visual design directly impacts the host's experience of sanctuary restoration."
    },
    {
      "new_element_id": "looks-006 (Legacy Summary as Celebratory Narrative Composition)",
      "gap_filled": "No existing element specifies a distinct visual treatment for the retention summary moment. The Freud 1830 run has cumulative narrative elements (communicates-006) but no visual spec. The Becker element prescribes a full-bleed accent canvas, 56px hero income number, three-column metrics, review snippet cards, and re-list/pause actions -- a visual composition unlike any other host screen. This creates the 'special occasion' visual register needed for the immortality-project reframing.",
      "confidence_note": "High confidence. The Legacy Summary requires a visually distinct treatment to communicate that this is a milestone, not a receipt. Both Freud and Becker identify retention as the weakest phase; a visually elevated summary directly addresses this gap."
    },
    {
      "new_element_id": "behaves-004 (Cleaning Photo Approval Ritual Interaction)",
      "gap_filled": "The existing library has post-checkout micro-review interactions (ds-ui-004 from Freud 1830) but no element specifies the host-side cleaning photo approval flow. The Becker element fills this gap with: inline dashboard card expansion, full-screen photo view with pinch-to-zoom, 'Approve: Space Restored' action with border-color transition and haptic feedback, 48-hour reassurance persistence. The haptic pulse is unique to this element -- a physical confirmation of ritual completion.",
      "confidence_note": "High confidence. The cleaning photo approval is one of the most emotionally significant micro-interactions in the active lease phase. Its absence from the existing library is a notable gap."
    },
    {
      "new_element_id": "behaves-005 (Pricing Default Accept vs. Adjust Decision Point)",
      "gap_filled": "The existing library prescribes pricing defaults as information architecture (communicates-005) but no behavioral element specifies the interaction pattern: how accepting feels (price scale-up with spring easing), how adjusting works (slider constrained to market range with real-time price updates), or how the 'already decided' presentation reduces the host's sense that a decision is needed. The Becker element adds the spring-easing acceptance animation as a 'stamp of approval' and the slider indecision handler (after 3 direction changes, offer to return to default).",
      "confidence_note": "High confidence. The pricing interaction is a high-anxiety decision point where behavioral micro-design has outsized emotional impact."
    },
    {
      "new_element_id": "behaves-006 (Re-List Streamlined Flow at Lease End)",
      "gap_filled": "Closely parallels works-005 from Freud 1830 (host identity for retention) but adds the specific behavioral flow: single confirmation screen with pre-populated listing data, inline section editing, 're-list as-is' default action, and the re-saturation animation (reversing the pause desaturation). No existing element specifies this transition interaction.",
      "confidence_note": "High confidence. The lease-end-to-re-listing transition is the single highest-leverage behavioral intervention for host retention."
    },
    {
      "new_element_id": "feels-001 (Guided Courage Through the Listing Wizard) -- copy guidelines",
      "gap_filled": "The existing library prescribes emotional targets for listing creation (depletion-aware pacing from Kahneman, dignified surrender from Freud) but the Becker element adds specific copy guidelines: matter-of-fact tone, plain functional step titles ('Your space,' 'Photos,' 'House rules'), reassurance subtitles that reframe self-exposure as guest-utility, and the explicit prohibition on aspirational/emotional framing ('Share your story'). The copy guideline specificity is new to the library.",
      "confidence_note": "High confidence. The copy tone during listing creation directly determines whether the host confronts or represses the existential weight of self-exposure. Becker's analysis of the vital lie provides the most precise copy guidance available."
    }
  ],
  "token_compliance": {
    "new_tokens_flagged": [
      {
        "token": "tokens.json accent (#2d5a3d) -- forest green trust signals",
        "issue": "The Becker L3 elements use tokens.json's green palette for trust badges, verification signals, and action buttons. This conflicts with the production style guide's purple palette. In L8 synthesis, all green trust tokens must be mapped to production equivalents: accent (#2d5a3d) -> --secondary-purple (rgb(109,49,194)); accent-bright (#3a7a52) -> --accent-purple (rgb(140,104,238)); accent-light (#e8f0eb) -> --bg-off-white (rgb(252,250,255)).",
        "risk": "medium -- requires consistent remapping across all seven UI elements"
      },
      {
        "token": "tokens.json typography -- Instrument Serif / Outfit",
        "issue": "The Becker elements reference Instrument Serif and Outfit from tokens.json. The production style guide uses DM Sans and Inter. L8 elements must use production typography: Instrument Serif -> DM Sans (headings, hero numbers); Outfit -> Inter (body, labels, buttons).",
        "risk": "low -- direct substitution"
      },
      {
        "token": "signal-danger (#b83a3a) and signal-warn (#c17a28) from tokens.json",
        "issue": "The traffic-light urgency system references tokens.json signal colors. The production style guide does not explicitly define these signal colors, but amber and red are standard. The tokens.json signal colors can be used as-is in L8 since they do not conflict with production variables.",
        "risk": "low -- no conflict with production palette"
      },
      {
        "token": "bg (#f6f4f0) and surface (#ffffff) from tokens.json",
        "issue": "The Becker elements use bg (#f6f4f0) as canvas background. The production style guide uses --bg-off-white (rgb(252,250,255)) and --bg-light (#f9fafb). L8 elements must use production backgrounds.",
        "risk": "low -- direct substitution"
      }
    ],
    "recommendation": "The primary compliance action is mapping tokens.json values to production style guide equivalents in L8. The Becker elements' theoretical insights are token-agnostic; the visual prescriptions need palette translation. Specifically: (1) All green accent colors become purple palette equivalents. (2) Instrument Serif -> DM Sans, Outfit -> Inter. (3) bg (#f6f4f0) -> --bg-off-white or --bg-light. (4) Surface (#ffffff) -> --bg-white (#ffffff) -- no change needed. (5) Signal colors (warn amber, danger red) can be preserved as-is. The seven proposed semantic concepts from the Becker run (character armor containment, managed pieces, delegated power, ritual restoration, sanctuary verification, legacy narrative, pause-as-armor) are all valid design patterns that translate cleanly to the production token system."
  },
  "emotional_arc_check": {
    "journey_emotion_map": [
      {
        "phase": "discovery",
        "target_emotions": ["guarded_curiosity", "latent_financial_anxiety"],
        "becker_layer": "Character armor fully engaged. The host's existing hero system (managing income and housing alone) has not yet been challenged. The platform must provide narcissistic supply (value, validation) before the host will lower defenses. Any premature information request triggers defensive retreat."
      },
      {
        "phase": "evaluation",
        "target_emotions": ["comparison_anxiety", "cautious_flirtation_with_change"],
        "becker_layer": "Active hero-system comparison. The host is auditioning Split Lease as a new transcendent system to embed in. The platform must feel larger and more reliable than the host's individual capacity. Delegated powers (guarantees, verified reviews, agent support) are the currency of this phase."
      },
      {
        "phase": "onboarding",
        "target_emotions": ["cautious_surrender", "relief_mixed_with_vulnerability"],
        "becker_layer": "First voluntary lowering of character armor. The host trades autonomy for the promise of a stronger defensive structure. The agent relationship provides what Saul calls 'inner sustainment' -- a human anchor during digital vulnerability. Authentication must feel like armor peeling, not armor ripping."
      },
      {
        "phase": "listing_creation",
        "target_emotions": ["quiet_competence", "creative_pride_masked_by_routine"],
        "becker_layer": "PEAK VULNERABILITY. The host exposes the innermost layer of character armor -- their private domestic space. The wizard must support the grand illusion that this is routine form-filling, not existential self-exposure. The host should feel competent and organized, never brave or vulnerable. Each step must feel like beaver-sized pieces."
      },
      {
        "phase": "pricing",
        "target_emotions": ["reassured_acceptance", "delegated_confidence"],
        "becker_layer": "Self-valuation crisis managed through delegation. The host accepts the platform's price as embedding in other-power. Accepting defaults should feel like trusting a knowledgeable advisor. The guaranteed income projection converts terrifying uncertainty into predictable revenue."
      },
      {
        "phase": "proposal_mgmt",
        "target_emotions": ["informed_authority", "contained_vigilance"],
        "becker_layer": "Named stranger requests entry to the hero system. The host performs a life-safety assessment disguised as a business negotiation. Trust signals (verification badge, review history, stay count) function as delegated powers -- borrowed character armor. The counter-offer mechanism provides temporal control over vulnerability."
      },
      {
        "phase": "active_lease",
        "target_emotions": ["informed_equilibrium", "ritual_satisfaction"],
        "becker_layer": "Sustained character-armor maintenance. The stranger physically inhabits the hero system. Chronic low-grade vigilance is punctuated by relief cycles -- each successful stay completion temporarily restores the vital lie. Cleaning photo approval is the ritual climax: proof the sanctuary survived. The dashboard is the externalized self-preservation instinct."
      },
      {
        "phase": "retention",
        "target_emotions": ["quiet_pride", "continuation_from_validated_strength"],
        "becker_layer": "The immortality project test. Can the host sustain aliveness -- continued exposure, vulnerability, engagement with contingency? The Legacy Summary provides the narcissistic supply needed to rebuild the vital lie around hosting. Re-listing is a humble recommitment, not a triumphant relaunch."
      }
    ],
    "arc_conflicts": [
      {
        "conflict": "The Becker emotional arc prescribes 'quiet competence' at listing_creation -- the host should never feel the weight of what they are doing. But the Freud 1830 arc prescribes 'dignified surrender' at the same phase -- acknowledging the sacrifice. These are slightly different emotional registers: Becker wants full repression of the existential weight; Freud wants honored acknowledgment of the sacrifice.",
        "resolution": "The resolution is temporal. DURING listing creation (inside the wizard), the Becker register prevails: quiet competence, matter-of-fact tone, no emotional framing. AT COMPLETION (the publish moment), the Freud register activates: a brief warm pulse (accent-light wash) acknowledges the accomplishment. The host represses during the process and is briefly honored at the end. This dual register works because the wizard steps are beaver-pieces (Becker) and the completion moment is dignified recognition (Freud)."
      },
      {
        "conflict": "The Becker arc prescribes 'informed equilibrium' at active_lease -- a pilot scanning instruments. The Freud 1830 arc prescribes 'calm/sustained comfort.' Becker's version includes an irreducible element of vigilance; Freud's version aspires to full calm. The difference matters for dashboard design: vigilance-oriented design shows more urgency signals; calm-oriented design shows more reassurance signals.",
        "resolution": "Design for the arc over time. Early in the active lease (first 1-3 stays), the Becker vigilance register is appropriate: more urgency signals, cleaning photo reviews as high-priority. After the host has completed 5+ stay cycles and established a positive ritual pattern, the dashboard can shift toward the Freud calm register: urgency signals remain available but the reassurance zone becomes more prominent. The host's emotional state evolves with experience, and the dashboard should evolve with it."
      }
    ],
    "arc_assessment": "The emotional arc is coherent and psychologically rich. The Becker lens adds a dimension absent from both the Kahneman (cognitive ease) and Freud (civilizational exchange) frameworks: the host's journey is fundamentally about managing death anxiety through character armor, and the platform's job is to provide replacement defenses at every point where the host sheds existing ones. The arc correctly identifies listing_creation as the peak vulnerability moment (Perls' impasse layer), proposal_mgmt as the point where existential terror becomes interpersonal (the stranger as death-symbol), and retention as the immortality-project test. The U-shape identified in the Freud 1830 analysis is confirmed: high engagement at discovery (armor intact, curiosity safe), dipping through the armor-shedding gradient (listing creation), stabilizing through ritual (active lease), and requiring identity-level intervention at retention (legacy narrative). The key Becker-specific insight: the emotional arc is not about managing effort or calculating exchanges -- it is about maintaining a viable vital lie across eight phases, each of which threatens to expose the lie's fragility."
  },
  "coverage_map": {
    "discovery": {
      "element_count": 3,
      "coverage": "moderate",
      "elements": ["communicates-004 (Value-Before-Ask Evaluation Disclosure)", "feels-001 (references discovery as armor-intact phase)", "L0 journey-context: extensive discovery analysis"],
      "note": "Discovery has principled coverage (value-before-ask, narcissistic supply before information request) but no dedicated UI component. The Becker lens confirms the Freud finding: discovery needs a concrete value-demonstration element (earnings estimator, demand signals) that requires zero host disclosure. The ds-ui-1830-001 (Discovery Earnings Estimator) from the Freud run fills this gap."
    },
    "evaluation": {
      "element_count": 3,
      "coverage": "thin",
      "elements": ["communicates-004 (Value-Before-Ask extends to evaluation)", "L0 journey-context: hero-system comparison analysis", "feels-001 (curiosity extends)"],
      "note": "Evaluation remains the thinnest phase. The Becker lens reveals the specific psychological operation (the host auditions Split Lease as a new hero system to embed in) but does not generate a dedicated evaluation UI element. The comparison-to-alternatives moment (Split Lease vs. Craigslist vs. Airbnb) is theoretically analyzed but not UI-specified. This is a gap for future runs."
    },
    "onboarding": {
      "element_count": 4,
      "coverage": "moderate",
      "elements": ["L0 journey-context: agent-as-inner-sustainment analysis", "communicates-004 (authentication preserves context)", "feels references to cautious surrender", "existing library: agent continuity elements"],
      "note": "Onboarding coverage is adequate, strengthened by the existing library's agent relationship elements. The Becker lens adds the insight that authentication must feel like armor peeling, not ripping -- inline modals, not full-page redirects."
    },
    "listing_creation": {
      "element_count": 11,
      "coverage": "strong",
      "elements": ["works-001 (Incremental Armor-Shedding Wizard)", "works-002 (Pause-as-Armor)", "communicates-001 (Progressive Disclosure)", "communicates-005 (Pricing Defaults -- wizard context)", "looks-001 (Wizard Step Enclosure)", "looks-004 (Pricing Default Visual)", "behaves-001 (Wizard Step Transition)", "behaves-003 (Pause/Resume Toggle)", "behaves-005 (Pricing Accept/Adjust)", "feels-001 (Guided Courage)", "feels-003 (Confident Surrender)"],
      "note": "Listing creation is the most heavily covered phase, consistent with its identification as the peak of the armor-shedding cascade. Eleven elements address this phase from all five layers. The Becker lens uniquely contributes: Perls' four layers mapped to wizard steps, the photo upload as impasse-layer moment, house rules as admission of vulnerability, and the 'beaver-sized pieces' fragmentation principle."
    },
    "pricing": {
      "element_count": 6,
      "coverage": "strong",
      "elements": ["works-004 (Default-Delegated Pricing Engine)", "communicates-005 (Pricing Defaults as Delegated Judgment)", "looks-004 (Pricing Default Visual Anchor)", "behaves-005 (Accept vs. Adjust Decision Point)", "feels-003 (Confident Surrender at Pricing)", "L0 journey-context: extensive pricing analysis"],
      "note": "Pricing coverage is strong in this run -- a significant improvement over prior runs. The Becker lens uniquely contributes the self-valuation crisis analysis: pricing is not a financial calculation but an existential self-assessment, and defaults function as the platform absorbing the burden of that assessment."
    },
    "proposal_mgmt": {
      "element_count": 8,
      "coverage": "strong",
      "elements": ["works-003 (Stranger-Vetting Proposal Interface)", "communicates-002 (Proposal Vetting Information Hierarchy)", "looks-002 (Proposal Vetting Card Visual)", "behaves-002 (Proposal Notification to Decision Flow)", "feels-002 (Contained Vigilance in Proposal Review)", "L0 journey-context: stranger-as-death-symbol analysis", "existing library: trust credential stack", "existing library: proposal structure compliance"],
      "note": "Proposal management has strong coverage with a unique Becker contribution: the stranger as death-symbol, the counter-offer as temporal control over vulnerability, and the verification badge as platform-superego made visible."
    },
    "active_lease": {
      "element_count": 8,
      "coverage": "strong",
      "elements": ["works-005 (Ritual Control Dashboard)", "communicates-003 (Urgency-First Dashboard)", "looks-003 (Dashboard Urgency Traffic-Light)", "looks-005 (Cleaning Photo Review Visual)", "behaves-004 (Cleaning Photo Approval Ritual)", "feels-004 (Sanctuary Restoration)", "feels-006 (Vigilant Calm on Dashboard)", "L0 journey-context: House Manual as cultural command"],
      "note": "Active lease has excellent coverage. The Becker lens uniquely contributes: cleaning photos as ritual purification (proof the sanctuary survived), the dashboard as externalized self-preservation instinct, and the traffic-light urgency system as threat-scanning made chromatic."
    },
    "retention": {
      "element_count": 7,
      "coverage": "moderate-to-strong",
      "elements": ["works-002 (Pause-as-Armor spans to retention)", "works-006 (Immortality-Project Retention Loop)", "communicates-006 (Post-Lease Legacy Summary Architecture)", "looks-006 (Legacy Summary Celebratory Visual)", "behaves-003 (Pause/Resume Toggle spans to retention)", "behaves-006 (Re-List Streamlined Flow)", "feels-005 (Earned Significance at Legacy Summary)"],
      "note": "Retention coverage is significantly strengthened by this run. The Becker lens adds the immortality-project framing (hosting as contribution that transcends individual transaction), the legacy summary as narcissistic supply for the expanded hero system, and the re-list flow as humble recommitment. This addresses the coverage gap identified in the Freud 1830 run."
    }
  },
  "loop_back_recommendations": [
    {
      "target_layer": "L3 (Looks)",
      "element_affected": "looks-001 through looks-006",
      "recommendation": "All Becker visual elements reference tokens.json palette (green accent, warm neutrals). Before L8 synthesis, all visual specs must be remapped to production style guide tokens: green -> purple, Instrument Serif -> DM Sans, Outfit -> Inter, bg (#f6f4f0) -> production backgrounds. The theoretical visual prescriptions (containment as character armor, trust signal visual weight, confident anchor) are valid and translate cleanly; only the color/type token assignments need updating.",
      "priority": "high",
      "reason": "Token-palette misalignment is the single most impactful coherence issue. If unresolved, L8 UI elements will contradict the deployed product."
    },
    {
      "target_layer": "L4 (Behaves)",
      "element_affected": "behaves-003 (Pause/Resume Toggle)",
      "recommendation": "Add specification for the edge case where host has active proposals when pausing: the current spec mentions a brief inline alert ('You have 2 open proposals. Pausing will auto-decline them') but does not specify whether this is a blocking confirmation or a non-blocking notification. Given the Becker principle that pause must be instant and uninterrogated, recommend making this a non-blocking notification with a 5-second undo window rather than a blocking modal.",
      "priority": "medium",
      "reason": "This edge case directly tests the Becker principle of frictionless retreat. A blocking modal at the pause moment contradicts the entire pause-as-armor design."
    },
    {
      "target_layer": "L5 (Feels)",
      "element_affected": "feels-006 (Vigilant Calm on Dashboard)",
      "recommendation": "The emotional spec prescribes that the dashboard's motion language should include a card-slide animation from the urgency stack to the reassurance zone when an item is resolved. This requires coordination with L3 (looks-003 traffic-light system) and L4 (behaves-004 cleaning photo approval) to ensure the visual and behavioral layers support this emotion-critical animation. Consider adding a cross-reference to the specific timing and easing spec.",
      "priority": "low",
      "reason": "The card-slide animation is the single most emotionally significant dashboard interaction but is described across three layers without explicit cross-reference."
    },
    {
      "target_layer": "L1 (Works)",
      "element_affected": "works-006 (Immortality-Project Retention Loop)",
      "recommendation": "The retention element prescribes an 'auto-renew' option that removes the conscious re-listing decision point. This feature has significant operational implications (the host's listing goes live without active confirmation after lease end). Recommend adding an explicit opt-in moment during active lease ('Enable auto-renewal for when this lease ends') rather than making auto-renew a default at the legacy summary. This preserves the host's sense of control while reducing re-listing friction.",
      "priority": "medium",
      "reason": "Auto-renew without active opt-in contradicts the Becker principle that the host must feel in control of their own exposure level."
    }
  ]
}