{
  "lens": {
    "host_call": "drew-call.txt",
    "book_extract": "dontmakemethink-usability-laws.txt"
  },
  "elements": [
    {
      "id": "looks-001",
      "type": "visual_pattern",
      "title": "Billboard Visual Hierarchy Through Weight Contrast",
      "journey_phases": [
        "onboarding",
        "listing_creation",
        "pricing",
        "proposal_mgmt",
        "active_lease"
      ],
      "problem": "Drew scans Bryant's verbal output and extracts only trigger words — $2,000, Chelsea, Ariel, 4 months — ignoring everything else. Krug Ch. 3 establishes that pages must function as billboards at 60 mph. But billboards work through extreme visual weight contrast: one element dominates, everything else recedes. Platform screens that distribute visual weight evenly across headings, labels, data fields, and buttons force Drew to read instead of scan. When all text is the same size, weight, and color, nothing declares itself as the anchor — and Drew's eye wanders without landing. The visual hierarchy must create a 'loudness' gap between the anchor element and everything else that is large enough to guide a scanning eye in under 2 seconds.",
      "evidence": [
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "The more important something is, the more prominent it is... Things that are related logically are also related visually... Things are 'nested' visually to show what's part of what.",
          "insight": "Krug's three traits of visual hierarchy provide the structural framework. But the key insight is that prominence must be exaggerated, not subtle — the difference between Tier 1 and Tier 2 must be visible at billboard speed, not after careful inspection."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 2",
          "type": "book",
          "quote": "We're thinking 'great literature' (or at least 'product brochure'), while the user's reality is much closer to 'billboard going by at 60 miles an hour.'",
          "insight": "The billboard metaphor defines the required contrast ratio between visual tiers. A billboard uses one font size for the headline and dramatically smaller text for everything else. Platform screens must mirror this ratio."
        },
        {
          "source": "drew-call.txt, 00:45-00:52",
          "type": "host_call",
          "quote": "the title of it is the comfortable one bed, one bath. One bedroom, one bath. Yep. In Chelsea. Yep. Yep.",
          "insight": "Drew identifies his listing through three trigger words in 7 seconds. The listing page must make these three data points — bedrooms, bathrooms, neighborhood — the visually loudest elements, not subordinate labels competing with system IDs or navigation chrome."
        },
        {
          "source": "drew-call.txt, 03:44-04:18",
          "type": "host_call",
          "quote": "split lease doubled the deposit, and guarantees payments to you... Okay. Okay. Okay. Alright.",
          "insight": "Drew extracts one conclusion from Bryant's multi-sentence guarantee pitch: 'I get paid.' The visual hierarchy must put 'Your rent is guaranteed' at maximum visual weight — not a paragraph explaining the mechanism in the same font size as the conclusion."
        }
      ],
      "priority": "high",
      "tokens": {
        "colors": [
          "--primary-purple for Tier 1 anchor headings",
          "--text-dark for Tier 2 action labels",
          "--text-gray for Tier 3 supporting details"
        ],
        "typography": [
          "Instrument Serif (--font-heading mapped to Instrument Serif for anchors) at 28-36px / bold for Tier 1 anchors",
          "Inter (--font-inter) at 16px / semibold for Tier 2 action labels",
          "Inter at 14px / normal for Tier 3 supporting text"
        ],
        "spacing": [
          "--spacing-4xl (32px) below Tier 1 anchor to create breathing room before Tier 2",
          "--spacing-2xl (24px) between Tier 2 and Tier 3",
          "--spacing-lg (16px) between items within the same tier"
        ],
        "new_tokens_needed": [
          "A heading scale specifically for anchor statements — current --text-2xl (28px) to --text-4xl (36px) range exists but needs explicit pairing with Instrument Serif for the billboard anchor pattern, which is not codified in the style guide"
        ]
      },
      "contrast_requirements": "Tier 1 anchor (--primary-purple #31135D on --bg-white #ffffff) achieves 13.5:1 contrast ratio — exceeds WCAG AAA. Tier 3 supporting text (--text-gray #5A6370 proposed, or current #6b7280) must maintain at least 4.5:1 on white for WCAG AA body text compliance.",
      "visual_hierarchy_rule": "The Tier 1 anchor must occupy at least 2x the font size of Tier 3 text and use the serif typeface (Instrument Serif) to create a typographic break that signals 'this is the headline, not more body text.' The eye should land on the anchor within 1 second of page load without any animation or motion — pure typographic weight does the work.",
      "brand_alignment": "Taste model specifies 'Serif for personality (headlines, brand)' and 'Confident, not flashy.' The billboard hierarchy uses Instrument Serif at large sizes for the anchor — delivering personality and confidence through scale and typeface choice rather than decoration or animation. The warm-neutral background (--bg) ensures the anchor headline pops without harsh contrast."
    },
    {
      "id": "looks-002",
      "type": "visual_pattern",
      "title": "Clickability Signaling Through Shape and Color Isolation",
      "journey_phases": [
        "onboarding",
        "listing_creation",
        "proposal_mgmt",
        "active_lease",
        "retention"
      ],
      "problem": "Krug Ch. 3 warns that unclear clickability erodes confidence: 'when you force users to think about something that should be mindless like what's clickable, you're squandering the limited reservoir of patience and goodwill.' Drew's trust is held by Bryant, not the platform. Every moment Drew spends wondering 'is this clickable?' is a moment he considers texting Bryant instead. The Orrin Hatch example — where all text was colored so no text signaled clickability — maps directly to the Split Lease risk: the purple brand palette uses --secondary-purple for both interactive elements (buttons, links) and informational emphasis (headings, badges). If purple means both 'click me' and 'I'm important but not interactive,' Drew cannot distinguish actions from decorations by scanning. The visual system must create an unambiguous mapping: one visual treatment means 'this is interactive,' and that treatment never appears on non-interactive elements.",
      "evidence": [
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "On Senator Orrin Hatch's Home page... it wasn't clear whether everything was clickable, or nothing was. There were 18 links on the page, but only two of them invited you to click by their appearance.",
          "insight": "When the entire page uses the same color for links and text, clickability becomes invisible. The Split Lease purple palette risks the same problem — if --secondary-purple appears on headings AND buttons, the distinction vanishes."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "Since a large part of what people are doing on the Web is looking for the next thing to click, it's important to make it obvious what's clickable and what's not.",
          "insight": "Drew's scanning behavior is search-for-next-click behavior. The visual system must make the next click the most visually obvious interactive element on the page — distinguishable from all non-interactive elements without cursor exploration."
        },
        {
          "source": "drew-call.txt, 05:38-05:50",
          "type": "host_call",
          "quote": "if you have any questions for me, you can feel free to text me or email me.",
          "insight": "Bryant explicitly offers two interaction channels — verbal affordances that are unambiguous. The platform's visual affordances must be equally unambiguous: buttons look like buttons (filled shape, distinct from text), and non-interactive text never mimics button styling."
        },
        {
          "source": "drew-call.txt, 04:21-04:38",
          "type": "host_call",
          "quote": "one more question I had was about pictures of the space and wondered if you had any more... Yes. I have more pictures and I can send you.",
          "insight": "Bryant's photo request is a clear call to action. Drew responds instantly. The platform's upload prompt must have equally unambiguous interactive styling — a filled button or a clearly bounded drop zone, not a subtle text link."
        }
      ],
      "priority": "high",
      "tokens": {
        "colors": [
          "--secondary-purple (or --gradient-purple-button) exclusively for primary interactive elements — buttons and primary CTAs only",
          "--primary-purple for headings and non-interactive emphasis — never for buttons",
          "--text-gray for non-interactive body text",
          "--accent-purple for hover/active states on interactive elements only"
        ],
        "typography": [
          "Inter at 14-16px / semibold (--font-weight-semibold) for button labels — this weight+family combination is reserved for interactive elements",
          "Inter at 14px / normal for body text — clearly distinct from button label weight",
          "Instrument Serif for headings — typographic family difference ensures headings are never confused with buttons"
        ],
        "spacing": [
          "--spacing-sm (8px) vertical padding inside buttons, --spacing-2xl (24px) horizontal padding — creating a recognizable button shape",
          "--spacing-lg (16px) margin around primary buttons to isolate them from surrounding content"
        ],
        "new_tokens_needed": [
          "An explicit --interactive-color token that maps to --secondary-purple but is semantically distinct — ensuring designers use it only for clickable elements and never for decorative purple text or headings"
        ]
      },
      "contrast_requirements": "Primary buttons (--secondary-purple #6d31c2 background with white text) must achieve at least 4.5:1 contrast ratio for WCAG AA. Current --secondary-purple on --white achieves approximately 7.2:1 — compliant. Interactive text links must use --secondary-purple on --bg-white, achieving approximately 7.2:1 — compliant. Non-interactive text must NEVER use --secondary-purple to prevent confusion.",
      "visual_hierarchy_rule": "Interactive elements claim attention through shape (rounded-pill or rounded-lg filled rectangles) and color (--secondary-purple fill). Non-interactive elements claim attention through typographic scale (larger serif type) and spatial position (top of page). The two attention-claiming mechanisms never overlap: large serif text is never clickable, and purple filled shapes are always clickable.",
      "brand_alignment": "Taste model specifies 'Trustworthy, not corporate. Rounded corners, human language, real data.' Pill-shaped buttons (--rounded-pill: 20px) create the warm, approachable interactive elements the taste model calls for. The strict separation between interactive purple and informational purple reinforces trust — Drew never has to guess, which makes the platform feel reliable."
    },
    {
      "id": "looks-003",
      "type": "visual_pattern",
      "title": "Area Boundaries Through Background Color Alternation",
      "journey_phases": [
        "proposal_mgmt",
        "listing_creation",
        "active_lease"
      ],
      "problem": "Krug's $25,000 Pyramid test requires that clearly defined areas on a page be identifiable at a glance. Drew's call had natural topic boundaries — each topic transition was signaled by Bryant's verbal cues ('I wanted to mention as well...,' 'one more question I had...'). On the platform, content areas often lack visible boundaries: a proposal card might present guest identity, financial terms, and action buttons in a single white container with only spacing between sections. Eye-tracking research Krug references shows that 'users decide very quickly which parts of the page are likely to have useful information and then almost never look at the other parts — almost as though they weren't there.' If areas lack visible boundaries, Drew cannot efficiently amputate irrelevant sections — he must scan the entire page to find what matters. The visual system needs a lightweight mechanism to signal 'this is a distinct area' without heavy borders or dividers that create visual clutter.",
      "evidence": [
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "Dividing the page into clearly defined areas is important because it allows users to decide quickly which areas of the page to focus on and which areas they can safely ignore.",
          "insight": "Area definition is not decoration — it's a scanning efficiency tool. Drew needs to identify the 'Who are these guests?' area and the 'What do I do?' area within 2 seconds. Without visual boundaries, identification requires reading, not scanning."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "Several of the initial eye-tracking studies of Web page scanning suggest that users decide very quickly which parts of the page are likely to have useful information and then almost never look at the other parts — almost as though they weren't there.",
          "insight": "Drew will visually amputate areas. Clear boundaries ensure he amputates correctly — ignoring Tier 3 details, not accidentally ignoring the action area because it blended into the details area."
        },
        {
          "source": "drew-call.txt, 01:32-03:17",
          "type": "host_call",
          "quote": "Ariel and Amber are both flexible... [topic shift at 03:17] I wanted to mention as well, so I know I mentioned Ariel and Amber... split lease doubled the deposit...",
          "insight": "Bryant creates clear verbal boundaries between the 'meet the guests' area and the 'here's the guarantee' area. The platform must create equally clear visual boundaries — a background color shift or generous whitespace gap between the Guest Information area and the Financial Terms area."
        },
        {
          "source": "drew-call.txt, 05:18-05:32",
          "type": "host_call",
          "quote": "they'd want to start with a four months... Is that something that would work yep.",
          "insight": "Lease terms are a distinct conversational area in the call. On the platform, lease term details must be visually separated from guest details and financial details — mixing them creates a composite that the call kept intentionally separate."
        }
      ],
      "priority": "high",
      "tokens": {
        "colors": [
          "--bg-white (#ffffff) for primary content areas (guest info, listing details)",
          "--bg-light (#f9fafb) or --bg-off-white (rgb(252, 250, 255)) for alternating secondary areas (financial details, supporting context)",
          "--bg-light-gray (#f3f4f6) for Tier 3 collapsed/expandable detail sections",
          "--border-color (#e5e7eb) as 1px separator between areas when background alternation alone is insufficient"
        ],
        "typography": [
          "Inter at 12-13px / semibold / uppercase / --letter-spacing-medium (0.05em) for area section labels — these small, distinct labels name each area without competing with content",
          "Inter at 14px / normal for content within areas"
        ],
        "spacing": [
          "--spacing-2xl (24px) padding inside each area to give content room to breathe",
          "--spacing-4xl (32px) vertical gap between distinct areas to create unambiguous separation",
          "--spacing-lg (16px) between items within the same area"
        ],
        "new_tokens_needed": [
          "A --section-label style combining uppercase + letter-spacing + small size + muted color — this pattern exists implicitly but is not codified as a reusable token for area headings"
        ]
      },
      "contrast_requirements": "Background alternation between --bg-white and --bg-light must be subtle enough to avoid visual noise but distinct enough to register during a 2-second scan. The difference between #ffffff and #f9fafb is 1-2% lightness — may need to use --bg-off-white (rgb(252, 250, 255)) for slightly more visible alternation. Section label text (uppercase, small) must still meet WCAG AA: --text-gray on --bg-white achieves minimum 4.5:1.",
      "visual_hierarchy_rule": "Background color creates implicit grouping without explicit borders. White backgrounds signal primary content areas (the areas Drew should focus on). Tinted backgrounds signal supporting areas (the areas Drew can safely skip). The eye naturally gravitates to white-background areas first because they have higher contrast with the anchor heading text. This passive visual sorting guides Drew's scan path without requiring him to read section labels.",
      "brand_alignment": "Taste model specifies 'Warm, not cold. Soft backgrounds, not stark white.' The alternation between --bg-white and --bg-off-white (warm-tinted) maintains the warm personality while creating functional area boundaries. No harsh lines or dark borders — the separation feels architectural, not mechanical."
    },
    {
      "id": "looks-004",
      "type": "visual_pattern",
      "title": "Confirmation vs. Decision Visual Languages",
      "journey_phases": [
        "pricing",
        "proposal_mgmt",
        "retention"
      ],
      "problem": "Drew's call reveals that most platform interactions are confirmations of pre-decided outcomes, not open decisions. But the platform uses the same visual treatment for both: editable form fields, option selectors, and multi-step wizards. This creates a visual lie — the page communicates 'you need to decide something' when Drew has already decided. Krug Ch. 2 warns that unnecessary option-weighing wastes cognitive resources: 'Weighing options may not improve our chances.' The visual language must distinguish between 'this is settled — confirm it' and 'this is open — decide it.' If Drew sees editable fields for his $2,000/month rent, the visual signal is 'this number is negotiable' — introducing a question mark ('Should I change it?') where the call established certainty. A distinct visual pattern for confirmations would signal 'this is fact, not input' and reduce cognitive load to a single scan-and-click.",
      "evidence": [
        {
          "source": "drew-call.txt, 00:52",
          "type": "host_call",
          "quote": "To confirm that would be a 2000 a month, I think is what it's listed here. That's right.",
          "insight": "Bryant uses confirmation language: 'To confirm...' Drew responds with 'That's right' — not a negotiation. The platform must visually distinguish this confirmation interaction from an open-ended pricing form."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 2",
          "type": "book",
          "quote": "Weighing options may not improve our chances. On poorly designed sites, putting effort into making the best choice doesn't really help.",
          "insight": "Editable fields invite weighing. Read-only summaries invite confirmation. The visual treatment determines which cognitive mode Drew enters — and for pre-decided outcomes, confirmation mode is both faster and more accurate."
        },
        {
          "source": "drew-call.txt, 05:18-05:32",
          "type": "host_call",
          "quote": "they'd want to start with a four months... Is that something that would work yep... Sounds good.",
          "insight": "The lease term was decided in 14 seconds. Presenting this as an editable form with duration dropdowns and date pickers contradicts the settled nature of the decision. A summary card with 'Confirm' button matches the call's tone."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 1",
          "type": "book",
          "quote": "every question mark adds to our cognitive workload, distracting our attention from the task at hand.",
          "insight": "An editable field for a pre-decided value is a visual question mark: 'Should I change this?' The confirmation visual pattern eliminates this question mark by presenting the value as fact, not input."
        }
      ],
      "priority": "medium",
      "tokens": {
        "colors": [
          "--bg-off-white (rgb(252, 250, 255)) as background for confirmation summary cards — warm, settled, non-interactive",
          "--bg-white for decision forms with active input fields — the white signals 'live editing zone'",
          "--primary-purple for confirmed values displayed as statements",
          "--secondary-purple for the single Confirm button",
          "--text-gray for 'Need to change?' edit escape hatch links"
        ],
        "typography": [
          "IBM Plex Mono (--font-mono) at 20-24px / semibold for confirmed dollar amounts — mono font signals 'this is data, not editable text' while the large size signals importance",
          "Inter at 14px / normal for the surrounding confirmation context",
          "Inter at 12px / normal for the 'Change' or 'Edit' link — small and unobtrusive"
        ],
        "spacing": [
          "--spacing-2xl (24px) padding inside confirmation cards",
          "--spacing-lg (16px) between the summary statement and the Confirm button",
          "--spacing-sm (8px) between the Confirm button and the Edit link"
        ],
        "new_tokens_needed": [
          "A --confirmed-value display style combining mono font + large size + primary-purple color — for presenting pre-decided numbers ($2,000/month) as settled facts rather than editable inputs"
        ]
      },
      "contrast_requirements": "Confirmed values in --primary-purple (#31135D) on --bg-off-white (rgb(252, 250, 255)) achieves approximately 12:1 contrast — exceeds WCAG AAA. The 'Change' link in --text-gray must achieve at least 4.5:1 on the same background. The visual distinction between confirmation cards (tinted background, mono font, no borders) and decision forms (white background, input fields, borders) must be recognizable without color alone — shape and typography differences provide the redundant signal.",
      "visual_hierarchy_rule": "Confirmation cards use a closed visual form: tinted background, no input affordances, mono-font values, single button. Decision forms use an open visual form: white background, visible input borders, sans-serif editable text, multiple options. Drew's eye should recognize the pattern in under 1 second: 'this is a receipt to sign, not a form to fill out.'",
      "brand_alignment": "Taste model specifies 'Mono for data/trust (prices, stats, badges). IBM Plex Mono — signals precision and reliability.' Using mono font for confirmed values directly implements this principle: the confirmed dollar amount looks precise, reliable, and final — not tentative or editable. The warm tinted background aligns with 'Warm, not cold' while creating a visual distinction from active form areas."
    },
    {
      "id": "looks-005",
      "type": "visual_pattern",
      "title": "Conversational Pacing Through Whitespace Rhythm",
      "journey_phases": [
        "onboarding",
        "listing_creation",
        "proposal_mgmt"
      ],
      "problem": "Drew's call has a natural rhythm: Bryant introduces one topic, pauses for Drew's response, confirms, then moves to the next topic. Each exchange has breathing room — the conversation never feels rushed or compressed. On the platform, screens often pack content densely to minimize scrolling, creating a visual wall that contradicts the conversational pacing Drew experienced. Krug Ch. 5 advocates omitting needless words — but the visual equivalent is omitting needless density. When every element crowds against the next, Drew cannot parse individual items during a scan. The eye needs whitespace to separate concepts the same way the ear needs pauses to separate topics. Dense layouts force reading; spacious layouts enable scanning. The platform must use whitespace as a pacing mechanism that mirrors the call's conversational rhythm: one idea, breathing room, next idea.",
      "evidence": [
        {
          "source": "drew-call.txt, 00:40-01:03",
          "type": "host_call",
          "quote": "Which I've got potluck. Exactly. You think it was be too much? [pause] Uh, the title of it is the comfortable one bed, one bath. [pause] One bedroom, one bath. Yep. [pause] In Chelsea. Yep. Yep. [pause] To confirm that would be a 2000 a month...",
          "insight": "The call has natural pauses between each data point — listing title, bedroom count, location, price. Each pause creates a boundary. The platform must use whitespace to create equivalent boundaries: each data point gets its own visual line with spacing above and below."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "Create a clear visual hierarchy on each page... The more important something is, the more prominent it is.",
          "insight": "Whitespace is a hierarchy tool: elements surrounded by more whitespace appear more important. The Tier 1 anchor should have the most whitespace around it; Tier 3 details can be denser. This gradient of spacing reinforces the billboard hierarchy."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Introduction",
          "type": "book",
          "quote": "Yes, it's a thin book. I've worked hard to keep this book short — hopefully short enough you can read it on a long plane ride. I did this for two reasons: If it's short, it's more likely to actually be used.",
          "insight": "Krug practices what he preaches — brevity and whitespace make content more usable. Screens that 'keep it short' with generous spacing are more likely to be scanned successfully than dense, comprehensive screens that attempt to show everything."
        },
        {
          "source": "drew-call.txt, 05:52-06:14",
          "type": "host_call",
          "quote": "Sounds good. Okay. No, that'll be all... let me just send you pictures.",
          "insight": "Drew's closing reveals preference for speed and brevity. Dense screens contradict this preference. Whitespace signals 'this won't take long' — visually communicating the brevity Drew expects."
        }
      ],
      "priority": "medium",
      "tokens": {
        "colors": [
          "--bg (#f6f4f0 from tokens.json) or --bg-light (#f9fafb from style guide) as the page background — warm, spacious, non-competing with content",
          "--surface (#ffffff) or --bg-white for content cards that float on the warm background"
        ],
        "typography": [
          "Inter at 14-16px with --line-height-relaxed (1.6) for body text within content areas — generous line height creates micro-whitespace between text lines",
          "Instrument Serif at 28-36px with --line-height-tight (1.2) for anchor headings — tight line height on large text prevents wasted space at the top of the hierarchy"
        ],
        "spacing": [
          "--spacing-xxl (60px from tokens.json) or --spacing-7xl (3rem from style guide) between major content sections — this is the 'conversational pause' spacing",
          "--spacing-xl (40px tokens / 20px style guide) between elements within a section — the 'within-topic' breathing room",
          "--spacing-md (16px) between tightly related elements (label and its value, button and its supporting text)"
        ],
        "new_tokens_needed": [
          "A --section-gap token for the large gap between major page sections (48-60px) — current spacing scale jumps from --spacing-4xl (32px) to --spacing-5xl (2rem/32px) without a clear 48-60px step for section-level separation in the style guide"
        ]
      },
      "contrast_requirements": "Whitespace itself has no contrast requirement, but it must create sufficient visual separation that areas remain distinct even when background colors are similar. The gap between sections (48-60px) should be at least 3x the gap within sections (16px) to create an unambiguous 'this is a new topic' signal. This spatial ratio mirrors the pause-length ratio in the call.",
      "visual_hierarchy_rule": "Whitespace scales with hierarchy tier: Tier 1 elements (anchor headings) get the most surrounding whitespace (60px above, 32px below). Tier 2 elements (action buttons) get moderate whitespace (24px above, 16px below). Tier 3 elements (detail text) get minimal whitespace (8-12px between lines). This creates a 'density gradient' — the page gets denser as you scroll deeper into detail, which naturally discourages deep reading and encourages the scan-and-act behavior Drew prefers.",
      "brand_alignment": "Taste model specifies 'Premium-accessible. Feels high quality without feeling exclusive.' Generous whitespace is the primary visual signal of premium quality — it communicates 'we have room, we're not cramming.' The warm background (--bg or --bg-light) ensures the whitespace feels inviting rather than sterile, aligning with 'Warm, not cold.'"
    },
    {
      "id": "looks-006",
      "type": "visual_pattern",
      "title": "Trust Typography: Mono Font for Guaranteed Data",
      "journey_phases": [
        "evaluation",
        "pricing",
        "proposal_mgmt",
        "active_lease"
      ],
      "problem": "Drew accepts Bryant's verbal guarantee ('split lease guarantees payments to you') with zero follow-up questions. This trust was earned through human conversation — tone of voice, conversational rhythm, personal credibility. On the platform, the guarantee is just text — and text on a screen carries no inherent credibility. Krug Ch. 1 warns that 'the fact that the people who built the site didn't care enough to make things obvious — and easy — can erode our confidence in the site and its publishers.' The platform must use visual cues to signal 'this data is reliable' versus 'this is marketing copy.' When Drew sees his guaranteed rent amount, it must look like a bank statement — precise, authoritative, trustworthy — not like a promotional headline. The typographic treatment of financial data directly affects whether Drew trusts the platform's guarantee as much as he trusts Bryant's verbal promise.",
      "evidence": [
        {
          "source": "drew-call.txt, 03:44-04:18",
          "type": "host_call",
          "quote": "split lease doubled the deposit, and guarantees payments to you as the landlord... in the case that a guest would miss a payment, that doesn't have any effect on you and you still receive the payment.",
          "insight": "The guarantee is the platform's core value proposition. Bryant delivers it with verbal authority. The platform must deliver it with typographic authority — using visual treatments that signal 'this is a financial promise' rather than 'this is a feature description.'"
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 1",
          "type": "book",
          "quote": "the fact that the people who built the site didn't care enough to make things obvious — and easy — can erode our confidence in the site and its publishers.",
          "insight": "Confidence erosion happens through visual signals. If the platform displays '$2,000/month guaranteed' in the same font as a blog post headline, the visual signal is 'marketing claim.' If it displays the same text in a mono font with precise formatting, the signal is 'financial record.' The font choice IS the trust signal."
        },
        {
          "source": "drew-call.txt, 00:52",
          "type": "host_call",
          "quote": "To confirm that would be a 2000 a month, I think is what it's listed here. That's right.",
          "insight": "Drew treats his rent as a precise financial fact — '$2,000.' The platform must treat it the same way visually: mono font, exact amount, no ambiguity. A sans-serif rendering of '$2,000' looks like a label. A mono-font rendering looks like a ledger entry."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 2",
          "type": "book",
          "quote": "If we find something that works, we stick to it. Once we find something that works — no matter how badly — we tend not to look for a better way.",
          "insight": "If Drew's first impression of the platform's financial displays feels trustworthy (mono font, precise data, bank-like presentation), he will accept this trust signal permanently. First-impression typography for financial data sets the trust baseline for the entire relationship."
        }
      ],
      "priority": "medium",
      "tokens": {
        "colors": [
          "--primary-purple (#31135D) for guaranteed/confirmed financial amounts — the darkest, most authoritative color in the palette",
          "--accent-light (#e8f0eb from tokens.json) or --protocol-surface (#F7F2FA from style guide) as background for financial data badges — subtle tinting that signals 'this is a data zone'",
          "--text-gray for supporting financial context ('per month,' 'guaranteed by Split Lease')"
        ],
        "typography": [
          "IBM Plex Mono at 20-24px / semibold for primary financial amounts ($2,000/month) — the mono typeface signals precision and reliability per the taste model",
          "IBM Plex Mono at 13-14px / normal for secondary financial data (deposit amounts, fee breakdowns) — same trust signal at smaller scale",
          "Inter at 12-13px / normal for financial context labels — the sans-serif clearly distinguishes context from data"
        ],
        "spacing": [
          "--spacing-sm (8px) between a financial amount and its label",
          "--spacing-md (16px) between financial data items in a summary",
          "--spacing-lg (16px) padding inside financial data badges or containers"
        ],
        "new_tokens_needed": [
          "A --data-badge pattern combining mono font + tinted background + rounded-md border radius — for presenting financial amounts as discrete, trustworthy data objects rather than inline text"
        ]
      },
      "contrast_requirements": "Financial amounts in --primary-purple (#31135D) on --protocol-surface (#F7F2FA) achieves approximately 11:1 contrast — exceeds WCAG AAA. IBM Plex Mono's character spacing provides additional legibility for numerical data. Financial data must never be displayed in a color lighter than --text-dark (#1a1a1a) or --primary-purple — trust requires maximum readability.",
      "visual_hierarchy_rule": "Financial data uses IBM Plex Mono to create a typographic 'third voice' distinct from both the serif anchor headlines (Instrument Serif) and the sans-serif body/UI text (Inter). This three-font system ensures that Drew's scanning eye immediately categorizes what it sees: serif = headline/identity, sans = interface/action, mono = data/money. The mono voice signals 'this is a fact, not an opinion' — the typographic equivalent of Bryant's verbal authority.",
      "brand_alignment": "Taste model explicitly specifies: 'Mono for data/trust (prices, stats, badges). IBM Plex Mono — signals precision and reliability.' This element directly implements the taste model's most specific typographic instruction. The combination of mono font + purple data color creates a distinctive Split Lease 'data voice' that bridges Bryant's verbal credibility to the platform's visual credibility."
    },
    {
      "id": "looks-007",
      "type": "visual_pattern",
      "title": "Guided Flow Visual Continuity Through Step Connectors",
      "journey_phases": [
        "onboarding",
        "listing_creation"
      ],
      "problem": "Drew's entire experience is guided by Bryant — one topic flows into the next with verbal transitions ('I wanted to mention as well...,' 'one more question I had...'). When Drew encounters the platform's multi-step processes (listing wizard, onboarding flow), the guided feeling must continue. Krug Ch. 2 warns that users 'muddle through, making up their own vaguely plausible stories about what we're doing and why it works.' Drew's plausible story is: 'the platform should guide me like Bryant did.' Multi-step wizards often present steps as isolated screens with no visual connection — each step appears as a standalone form. This breaks the guided narrative. Drew needs to see visual evidence that he is on a path: where he came from, where he is, and where he's going. Without this visual continuity, each new step feels like starting over — and Drew, who values speed ('can we maybe move on?'), may abandon rather than face what feels like an infinite sequence of unconnected screens.",
      "evidence": [
        {
          "source": "drew-call.txt, 05:52-06:14",
          "type": "host_call",
          "quote": "Sounds good. Okay. No, that'll be all... let me just send you pictures and, um, did you do a, so we can maybe move on?",
          "insight": "Drew's 'can we maybe move on?' reveals impatience and desire for forward momentum. The visual system must always communicate forward progress — not through words ('Step 3 of 6') but through a visual path that shows completion accumulating and the end approaching."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 2",
          "type": "book",
          "quote": "Faced with any sort of technology, very few people take the time to read instructions. Instead, we forge ahead and muddle through.",
          "insight": "Drew will not read 'Step 3 of 6: Features' — he will glance at a progress indicator and assess 'am I almost done?' The visual treatment must answer this question through shape and color, not text."
        },
        {
          "source": "drew-call.txt, 01:03-02:57",
          "type": "host_call",
          "quote": "[Continuous conversational flow from property details through availability, guests, guarantee, photos]",
          "insight": "Bryant's call has no 'steps' — it's a continuous guided conversation with natural topic transitions. The listing wizard should feel the same way: a continuous visual flow with soft transitions, not hard cuts between isolated form screens."
        },
        {
          "source": "dontmakemethink-usability-laws.txt, Ch. 3",
          "type": "book",
          "quote": "A good visual hierarchy saves us work by preprocessing the page for us, organizing and prioritizing its contents in a way that we can grasp almost instantly.",
          "insight": "A progress indicator is a visual hierarchy applied to time/sequence. It preprocesses the wizard for Drew: 'you've done this, you're here, this is left.' Without it, Drew must hold the sequence in working memory — which he will not do."
        }
      ],
      "priority": "medium",
      "tokens": {
        "colors": [
          "--secondary-purple or --selected-purple for completed steps — the brand purple signals 'done, confirmed'",
          "--primary-purple for the current step — darkest purple signals 'you are here'",
          "--border-color (#e5e7eb) or --ink-ghost (#bdb8b0 from tokens.json) for future steps — muted color signals 'not yet'",
          "--bg-off-white (rgb(252, 250, 255)) as the progress bar track background"
        ],
        "typography": [
          "Inter at 12px / semibold for current step label — small but bold to signal 'active'",
          "Inter at 12px / normal / --text-gray for completed and future step labels — subordinate to the current step"
        ],
        "spacing": [
          "--spacing-xl (20px from style guide) vertical space between the progress indicator and the current step's content — enough to separate navigation from content without wasting valuable screen space",
          "--spacing-sm (8px) between step dots/segments in the progress indicator"
        ],
        "new_tokens_needed": [
          "A --progress-complete color token (maps to --secondary-purple but semantically indicates completion) and --progress-pending token (maps to --border-color) — codifying the three-state visual language of step indicators"
        ]
      },
      "contrast_requirements": "The current step indicator must be distinguishable from completed and future steps without relying on color alone (for color-blind accessibility). Use size (current step dot is larger), fill (completed is filled, future is outline), and label weight (current is bold) as redundant signals. --primary-purple on --bg-off-white achieves approximately 12:1 contrast — exceeds AAA for the active step indicator.",
      "visual_hierarchy_rule": "The progress indicator occupies a fixed position at the top of the wizard flow, acting as a persistent visual anchor that tells Drew 'you are on a path, and the path has an end.' It should be horizontally compact (a thin bar or small dots) so it communicates progress without competing with the current step's content for attention. The current step's content is the primary focus; the progress indicator is a peripheral confidence signal.",
      "brand_alignment": "Taste model specifies 'Confident, not flashy. The product speaks through clarity, not decoration.' The progress indicator should be minimal — small dots or a thin segmented bar, not an elaborate stepper with icons and animations. Confidence comes from the indicator simply being there and being accurate, not from drawing attention to itself. The purple fill-as-completion creates a visual 'path of purple' that reinforces brand presence without decoration."
    }
  ]
}
