{
  "lens": {
    "competitor": "PadSplit",
    "book": "coldstart-tipping-point.txt",
    "book_chapters": "Cold Start Theory Framework + Chapters 4-10: Tiny Speck/Slack, Anti-Network Effects, The Atomic Network, The Hard Side, Solve a Hard Problem, The Killer Product, Magic Moments, Tipping Point, Escape Velocity, Hitting the Ceiling, The Moat"
  },
  "opportunity_thesis": "PadSplit has solved the metropolitan-level Cold Start Problem through institutional supply-side infrastructure, but has systematically failed to build atomic networks at the house level. Every PadSplit house is a permanently cold-starting social network: strangers assembled by compliance screening, communicating through off-platform texts, governed by no engagement ladder, and accumulating zero portable reputation. Split Lease's opportunity is not to out-scale PadSplit's institutional infrastructure, but to out-network it at the unit of the house. By building the social layer that PadSplit structurally cannot add -- pre-move-in community activation, house-level communication, progressive engagement over tenure, and a portable Shared Housing Passport -- Split Lease can create network effects at the atomic level (the house) that generate switching costs PadSplit's commodity model cannot match. The strategic thesis is: win the house, win the market. A platform where month 12 is dramatically better than month 1, where leaving means losing your accumulated reputation and community role, and where every move-in is a magic moment rather than an anti-magic moment, will generate the three Escape Velocity forces (Acquisition Effect, Engagement Effect, Economic Effect) that PadSplit's flat experience structurally cannot produce.",
  "opportunities": [
    {
      "id": "opp-0933-001",
      "title": "The House Atomic Network: Pre-Move-In Community Activation",
      "based_on_disappointments": ["disappoint-001", "disappoint-006", "disappoint-009"],
      "split_lease_phases": ["search", "listing_evaluation", "proposal_creation", "negotiation", "acceptance", "move_in"],
      "the_signature": "Split Lease would be the first shared-housing platform where you meet the house before you commit to the room. Between proposal acceptance and move-in, a structured 'House Welcome' flow activates: the incoming guest sees profiles of current or recent co-tenants (work schedule, interests, quiet hours preference), receives a welcome message from the host or house anchor, joins a house-level group space, and can optionally do a 15-minute video meet. By the time move-in day arrives, the guest already has a name, a face, and a shared context for every person they will live with. Nobody in shared housing does this. PadSplit delivers a key code and a rules PDF. Split Lease delivers a community you already belong to before you walk through the door.",
      "why_competitors_wont_copy": "PadSplit's entire business model is optimized for fill rate -- the speed from vacancy to occupancy. Every hour a room sits empty is lost revenue. Adding a social onboarding step between approval and move-in adds friction to the fill pipeline, which directly conflicts with their revenue optimization. Their institutional model treats members as interchangeable inventory; compatibility screening requires treating them as unique individuals, which their screening infrastructure is not built to handle. Furthermore, PadSplit's houses have 4-8 rotating strangers with high turnover -- the social infrastructure would need constant re-building, which their support model cannot sustain. Split Lease's agent-mediated model and smaller house units (2 co-tenants sharing a space) make compatibility feasible at a scale PadSplit cannot achieve.",
      "behavioral_framework_case": "Chen (Ch. 6 - The Atomic Network): 'You need the right people on the network. Ten people using Slack all from the same team is better than ten random people in a larger company. Density and interconnectedness is key.' PadSplit assembles houses with random qualified applicants. Split Lease can assemble houses with compatible, pre-connected co-tenants. Chen's insight is that the composition of the atomic network, not just the count, determines whether it reaches stability. Pre-move-in activation is what transforms a cold-start house into a warm-start community. Chen (Ch. 5 - Anti-Network Effects): 'Small, sub-scale networks naturally want to self-destruct, because when people show up to a product and none of their friends or coworkers are using it, they will naturally leave.' Pre-move-in activation prevents the self-destruction impulse by ensuring no one shows up to a stranger's house.",
      "user_evidence": "Frederick/Valerie: 'I wouldn't mind a sharing if it was like one consistent person, but I also feel like it would be a lot of work... especially if it's a different person. So I can't even really get to know them.' Susan Bryant: 'I have to go and see the space and just to make sure that everything is legit.' Shomit Ghosh - agent describes: 'So you will meet on Zoom that person, and you will talk to the tourist. So you will be able to say, I am comfortable or not comfortable with the other person.' Tapper S - agent: 'hosts don't accept just the bid from who knows who they want to know people.'",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "strong",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "DO NOT turn this into a mandatory compatibility questionnaire with 50 fields. The magic moment is social (meeting a person), not administrative (filling out a form). Keep it to 3-5 light preference signals (work schedule, noise preference, social vs. private) plus a short personal intro.",
        "DO NOT block move-in on social onboarding completion. It should be strongly encouraged and delightful, not a compliance gate. If one party doesn't participate, the system degrades gracefully.",
        "DO NOT make this feel like a dating app. The framing is 'meet your housemate' not 'find your perfect match.' Low stakes, high warmth.",
        "DO NOT collect compatibility data that could create Fair Housing concerns. Stick to lifestyle preferences (schedule, noise, social habits) not demographic characteristics."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-001", "works-004", "guest-works-001", "guest-behaves-004"],
        "gap_assessment": "The library has strong elements for System 1 trust gates at phase transitions (works-001) and bridging human trust to digital trust (works-004). These address the trust architecture but not the specific social onboarding flow for shared housing. guest-works-001 and guest-behaves-004 address the Stays Manager and date changes -- they serve the active_lease phase but not the pre-move-in phase. This opportunity fills a genuine gap: no existing library element addresses the moment between acceptance and move-in as a community-building opportunity."
      }
    },
    {
      "id": "opp-0933-002",
      "title": "The Engagement Ladder: Progressive Value Over Tenure",
      "based_on_disappointments": ["disappoint-003", "disappoint-004", "disappoint-007"],
      "split_lease_phases": ["active_lease", "move_in"],
      "the_signature": "Split Lease would build the first shared-housing experience where month 12 is fundamentally different from -- and better than -- month 1. The Stays Manager, which guests already visit 13+ times per lease, becomes the engine of an engagement ladder: Week 1 delivers warm guidance and orientation. Week 4 unlocks coordination tools (shared space scheduling, supply requests). Week 8 grants 'House Anchor' recognition for consistent, high-quality tenancy (visible badge, priority for date changes, influence on new co-tenant matching). Week 12 offers renewal incentives and accumulated reputation credits. Each week's micro-review feeds the Shared Housing Passport. The dashboard transforms from a billing portal to an engagement engine that reveals new value at each tier. PadSplit's dashboard shows the same payment confirmation on day 1 and day 365. Split Lease's dashboard evolves with you.",
      "why_competitors_wont_copy": "PadSplit's member dashboard is a billing portal because their business model is rent collection, not community engagement. Building an engagement ladder requires product investment in features that don't directly generate revenue (badges, coordination tools, tenure recognition). PadSplit's engineering is focused on scaling room inventory and payment processing -- engagement features would compete for engineering resources against their core monetization loop. Additionally, PadSplit's high turnover (30-50% annually) means most members never reach the upper tiers, making the investment seem unprofitable. But this is circular reasoning: turnover is high because there is no engagement ladder. Split Lease's lower turnover target (driven by longer leases and community effects) makes the investment viable.",
      "behavioral_framework_case": "Chen (Ch. 3 - Escape Velocity): 'The Engagement Effect manifests itself by increased engagement as the network grows -- this can be developed further by conceptually moving users up the engagement ladder. This is done by introducing people to new use cases via incentives, marketing/communications, and new product features. Uber did this via leveling users up from airport trips to dining out to daily commutes.' PadSplit has one use case (pay rent) and no engagement ladder. The Stays Manager already provides the weekly touchpoint that Uber used for the airport-to-commute progression. Adding progressive value (coordination tools, reputation credits, anchor recognition) transforms 13 payment confirmations into 13 engagement milestones.",
      "user_evidence": "Tammy (host): 'the math doesn't add up... if I commit to that model' -- engagement is purely economic because no platform offers progressive value. Sherene (host): describes extensive personal labor to maintain standards ('my business model, like person can't show up and the room is not right') -- this anchor labor goes unrecognized. The agent in Vince's call describes the Stays Manager date-change feature as platform-mediated coordination -- already the seed of an engagement ladder.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "ambitious",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "DO NOT make the engagement ladder feel gamified or patronizing. This is not a loyalty points program. Each tier should unlock genuinely useful capabilities, not cosmetic badges.",
        "DO NOT gate essential functionality behind tenure walls. Date changes and basic coordination should be available from Week 1. Tenure unlocks enhanced capabilities and recognition, not basic access.",
        "DO NOT create so many tiers that weekly progression feels meaningless. 3-4 meaningful thresholds across a 13-week lease is sufficient.",
        "DO NOT make the House Anchor role feel like unpaid labor. It should feel like earned status with real benefits (priority placement, deposit credits, co-tenant influence) not additional responsibilities."
      ],
      "existing_library_overlap": {
        "related_elements": ["guest-works-003", "guest-feels-001", "guest-feels-002", "guest-communicates-005", "guest-looks-001"],
        "gap_assessment": "The library has strong coverage of the Stays Manager as a System 1 dashboard (guest-works-003) and the emotional arc across 13 weeks (guest-feels-001). These address the interface design and emotional tone but not the progressive value unlock mechanism. The engagement ladder is a structural extension of the Stays Manager: same touchpoint, same weekly cadence, but with progressive capability revelation. This is a reinforcement signal -- the Stays Manager is the substrate, and the engagement ladder is the progression system built on top of it. Partial overlap, genuine extension."
      }
    },
    {
      "id": "opp-0933-003",
      "title": "The Shared Housing Passport: Cumulative Portable Reputation",
      "based_on_disappointments": ["disappoint-005", "disappoint-010"],
      "split_lease_phases": ["active_lease", "discovery", "search", "listing_evaluation"],
      "the_signature": "Split Lease would create the first portable reputation system for shared housing. Each weekly Stays Manager check-in includes a one-tap micro-review (already validated by the Booking.com/Hooked run). Over a 13-week lease, these accumulate into a temporal narrative: not a single 'how was your stay?' but a rolling graph of trust signals -- on-time payments, positive micro-reviews from hosts and co-tenants, zero complaints, space condition ratings. This Shared Housing Passport travels with the guest across leases: a guest with a 4.8-star Passport and 26 consecutive positive micro-reviews gets priority placement, reduced deposits, and faster approval on their next lease. The Passport also creates the strongest possible switching cost: leaving Split Lease means losing months of accumulated trust that gives you tangible advantages. PadSplit members start from zero every time. Split Lease members accumulate value that compounds over time.",
      "why_competitors_wont_copy": "Building a cumulative reputation system requires two things PadSplit structurally lacks: (1) a sustained review cadence (PadSplit has optional move-out reviews; Split Lease has weekly micro-reviews via the Stays Manager), and (2) a long enough lease duration for reputation to accumulate meaningfully (PadSplit's weekly model incentivizes short stays; Split Lease's 3+ month leases generate 13+ data points per lease). Furthermore, making reputation portable requires a product identity ('Shared Housing Passport') that transcends any single platform -- PadSplit's branding is platform-centric ('PadSplit member'), not identity-centric ('shared housing professional'). The Passport concept also requires the multi-local identity framing that Split Lease already has (discovery-003 from L2) and PadSplit's affordable-housing framing cannot support.",
      "behavioral_framework_case": "Chen (Ch. 5 - The Moat): 'Network effects create switching costs that defend against competitors.' A Shared Housing Passport creates switching costs at the individual level: leaving Split Lease means losing a verified reputation that took months to build and provides tangible benefits. Chen's Uber driver rating analogy applies directly: a driver with a 4.95 rating has something to lose by switching to Lyft and starting at zero. Chen (Ch. 4 - Hitting the Ceiling): perpetual cold starts (disappoint-010) are the house-level equivalent of hitting the ceiling. The Passport mitigates this by ensuring that even when a co-tenant changes, the incoming person arrives with a verified trust profile, reducing the social restart cost.",
      "user_evidence": "Tapper S - agent: 'make sure that your profile is completely, you have picture, you have your traveler story' -- already the seed of reputation building, but static rather than cumulative. Sherene: 'I do very odd interviews, um, with everyone' -- hosts demand trust signals beyond background checks. Tammy: 'what are they there for? What's the company who are they there and where are they going to be working?' -- hosts want narrative context about guests. The Passport would give hosts exactly this: a verified, cumulative trust narrative.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "ambitious",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "DO NOT make the Passport a credit score. It should feel like a professional portfolio, not a surveillance metric. Show the narrative ('26 consecutive positive reviews across 2 leases') not just the number (4.8).",
        "DO NOT allow the Passport to become punitive. A bad week should not destroy months of accumulated trust. Weight recent behavior more heavily, but preserve the cumulative investment.",
        "DO NOT make Passport data public by default. Guests control what hosts see. The Passport is a tool for the guest to present their trust profile, not a tool for hosts to surveil guests.",
        "DO NOT create a Passport-or-nothing binary. New guests without a Passport should not be disadvantaged -- the system should clearly show 'New to Split Lease' as a neutral state, not a red flag."
      ],
      "existing_library_overlap": {
        "related_elements": ["rb-ui-101", "rb-ui-102", "rb-ui-103", "rb-ui-104", "guest-behaves-002"],
        "gap_assessment": "The Booking.com/Hooked run (rb-ui-101 through 104) already produced micro-review elements for the Stays Manager. These are the data-capture mechanism for the Passport. The gap is the aggregation and portability layer: the library has the input (micro-reviews) but not the output (cumulative portable profile). This is a direct extension. guest-behaves-002 addresses review behavior patterns. The Passport is the accumulation system that gives those micro-reviews a purpose beyond a single lease."
      }
    },
    {
      "id": "opp-0933-004",
      "title": "The House Anchor System: Identifying and Empowering the Hard Side",
      "based_on_disappointments": ["disappoint-003", "disappoint-008"],
      "split_lease_phases": ["active_lease", "proposal_mgmt", "retention"],
      "the_signature": "Split Lease would be the first platform to formally identify, tool, and reward the 'house anchor' -- the member of a shared house who does the invisible labor of making community work. In Chen's framework, these are the hard side at the house level: the Wikipedia editors of shared housing. After a guest reaches a tenure threshold and receives consistently positive micro-reviews, they are offered the House Anchor role with concrete tools: influence on who the next co-tenant is (reviewing Passport profiles of applicants), the ability to write a welcome note that new co-tenants see during pre-move-in onboarding, a visible 'Anchor' badge on their profile, and a tangible benefit (deposit credit, priority date selection, or price lock). When an Anchor's lease is renewed, the house network maintains continuity. When an Anchor refers a friend specifically to their house (not to the platform generically), both get a community referral bonus. This transforms referrals from marketing mechanism to community-building mechanism.",
      "why_competitors_wont_copy": "PadSplit treats all members as identical tenants -- equal rules, equal interface, equal relationship with the platform. Introducing a tiered member role (Anchor vs. regular) would conflict with their egalitarian positioning and create moderation complexity at their scale (thousands of houses). Furthermore, the Anchor role requires house-level data (who keeps shared spaces clean, who welcomes newcomers) that PadSplit's billing-portal dashboard does not collect. Split Lease's weekly micro-reviews and Stays Manager provide exactly this data. The Anchor system also requires long enough tenures for the role to develop -- PadSplit's high churn means most houses never stabilize enough for Anchors to emerge.",
      "behavioral_framework_case": "Chen (Ch. 7 - The Hard Side): 'There is a minority of users that create disproportionate value and as a result, have disproportionate power. This is the hard side of your network. They do more work and contribute more to your network, but are that much harder to acquire and retain.' Wikipedia's editors are motivated by community, status, and purpose -- not money. The house anchor in shared housing is the same: they coordinate trash schedules, mediate conflicts, welcome newcomers because they care about their home, not because they're paid. But Chen's key insight is: 'Attracting and retaining content creators is paramount. Their motivations might seem unusual -- it's certainly not economic.' PadSplit ignores these users. Split Lease would recognize and tool them.",
      "user_evidence": "Sherene: 'that's my concern... person can't show up and the room is not right clean with like fresh everything' -- describing the host as anchor, maintaining standards. Tammy: multi-property host doing extensive invisible vetting labor. The agent in andreas-call: 'we matched them as roommates... they've even met each other already' -- the agent currently performs the matching role that the House Anchor could partially absorb. Discovery-001 from L2: 'hosts demand human mediation before accepting strangers' -- the Anchor becomes a peer-level trust mediator within the house.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "moderate",
        "alignment": "natural_fit"
      },
      "anti_patterns": [
        "DO NOT make the Anchor role an obligation. It must feel like earned recognition with optional perks, not a responsibility assignment. Anchors can decline the role at any time.",
        "DO NOT give Anchors veto power over new co-tenants. They get influence (reviewing profiles, writing welcome notes) not control (blocking applicants). The platform retains final matching authority.",
        "DO NOT create a power dynamic between Anchors and non-Anchors within the house. The Anchor is first-among-equals, not a house manager. Their tools are social (welcome notes, profile reviews) not administrative (rule enforcement).",
        "DO NOT tie Anchor status exclusively to tenure. A 4-week guest who is exceptionally communicative and receives glowing micro-reviews should be eligible. Behavior matters more than time."
      ],
      "existing_library_overlap": {
        "related_elements": ["works-005", "guest-communicates-005", "rb-ui-0901-003"],
        "gap_assessment": "works-005 (Engineer the Host-as-Advisor Moment) addresses the psychological shift from evaluator to contributor for hosts. The House Anchor system extends this to the guest side: guests who become Anchors shift from 'tenant' to 'community steward.' guest-communicates-005 addresses house-level communication -- the Anchor system adds a role structure on top of the communication layer. rb-ui-0901-003 (from the Sonder/Lean UX run) may touch on engagement roles. The gap is the formal role recognition system itself -- no library element currently creates a named, tooled, benefited peer role within a shared house."
      }
    },
    {
      "id": "opp-0933-005",
      "title": "The Magic Moment: Social Search That Surfaces Houses-as-Communities",
      "based_on_disappointments": ["disappoint-009", "disappoint-001"],
      "split_lease_phases": ["search", "listing_evaluation", "discovery"],
      "the_signature": "Split Lease would transform shared-housing search from room-shopping to community-finding. Listing cards would lead with a 'House Personality' -- a brief, auto-generated summary based on co-tenant profiles and micro-review themes: 'Quiet professionals house. Night-shift healthcare workers and remote developers. Shared kitchen active on weekends.' Guests could filter by lifestyle alignment: work schedule compatibility, social vs. private preference, noise tolerance. The listing detail page would show co-tenant silhouettes with schedule overlaps ('You and your potential housemate are both away Mon-Fri, home weekends -- minimal shared-space overlap'). This makes the most important variable in shared housing -- the people -- visible during search rather than invisible until after commitment. Chen calls this the 'magic moment': when a user opens the product and finds a network built out enough to be valuable. In shared housing, the magic moment is: 'I can see who lives here, and they seem like my kind of people.'",
      "why_competitors_wont_copy": "PadSplit's search infrastructure is built on room attributes (price, location, amenities) not people attributes (lifestyle, schedule, personality). Retrofitting their search to surface house personality would require: collecting compatibility data from existing members (which their billing-portal engagement model does not support), generating house personality summaries (which requires sustained micro-review data they do not have), and changing their search paradigm from inventory-browsing to community-matching (which conflicts with their fill-rate optimization). Additionally, PadSplit's 4-8 person houses with high turnover make house personality unstable -- the personality changes every time someone moves out. Split Lease's 2-person shared spaces create more stable house personalities because each individual has proportionally more influence on the character of the home.",
      "behavioral_framework_case": "Chen (Ch. 8 - Solve a Hard Problem): 'The answer is by building a product that solves an important need for the hard side.' Tinder's innovation was making the hard side's experience feel social and low-friction rather than transactional. PadSplit's search is transactional: price, location, amenities. Chen (Ch. 6): 'Your product's first atomic network is probably smaller and more specific than you think.' Social search enables guests to self-select into compatible atomic networks rather than being randomly assembled. This increases the probability that each house's atomic network reaches the stability threshold that makes it self-sustaining.",
      "user_evidence": "Susan Bryant: 'Would somebody else be in the place when she's there?' -- the first question after logistics is about the people. Frederick/Valerie: 'what I thought I'd be sharing it with the host. So I thought it would be like, just me and the other person' -- the listing did not communicate the social arrangement. Vince: 'I've never done something like this. How does this work... are you splitting it with like a hotel, like multiple people throughout the week?' -- the listing failed to convey the social reality.",
      "opportunity_score": {
        "signature_potential": "high",
        "category_gap": "entire_category",
        "user_validation": "moderate",
        "framework_support": "strong",
        "feasibility": "ambitious",
        "alignment": "core_to_brand"
      },
      "anti_patterns": [
        "DO NOT display identifying information about current co-tenants without their consent. Use anonymized profiles (schedule, interests, general profession) not names or photos, unless the co-tenant opts in.",
        "DO NOT over-promise compatibility. The house personality is a signal, not a guarantee. Frame it as 'this house tends to be...' not 'you will definitely get along.'",
        "DO NOT make social search the only search mode. Some guests care primarily about price and location. Social search should enhance the existing search, not replace it.",
        "DO NOT use compatibility scoring that could create Fair Housing issues. Stick to lifestyle and schedule preferences that are legally permissible for roommate matching."
      ],
      "existing_library_overlap": {
        "related_elements": ["guest-looks-003", "guest-looks-004", "guest-communicates-003"],
        "gap_assessment": "The library has guest-facing listing evaluation elements (guest-looks-003, guest-looks-004) that address how listings present information visually. These focus on the room/property presentation. The gap is the social layer: no existing element surfaces co-tenant information or house personality during search. guest-communicates-003 may address listing copy patterns. This opportunity fills a genuine gap -- the library covers how listings look but not who lives there."
      }
    }
  ],
  "opportunity_ranking": [
    {
      "id": "opp-0933-001",
      "rank": 1,
      "reason": "The House Atomic Network is the foundational opportunity because it addresses the root cause of PadSplit's failure: houses are inventory, not communities. Without pre-move-in community activation, all other opportunities (engagement ladder, passport, anchor system) operate on a weaker substrate. This opportunity has the strongest transcript validation (5 direct quotes from 4 transcripts), the strongest framework support (Chen's atomic network and anti-network effects chapters apply directly), and the clearest category gap (no shared housing platform introduces you to your housemates before move-in). It is also the most feasible starting point because Split Lease's agent-mediated model already does informal versions of this (Zoom introductions, LinkedIn sharing)."
    },
    {
      "id": "opp-0933-002",
      "rank": 2,
      "reason": "The Engagement Ladder is ranked second because it leverages the Stays Manager -- Split Lease's most validated asset (7+ independent processes have now identified it as foundational). The Stays Manager's weekly cadence is the engagement substrate that PadSplit completely lacks. This opportunity converts an existing architectural advantage (the weekly touchpoint) into a progressive value system that creates retention through increasing investment rather than inertia."
    },
    {
      "id": "opp-0933-003",
      "rank": 3,
      "reason": "The Shared Housing Passport is ranked third because it is the moat -- the switching cost that makes the entire system defensible. Without portable reputation, guests can leave Split Lease at zero cost. With it, leaving means losing months of accumulated trust that provides tangible benefits. This opportunity also connects directly to the Booking.com/Hooked run's micro-review system, creating a cross-run reinforcement signal."
    },
    {
      "id": "opp-0933-004",
      "rank": 4,
      "reason": "The House Anchor System is ranked fourth because it identifies and empowers the hard side at the house level -- the users who make community work. This is critical for house stability but depends on the engagement ladder (opp-0933-002) and passport (opp-0933-003) to identify and credential Anchors. It is a force multiplier on the other opportunities rather than a standalone signature."
    },
    {
      "id": "opp-0933-005",
      "rank": 5,
      "reason": "Social Search is ranked fifth because, while it has the highest 'wow factor' for first-time users, it requires the most data infrastructure to execute well (co-tenant profiles, micro-review themes, schedule overlap calculations). It is the top-of-funnel expression of the community thesis but depends on the bottom-of-funnel elements (engagement ladder, passport) to generate the data that makes social search meaningful. Build the community engine first, then surface it in search."
    }
  ],
  "strategic_narrative": "PadSplit proved that shared housing can be institutionalized at scale. They also proved, inadvertently, that institutionalization without community produces a commodity. PadSplit's members stay because the math works, not because they have something to lose. Their houses are collections of individual tenancies managed by a billing system, not communities maintained by engaged residents. Every house is permanently in Chen's Cold Start phase because no social network is ever built. The opportunity for Split Lease is to be the platform that builds the social network inside each house -- and then compounds it across houses through portable reputation.\n\nThe five opportunities form an integrated system, not a feature list. The House Atomic Network (opp-0933-001) seeds community before move-in. The Engagement Ladder (opp-0933-002) grows that community over 13 weeks through the Stays Manager. The Shared Housing Passport (opp-0933-003) accumulates trust across leases, creating switching costs and a defensible moat. The House Anchor System (opp-0933-004) identifies and empowers the 'Wikipedia editors' of each house -- the hard-side users who make the community self-sustaining. And Social Search (opp-0933-005) makes the community visible to prospective guests, closing the acquisition loop. Together, they generate all three of Chen's Escape Velocity forces: the Acquisition Effect (community-driven referrals and social search), the Engagement Effect (progressive value via the Stays Manager ladder), and the Economic Effect (passport benefits, anchor perks, tenure pricing). PadSplit has none of these forces.\n\nThe strategic vision is not to build a better PadSplit. It is to build what PadSplit structurally cannot become: a platform where shared housing is a community you accumulate value in, not a room you rent from. If Split Lease nails these five opportunities, it becomes the only shared-housing platform where leaving is costly -- not because of lease penalties, but because you would lose your reputation, your community role, your tenure benefits, and the pre-built social context of your next house. That is a network-effect moat. And it is the one thing a commodity room marketplace can never build."
}
